[
  {
    "Course Title": "Advanced Computer Architecture",
    "Course Code": "CS2.501",
    "Course Description": null,
    "LOs/COs": [
      "CO-1: Explain the principles and practices underlying the design of modern processors",
      "CO-2: Explain the principles and practices underlying the design of memory hierarchies",
      "CO-3: Be able to analyze the different aspects of a processor/memory architecture qualitatively and quantitively, and further develop strategies to mitigate any observed bottlenecks",
      "CO-4: Explain and identify security vulnerabilities in modern computing systems. Be able to propose techniques to circumvent the identified threats"
    ],
    "Detailed Syllabus": "Unit 1: Instruction Level Parallelism and Superscalar Processors; Microarchitecture design and analysis of Out-of-Order processors; Compiler and Architecture Interactions. Unit 2: Data Level Parallelism and SIMD/GPU Architectures; Vector Architectures; GPUs; Compiler and Architecture Interactions. Unit 3: Memory Hierarchy Design and Emerging Memory Technologies; Design of Cache Memory; Distributed Shared Memory; Memory Consistency Models; Non-volatile memories. Unit 4: Emerging and Domain Specific Accelerators; Hardware accelerators for deep neural networks and Genomics; AMD AI/ML Engine; TPUs. Unit 5: AI/ML Techniques in Architecture; Reinforcement Learning Techniques in Cache Optimization, Branch Prediction etc.; Power Management. Unit 6: Security; Side Channel Attacks such as Spectre and Meltdown"
  },
  {
    "Course Title": "Advanced Computer Networks",
    "Course Code": "CS3.402",
    "Course Description": null,
    "LOs/COs": [
      "CO-1: Demonstrate a familiarity with concepts of network management, standards, and protocols",
      "CO-2: Discuss various privacy-enhancing techniques used in modern computer networks",
      "CO-3: Apply the knowledge of distance-vector (RIP and IGRP) and link-state (OSPF and IS-IS) routing protocols to find routing paths for a variety of networks",
      "CO-4: Analyze wireless LAN technologies including IEEE 802.11",
      "CO-5: Design efficient routing protocols for advanced computer networks (e.g., SDN and ICN)",
      "CO-6: Develop a framework for building a large-scale enterprise network"
    ],
    "Detailed Syllabus": "Unit 1: Modeling and measurement: Network traffic modeling, network measurement, simulation issues, network coding techniques. Unit 2: Flow and congestion control, TCP variants, TCP modeling, active queue management. Unit 3: Routing: Router design, scheduling, QoS, integrated and differentiated services. Unit 4: Wireless networks: Mobility supports, MAC, multicast. Unit 5: Overlay networks and Emerging applications: SDN, ICN, P2P, CDN, Web caching, cross-layer optimizations, VoIP, SIP, video over P2P"
  },
  {
    "Course Title": "Advanced Natural Language Processing (NLP)",
    "Course Code": "CS7.501",
    "Course Description": null,
    "LOs/COs": [
      "CO-1: Demonstrate the knowledge of Advanced building blocks of NLP",
      "CO-2: Apply NLP machine learning algorithms for Machine Translation, Summarization",
      "CO-3: Demonstrate the knowledge of Dense and contextual representation for NLP",
      "CO-4: Explain the concepts behind Deep Learning models",
      "CO-5: Discuss the approaches to global and contextual semantic representation",
      "CO-6: Apply the above concepts for fundamental NLP tasks"
    ],
    "Detailed Syllabus": "Unit 1: Distributed Semantics. Unit 2: Contextual Distributed Semantics; Models such as ELMO, BERT, ERNIE and their derivatives. Unit 3: Statistical Machine Translation methods; Early Neural Machine Translation models. Unit 4: Extractive and Abstractive Summarization; Neural Summarization Methods. Unit 5: Reinforcement learning for NLP"
  },
  {
    "Course Title": "Advanced Operating Systems",
    "Course Code": "CS3.304",
    "Course Description": null,
    "LOs/COs": [
      "CO 1: Understanding the principles of design of operating systems",
      "CO 2: Look at four major OS Components in depth: System Call, Memory Management, CPU Scheduling and Concurrency",
      "CO 3: Understanding the design and functioning of Linux kernel components",
      "CO 4: Experiencing the kernel by passive/active observation",
      "CO 5: Extending the Linux kernel for deeper understanding",
      "CO 6: Exploring current research trends in OS, Linux being the reference OS"
    ],
    "Detailed Syllabus": "History of Operating Systems, Processes and OS Abstractions, OS APIs, Interrupts and system calls, Introduction to the Linux Kernel, Compiling the kernel, Module programming, Writing your own system calls, Overview of kernel startup and initialization, Kernel Debugging Techniques, Interrupts PICS, APICS, exceptions (traps) and hard interrupts, IDTs, Address Spaces and Loading, Virtual Memory, Memory allocators, Overview of memory spaces: logical segmentation, linear virtual, actual physical, Detecting BIOS-provided physical RAM map, paging, buddy system, setting up page directories (global, upper, middle), tables and PTES, (N)UMA, nodes, zone, memory types, Setting up buddy system, Allocating contiguous pages from buddy system, Setting up slabs for small memory objects, CPU Scheduling, Threads, Process structures, organization, initialization, Concurrent Programming, Locking, Deadlocks, Structures: thread union, thread info, stack, task, and thread struct, Creating kernel threads, using kthread, Kernel process scheduling, Scheduling processes with red-black tree, process switching, Context switches, Switching to suspended process, Linux File Systems and Disk Scheduling"
  },
  {
    "Course Title": "Algorithms and Operating Systems",
    "Course Code": "CS3.306",
    "Course Description": null,
    "LOs/COs": [
      "CO-1: Learn the components of an Operating system, its requirement and how the Operating System handles memory management, files, process synchronization and deadlocks",
      "CO-2: Apply the concepts taught to create and evaluate algorithms that allow process synchronization, solve problems to evaluate how an Operating system manages a given memory requirement, determine whether a particular scenario leads to a deadlock and how to avoid it",
      "CO-3: Implement an application on the top of given operating system in an efficient manner based on process and thread framework available in the given operating system",
      "CO-4: Familiarize students with algorithmic thinking, design and evaluating the complexity of the algorithm. Students should be able to compare between different data structures and possible algorithms and pick an appropriate one for a design requirement",
      "CO-5: Apply principles of dynamic programming, divide and conquer and greedy algorithms. Design and analyze them when required. Argue the correctness of algorithms using proofs",
      "CO-6: Introduce graph algorithms. Students should be able to model a problem into a graph structure when required and use graph concepts to solve the problems"
    ],
    "Detailed Syllabus": "Unit 1: Introduction to Operating Systems; Introduction to Algorithms and Complexity; Introduction to Process, multithreading and process scheduling. Unit 2: Process Synchronization; Greedy Algorithms; Divide and Conquer Algorithms. Unit 3: Dynamic Programming; Memory Management. Unit 4: Deadlocks; Graph Algorithms"
  },
  {
    "Course Title": "Algorithm Analysis and Design",
    "Course Code": "CS1.301",
    "Course Description": null,
    "LOs/COs": [
      "CO-1: Demonstrate the ability to fully understand the analysis of various known algorithms",
      "CO-2: Identify problems where various algorithm design paradigms can possibly be applied",
      "CO-3: Understand the notions of computational intractability and learn how to cope with hardness",
      "CO-4: Understand the notion of approximation and randomized algorithms. If time permits, intro to quantum algorithms"
    ],
    "Detailed Syllabus": "1. Basic graph algorithms; 2. Greedy algorithms; 3. Divide and Conquer; 4. Dynamic Programming; 5. Network flows; 6. NP and computational intractability; 7. Intro to Approximation and Randomized algorithms; 8. Intro to Quantum algorithms"
  },
  {
    "Course Title": "Applied Ethics",
    "Course Code": "HS0.303",
    "Course Description": null,
    "LOs/COs": [
      "CO1: Explain the philosophical nature of the basic concepts and principles of ethics",
      "CO2: Analyze ethical arguments for logical validity, soundness, and informal fallacies",
      "CO3: Demonstrate the knowledge of conceptual challenges involved in normative inquiry in the ethical domain",
      "CO4: Develop skills to formulate fundamental nuances in ethical justification and explanations",
      "CO5: Identify the various kinds of normative elements that constitute ethical frameworks",
      "CO6: Discuss the major tenets of normative ethical theories and their scope of application"
    ],
    "Detailed Syllabus": "Unit I- Introduction: Distinction between conventional and critical ethics, philosophical tools for argument analysis, intuition, evidence, justification, and explanation. Unit II - Skepticism: Intrinsic vs Instrumental value, challenge of egoism, problem of cultural relativity and subjectivism, error theory and nihilism, distinction between being ethical and seeming ethical. Unit III - Goodness: the problem of defining 'good', naturalistic fallacy and the open question argument, implications of the experience machine thought experiment. Unit IV - Responsibility: challenge of attributing moral responsibility to agents, the control, competence and epistemic conditions of responsibility, moral luck. Unit V - Normative theories: Consequentialism, deontology, and virtue ethics. Unit VI - Practical ethics: discussion of specific moral problems"
  },
  {
    "Course Title": "Automata Theory",
    "Course Code": "CS1.302",
    "Course Description": null,
    "LOs/COs": [
      "CO-1: Develop an understanding of the core concepts of Automata theory such as Deterministic Finite Automata, Non-deterministic Finite Automata, Regular Languages, Context Free Languages, Push down Automata, the basics of Turing Machines",
      "CO-2: Design grammar and automata for different languages",
      "CO-3: Identify formal language classes and prove language membership properties",
      "CO-4: Describe the limitations of the different computational models"
    ],
    "Detailed Syllabus": "Unit 1: Introduction, Finite State Machines, Deterministic Finite Automata (DFA), Nondeterministic Finite Automata (NFA), Equivalence of NFA and DFA, Regular Expressions, Regular Languages, Closure Properties of regular languages, Pumping Lemma, Grammars, Left and Right-linear grammars. Unit 2: Context Free Grammar (CFG), Chomsky Normal Form, Push Down Automata (PDA), Equivalence of CFG and PDA, Context Free Languages (CFL), Deterministic PDA and Deterministic CFL, Pumping Lemma for context free languages. Unit 3: Introduction to Turing machines, Total Turing Machines, Recursive languages, Recursively enumerable languages, The Halting problem"
  },
  {
    "Course Title": "Basics of Ethics",
    "Course Code": "HS0.203",
    "Course Description": null,
    "LOs/COs": [
      "CO1: Explain the philosophical nature of the basic concepts and principles of ethics",
      "CO2: Analyze ethical arguments for logical validity, soundness, and informal fallacies",
      "CO3: Demonstrate the knowledge of conceptual challenges involved in normative inquiry in the ethical domain",
      "CO4: Develop skills to formulate fundamental nuances in ethical justification and explanations",
      "CO5: Identify the various kinds of normative elements that constitute ethical frameworks",
      "CO6: Discuss the major tenets of normative ethical theories and their scope of application"
    ],
    "Detailed Syllabus": "Unit I - Introduction: Distinction between conventional and critical ethics, philosophical tools for argument analysis, intuition, evidence, justification, and explanation. Unit II - Skepticism: Intrinsic vs Instrumental value, challenge of egoism, problem of cultural relativity and subjectivism, error theory and nihilism, distinction between being ethical and seeming ethical. Unit III - Goodness: the problem of defining 'good', naturalistic fallacy and the open question argument, implications of the experience machine thought experiment. Unit IV - Responsibility: challenge of attributing moral responsibility to agents, the control, competence and epistemic conditions of responsibility, moral luck. Unit V - Normative theories: Consequentialism, deontology, and virtue ethics"
  },
  {
    "Course Title": "Behavioral Research: Experimental Design",
    "Course Code": "CG3.402",
    "Course Description": null,
    "LOs/COs": [
      "CO-1: To develop understanding of the basic framework of behavioral research process",
      "CO-2: To identify various sources of information for literature review for operationalization and data collection",
      "CO-3: To develop an understanding of various experimental designs and analyses techniques and apply in their own final projects",
      "CO-4: To operationalize a research question and design, deploy behavioral experiments and analyze the data collected thereof using appropriate statistical tests",
      "CO-5: To develop an understanding and evaluate the ethical dimensions of conducting applied research",
      "CO-6: Appreciate the components of scholarly writing and evaluate its quality. Create and develop their unique way of writing and presenting their work whilst balancing scientific standards to effective communication"
    ],
    "Detailed Syllabus": "1. Introduction to Research Methods: Qualitative and Quantitative Approaches; Conducting Behavioural Research; Ethics in Research; Institute Review Board (IRB) Process. 2. Starting on Research, Experimental Design: Hypothesis Testing, Type I and II errors, Hypothesis-based vs Exploratory Research, Operationalizing Research, Literature Review; Sampling, Types of variables and levels of Measurements, Designing an Experiment; Validity, Reliability and Cross-validation in Research. 3. Types of Experimental design: Non-Experimental Designs, Pilot Testing; Data Collection: Surveys Questionnaires; Data Representation: Levels of Measurement, Human Annotation, Different types of design: Simple randomized design, Factorial designs, Simple repeated measures design, Randomized blocks design, Latin square type designs, Between-subject and within-subject factors in an experiment; Scaling Behavioural Experiments: web and mobile experiments, crowdsourcing, big data, large-scale experiments, citizen science, online data collection (PsiTurk, Mechanical Turk, etc). 4. Data Visualization and Analysis: Descriptive Statistics, Tests of Normality and Data Transformation, Outliers, Collinearity in Data, Data Summarization vs Data Reduction Techniques: Exploratory Factor Analysis, Principal Component Analysis, Discriminant Factor Analysis. 5. Introduction to Statistical Analysis: Inferential Statistics-Tests of Difference and Tests of Association: Multi-level tests (ANOVA): nonparametric and parametric tests of difference chi-square test, Mann Whitney U test, Binomial Sign test, Wilcoxon's T test, Related and Unrelated t tests; nonparametric and parametric tests of association correlation, regression; Significance testing. 6. Communicating and Assessing Research: Writing, Poster and general Presentations (formatting of the research paper using APA and IEEE journal/conference formats)"
  },
  {
    "Course Title": "Bioinformatics",
    "Course Code": "SC3.202",
    "Course Description": null,
    "LOs/COs": [
      "CO-1: Use various web-based bioinformatic resources (databases and tools) judiciously",
      "CO-2: Understand and implement methods for various biological sequence analysis, viz., pattern search and sequence comparison (pairwise and multiple sequence alignments), and phylogenetic reconstruction, gene prediction",
      "CO-3: Familiarize with the probabilistic models in biological sequence analysis"
    ],
    "Detailed Syllabus": "Unit 1: Overview Bioinformatics, Gene and Genome structure, Gene Technology Restriction Endonucleases, Cloning vectors, DNA sequencing - PCR, cDNA and Whole Genome sequencing, NGS and third generation sequencing technologies. Unit 2: Bio Databases: Major Bioinformatics Resources NCBI, EBI, PubMed, Primary Nucleotide and Proteins Databases - GenBank, Uniport, PDB, Genome Browsers - Ensemble, UCSC, k-mer analysis and their significance in biological sequences. Unit 3: Sequence Alignment: Pairwise Alignment - Types of pairwise alignments - Global, Local and Overlap alignments, Dot Plots, dynamic programming (DP) algorithm, Scoring matrices for nucleotides and proteins and gap penalties, Sequence-based Database Search algorithms - BLAST, FASTA, Multiple Alignment, Algorithms for Global and Local MSA - DP, Progressive based (ClustalX), Iterative methods, motif search-based methods. Unit 4: Modeling Molecular Evolution - Phylogeny: Markov models of base substitution, Computing Phylogenetic Distances, Phylogenetic Tree Construction Methods, PHYLIP. Unit 5: Gene Prediction: Gene Prediction approaches Open Reading Frames, Homology search, Content-based methods, Markov models"
  },
  {
    "Course Title": "Bio-instrumentation and Devices",
    "Course Code": "EC1.202",
    "Course Description": null,
    "LOs/COs": [
      "CO-1: Describe and explain the generation of action potentials in neurons and cardio- electrophysiology",
      "CO-2: They will be able to explain, and design system for picking up the electrophysiological signal and amplify it",
      "CO-3: Design & analysis of circuit for processing electrophysiological system",
      "CO-4: Explain the basis of micro fabrication and micro fluidic based systems",
      "CO-5: Understand the fundamental operation of diagnostic devices"
    ],
    "Detailed Syllabus": "Module 1: Biological signals: electrophysiology (cardio, near, muscular); other signals. Understanding various biological system and the electrical signal they generate. Capturing the signals for biomedical systems. Micro-electrode arrays and micro-electrode systems. Module 2: Amplification & Signal Conditioning basics: Opamps; Instrumentation Amplifier; TIA: Review of analog circuits and amplifiers (AEC). Circuit system for specific applications. Module 3: CMOS VLSI circuit design, Potentiostat; switch cap amps: Discussion and analysis of specialized circuits and circuit design techniques for low power. Module 4: Diagnostic devices: UTAS & Lab-on-a-chip (RT PCR, On-chip-olfaction): Introduction to Bio-MEMs, Micro-fluidics. Basics of device fabrication theory (non-semiconductor). Status quo and review of some cutting-edge lab-on-chip applications. Introduction to smart systems. Module 5: JFET, ISFET, ChemFET; Non-electrical devices: Introduction to other semiconductor and non-semiconductor-based devices. Discussion and working of various devices. Current and future trends. Brief discussion on FinFETs. Module 6: Noise & noise efficient design"
  },
  {
    "Course Title": "Biomolecular Structure Interactions and Dynamics",
    "Course Code": "SC3.321",
    "Course Description": null,
    "LOs/COs": [
      "CO-1: Review of physicochemical principles at the molecular level",
      "CO-2: From molecules to biochemical systems appreciation of principles of kinetics and thermodynamics for understanding mechanisms of interactions and reactions of biomolecules",
      "CO-3: Appreciation of the experimental methods used for exploring structures of biomolecules",
      "CO-3: Understanding of important structural concepts used for the analysis of protein and nucleic acid structures",
      "CO-4: Learning to use and understanding the principles of molecular modeling, docking and molecular dynamics simulations for inferring structures, functions and interactions from sequences",
      "CO-5: Familiarity with important structural and functional databases and their usefulness in biological contexts"
    ],
    "Detailed Syllabus": "Navigating the 'Sequence - Structure - Function' Space for Biomolecules. Understanding the 'physicochemical' principles underlying the 'structure-interaction-dynamics-function' of biomolecular machines. Application of the above principles to analyze the relationship of few molecular systems"
  },
  {
    "Course Title": "Blockchain and Web3 Development",
    "Course Code": "TBD",
    "Course Description": null,
    "LOs/COs": [
      "CO-1: Demonstrate a familiarity with the knowledge of distributed ledger technology",
      "CO-2: Discuss different blockchain consensus mechanisms",
      "CO-3: Discuss various building blocks in the Solidity programming language",
      "CO-4: Apply the knowledge of smart contracts development to build DApps",
      "CO-5: Experiment and assess security, scalability, and storage requirements of smart contracts"
    ],
    "Detailed Syllabus": "Unit 1: Introduction to decentralization and distributed consensus, Bitcoin blockchain, transactions and scripting, addresses and wallets, crypto mining, security attacks and anonymity in blockchain. Unit 2: Bitcoin vs. Ethereum, the need for smart contracts, tokens vs. coins, Ethereum Virtual Machine (EVM), isolation and security in EVM execution model, gas system, PoS consensus. Unit 3: Solidity, Remix IDE, basic variable types, functions, arrays, structs, and mappings, handling errors, imports, modifiers, inheritance, events and return variables, interacting with contract Application Binary Interface (ABI), memory modifiers and cost concerns, token standards (ERC-20, ERC-721, and ERC-1155). Unit 4: DApps, backend languages, development frameworks (Truffle vs. Hardhat vs. Foundry), integrating frontend, backend, and smart contracts, unit tests, interacting with the outside world using Oracles, decentralized storage (temporarily on IPFS, permanently on Arweave), secure development using Open Zeppelin, upgradable smart contracts. Unit 5: Scaling solutions, state channels, payment channels (PCN and PCH), side/child chains, commit and Plasma chains, Rollups (zk and Optimistic), cross chains, hybrid solutions"
  },
  {
    "Course Title": "Business Fundamentals",
    "Course Code": "PD2.421",
    "Course Description": null,
    "LOs/COs": [
      "CO1: Demonstrate a clear comprehension of basic concepts of management",
      "CO2: Exhibit ability to understand the different strategic initiatives adopted by a firm to provide more value to its customers",
      "CO3: Develop capabilities for demonstrating leadership in decision making in product management roles",
      "CO4: Develop capabilities to undertake appropriate decision-making to optimize cost in developing a product by appropriately managing resources",
      "CO5: Develop overall capability required for product development and product marketing"
    ],
    "Detailed Syllabus": "Introduction to Foundations of Business; Forms of Business Ownership; Business and Economics; Organization Structure; Fundamental areas of Management: Operations Management, HR, Marketing, Accounting and Finance, Information Systems, Strategy Management; Ethics and Social Responsibility; Total Quality Management; Product Development Process and Value Creation; Managing Teams, Leadership and Global Business"
  },
  {
    "Course Title": "Chemistry Topics for Engineers",
    "Course Code": "SC2.309",
    "Course Description": null,
    "LOs/COs": [
      "CO-1: Demonstrate understanding of the chemical principles behind spectroscopy",
      "CO-2: Apply the various spectroscopies to solve for chemical identity of system under study",
      "CO-3: Provide students with a conceptual understanding of electronic properties in solid materials",
      "CO-4: Define terminology used in the fields of modern materials chemistry",
      "CO-5: Learn and identify various applications of modern materials and their future potential",
      "CO-6: Learn the importance and various methods of green synthesis"
    ],
    "Detailed Syllabus": "Unit 1: Introduction to modern atomic theory and its application to explain the atomic spectra and molecular spectra. Origin of electronic, vibrational and rotational levels, and their signatures in spectra. Unit 2: Excited states of atom and molecules. Lasers. Fluorescence, phosphorescence, and Froster energy transfer. Unit 3: Introduction to Nuclear Magnetic Resonance Spectroscopy, and Electron Spin Resonance Spectroscopy. Unit 4: Modern Electrochemistry. Butler-Volmer equation. Biosensing using electrochemical principles. Unit 5: Molecular Orbital Theory (Polar and Ionic compounds, Conductors, Semiconductor); Inorganic Pigments and Phosphors; and Superconductors Chemistry. Unit 6: Modern and Futuristic Materials: Hydrides and Hydrogen Storage Materials; Molecular Materials; Liquid Crystals; Conducting Polymers; Supramolecular and Nanostructured Materials. Unit 7: Green Synthesis: Principles and methods of synthesis with examples"
  },
  {
    "Course Title": "Chemical Kinetics and Reaction Dynamics",
    "Course Code": "SC2.305",
    "Course Description": null,
    "LOs/COs": [
      "CO-1: Determine the rate law for a reaction, the overall order of reaction, the integrated rate laws, the rate constants of the reactions and temperature dependence, and the order of the reaction from concentration/time plots and apply the rate equations to determine the concentration of chemical species and order of the chemical reactions",
      "CO-2: Explain a reaction mechanism, identify the reaction intermediates and catalysts, determine the molecularity of each step, write the overall reaction, and explain how enzymes act as biological catalysts and why enzymatic reactions respond differently to temperature changes",
      "CO-3: Interpret a potential energy diagram and a reaction coordinate diagram, potential energy profiles and use them to determine the activation energy and potential energy changes for a reaction",
      "CO-4: Use Collision Theory to explain how reactions occur at the molecular level, the concept of activation energy and how the collision frequency, kinetic energy, temperature, and orientation of colliding reactant molecules affect the rate of a chemical reaction",
      "CO-5: Apply transition state theory to explain the roles of various physical factors that govern chemical reactivity",
      "CO-6: Describe the physical principles that govern electron transfer reactions and explain Marcus theory",
      "CO-7: Solve problems on chemical kinetics and reaction dynamics of unimolecular, bimolecular, and complex reactions",
      "CO-8: Relate experimental observations to theoretical aspects of chemical kinetics and identify applications of chemical kinetics in everyday life and industry"
    ],
    "Detailed Syllabus": "Unit 1: Empirical chemical kinetics: Experimental techniques; The rates of reactions; Integrated rate laws; Reactions approaching equilibrium; The temperature dependence of reaction rates; Accounting for the rate laws; Elementary reactions; Consecutive elementary reactions; Impact on biochemistry: The kinetics of the helix-coil transition in polypeptides; Unimolecular reactions. Unit 2: Chain reactions; The rate laws of chain reactions; Explosions; Polymerization kinetics; Stepwise polymerization; Chain polymerization; Homogeneous catalysis; Features of homogeneous catalysis; Enzymes. Unit 3: Photochemistry, Kinetics of photophysical and photochemical processes; Impact on: The chemistry of stratospheric ozone; Applications: Impact on environmental sciences, biochemistry, and other areas. Unit 4: Molecular Reaction Dynamics: Reactive encounters; Collision theory; Diffusion-controlled reactions; The material balance equation. Unit 5: Transition state theory; The Eyring equation; Thermodynamic aspects; The dynamics of molecular collisions; Reactive collisions; Potential energy surfaces; Some results from experiments and calculations. Unit 6: The investigation of reaction dynamics with ultrafast laser techniques; Electron transfer in homogeneous systems; The rates of electron transfer processes; Theory of electron transfer processes; Experimental results; Impact on biochemistry: Electron transfer in and between proteins. Unit 7: Special topics (oscillating reactions, etc.)"
  },
  {
    "Course Title": "Computational Linguistics 2",
    "Course Code": "CL3.202",
    "Course Description": null,
    "LOs/COs": [
      "CO-1: Use computational methods to analyze language at semantic and pragmatic levels",
      "CO-2: Develop requisite skills for problem solving at discourse and conversation levels",
      "CO-3: Develop computational resources and tools for handling text, contextual interpretation of text and representation of meaning in context",
      "CO-4: Perform theoretical research in computational semantics and computational discourse analysis",
      "CO-5: Apply CL/NLP techniques for real world applications by using real time dialog and discourse data"
    ],
    "Detailed Syllabus": "Unit 1: Background for studying word meaning and sentence meaning, sentence meaning and propositional content; sense and reference; referent, extension, prototype, stereotype; deixis and definiteness; predicates, referring expressions, universe of discourse; properties of sentences analytic, contradiction, entailment; properties of predicates - reflexive, symmetry, transitive. Word meaning and sentence meaning, content word and grammatical word, contextual variation; Speaker meaning vs Sentence meaning. Building resources using Lexical semantic relations Synonymy, Antonymy, Hyponymy, Troponymy, Meronymy; Metaphor and Metonymy; Polysemy and Homonymy; Semantic fields; Lexical ambiguity; Building dictionaries; Ontologies. Unit 2: Formal Semantics: Formal representation of natural language semantic features, case frames, semantic primitives. Logic, notation for simple propositions; connectives and, or, but, if etc.; Logical expressions for ambiguous sentences. Unit 3: Pragmatics and Discourse: Pragmatics and Discourse analysis as a study of context dependent aspects of meaning; text, co-text, context and relevance. Computational Discourse analysis: Studying Structure of text and coherence; exchange structure and conversational analysis; turn taking; adjacency pairs; preference organization; deixis; anaphora; ellipsis; discourse connectives and relations; Structural analysis of different kinds of texts. Unit 4: Text classification and generation: Memory and knowledge representation as schemas - frames, scripts and story grammar; Generation and processing of texts: Sentiment Analysis. Humour Analysis. Unit 5: Computational Pragmatics: Language Understanding; Meaning beyond textual context; speaker's intention and hearer's inference; inference bridging inferences, causal and spatial inferences, elaborative and restrictive inferences; Application of pragmatic concepts in Dialogue Systems: conversational implicature, conventional implicature, entailment and presupposition; co-operative interaction and Gricean maxims; speech act theory; language as action, performatives, direct and indirect speech acts and felicity conditions; politeness maxims; Austin and Searle's speech acts; Dialogue data annotation: Dialog Acts, Rhetorical Structure Theory"
  },
  {
    "Course Title": "Computer Problem Solving",
    "Course Code": "CS0.301",
    "Course Description": null,
    "LOs/COs": [
      "CO-1: Demonstrate an understanding of computer programming language concepts",
      "CO-2: Ability to design and develop C programs, implement the concept of pointers, declarations, initialization, operations on pointers and their usage, arrays, functions. Able to define data types and use them",
      "CO-3: Ability to define and manage data structures based on problem subject domain",
      "CO-4: Ability to analyze the complexity of the solution offered"
    ],
    "Detailed Syllabus": "Unit 1: Basics of C Programming, Variables declaration, Input-Output, Operators. Unit 2: Arrays and Strings and Control Statements. Unit 3: Functions, Pointers. Unit 4: File Handling, Memory management. Unit 5: Stacks, queues, Linked Lists. Unit 6: Sorting Algorithms. Unit 7: Understanding Algorithm Complexity. Unit 8: Problem Solving and Computations Thinking"
  },
  {
    "Course Title": "Computer Programming",
    "Course Code": "CS0.101",
    "Course Description": null,
    "LOs/COs": [
      "CO-1: Explain the syntax of programming language constructs and their semantics and describe a program structure and its execution model",
      "CO-2: Describe the steps in program editing, compilation and execution using tools such as Visual Studio Code, GCC compiler on a Linux/Windows/MAC operating system",
      "CO-3: Choose appropriate primitive data types and design new composite data types to model the relevant data in a given computation problem and also discover the algorithmic logic required to solve well-defined computational problems",
      "CO-4: Compare and contrast the performance of different algorithmic approaches for simple computational problems with respect to time and memory",
      "CO-5: Write programs involving basic dynamic data structures such as linked lists and use tools such as Valgrind to detect any memory leaks",
      "CO-6: Use debugging tools such as GDB proficiently to rapidly isolate and remove subtle/complex bugs in programs",
      "CO-7: Manage complex large projects using source code management tools such as GIT and build tools such as Make",
      "CO-8: Assess and evaluate the solutions of their classmates through a peer review process"
    ],
    "Detailed Syllabus": "Unit 1: Basic computer organization, Von Neumann architecture and stored program concept; High level programming languages, assemble code, binary instructions, compilers and assemblers; Programming editing, compilation and execution cycle; Use of variables as reference to memory locations; Basic data types and their representation. Unit 2: Operators and precedence levels, expressions; Writing straight-line sequence of code; Standard I/O Libraries; Conditional Statements (if-then-else) and Loops (for, while etc.); Arrays. Unit 3: Functions and parameter passing mechanisms; Standard libraries for string manipulation, disk file access etc.; Structures, Unions and Enumerations. Unit 4: Recursion; Program stack, scope and lifetime of variables; Pointers, heap memory, dynamic memory management, linked lists and memory leaks. Unit 5: Preprocessor directives; Source code management tools like GIT and use of GDB for program debugging; Multi-file programming and Make files"
  },
  {
    "Course Title": "Computing in Sciences-1",
    "Course Code": "SC4.101",
    "Course Description": null,
    "LOs/COs": [
      "CO-1: Demonstrate understanding of basic concepts of molecular modelling",
      "CO-2: Demonstrate the familiarity in operating prepackaged software commonly used in molecular mechanics, quantum chemistry, and visualization of molecular systems",
      "CO-3: Compute (a) simple thermodynamic properties using quantum chemistry software for small molecules (b) thermodynamic properties using molecular dynamics software"
    ],
    "Detailed Syllabus": "Unit 1: Basic outline of application of quantum mechanics to molecule/s. Variational Theorem, and introduction to density functional theory. Basis sets. Geometry Optimization and Frequency calculation. And other 'simple' properties from output of Quantum Chemistry software. Unit 2: Motivation for Classical mechanical models of molecules. Use of Newtonian equations of motion to model dynamics of molecular systems. Motivation for ergodic hypothesis, and calculation of thermodynamic properties"
  },
  {
    "Course Title": "Data Analytics-I",
    "Course Code": "CS4.405",
    "Course Description": null,
    "LOs/COs": [
      "CO-1: describe the concepts of data summarization, data warehousing, pattern mining, classification and clustering approaches",
      "CO-2: perform the task of data summarization, pattern mining, classification and clustering based on the requirement",
      "CO-3: prescribe a single or a combination of data summarization, pattern mining, classification and clustering approaches for the problem scenario of a business/organization",
      "CO-4: construct the improved data analytics methods for existing services",
      "CO-5: formulate new data mining problems for creating new services and design thecorresponding solutions"
    ],
    "Detailed Syllabus": "Unit 1: Introduction, data summarization through characterization, discrimination and datawarehousing techniques; Unit 2: Concepts and algorithms for mining patterns and associations; Unit 3: Concepts and algorithms related to classification and regression; Unit 4: Concepts and algorithms for clustering the data; Unit 5: Outlier analysis and future trends"
  },
  {
    "Course Title": "Data and Applications [Half]",
    "Course Code": "CS4.301",
    "Course Description": null,
    "LOs/COs": [
      "CO-1: State data requirements for an application",
      "CO-2: Develop a conceptual model (such as, Entity Relationship Model and Diagram) for a set of data requirements",
      "CO-3: Comprehend relational data model and integrity constraints, and relational database design with normalization",
      "CO-4: Map the conceptual model to a relational data model and create and populate its corresponding relational database",
      "CO-5: Map user queries into correct relational algebra, Structured Query Language (SQL), and tuple relational calculus expressions/statements",
      "CO-6: Implement an application to access, query and update a relational database"
    ],
    "Detailed Syllabus": "Unit 1: Data, Database, Database System; Unit 2: Data models, Conceptual Data Modeling, ER Models; Unit 3: Relational Data Model, Relational Algebra, Tuple Relational Calculus; Unit 4: SQL, Constraints, Triggers, Database Connectivity, Applications; Unit 5: Normalization, Relational Database Design"
  },
  {
    "Course Title": "Data Structures & Algorithms for Problem Solving",
    "Course Code": "CS1.304",
    "Course Description": null,
    "LOs/COs": [
      "CO-1: Understanding of fundamental and advanced Data Structures including linked-lists, trees, binary search trees, AVL trees, stacks, queues, heaps, hash-table, tries and suffix tree",
      "CO-2: Ability to program data structures and use them in implementations of abstract data types",
      "CO-3: Ability to devise novel solutions to small scale programming challenges involving data structures and recursion",
      "CO-4: Understand basic algorithms including recursion, searching, hashing, dynamic programming, and traversal",
      "CO-5: Understanding of basic algorithmic complexity. Ability to perform simple inductive proofs and proofs by contradiction and reason about program correctness and invariants",
      "CO-6: Given a real-world problem have ability to sensibly select appropriate data structures and algorithms for solving the problem and be able to implement the solution"
    ],
    "Detailed Syllabus": "Unit 1: Review of basic data structures and algorithms (Linked list, stack, queue, 2D arrays, dynamic programming, recursion etc.). Unit 2: Algorithms on Trees and Graphs (Binary Search Tree, AVL Tree, Heaps, Graph Traversal, shortest path algorithms etc.). Unit 3: Problem solving with other data structures and algorithms (Hashing, Tries, Splay Trees, Range Trees, sorting etc.)"
  },
  {
    "Course Title": "Deep Learning: Theory and Practices",
    "Course Code": "CS7.601",
    "Course Description": null,
    "LOs/COs": [
      "CO-1: Representation power of feedforward neural network, limitations of shallow networks, why and when can deep networks avoid curse of dimensionality",
      "CO-2: Perceptron, convergence proof. Feedforward neural network, back propagation, loss surfaces, learning rates, optimization for deep networks: gradient descent (GD), momentum-based GD, Nesterov accelerated GD, stochastic GD, AdaGrad, RMSProp, Adam",
      "CO-3: Bias variance tradeoff: overfitting and under-fitting. L2 regularization, early stopping, dataset augmentation, parameter sharing and tying, injecting noise at input, ensemble methods, dropout. Greedy layerwise pre-training, better activation functions, better weight initialization methods, batch normalization",
      "CO-4: Auto-encoders and relation to PCA, regularization in auto-encoders, denoising auto-encoders, sparse auto-encoders, contractive auto-encoders, variational auto-encoders (VAES), Word2vec and its relationship to latent semantic indexing (LSI)",
      "CO-5: Convolutional neural networks (CNNs), backpropagation in CNNs, LeNet, AlexNet, Inception, VGG, GoogLeNet, ResNet, Densenet",
      "CO-6: Recurrent neural networks, backpropagation through time (BPTT), vanishing and exploding gradients, truncated BPTT, stability, bidirectional RNNs, gated recurrent units (GRUs), long short-term memory (LSTM), solving the vanishing gradient problem with LSTMs",
      "CO-7: Encoder Decoder Models, Attention Mechanism, Hierarchical Attention, Transformers, Generative Adversarial Networks (GANs), Diffusion Models, Graph Neural Networks"
    ],
    "Detailed Syllabus": "This course covers fundamentals of Deep Learning including: Feedforward neural networks, back propagation, optimization methods; Bias variance tradeoff, regularization techniques; Auto-encoders, VAES, Word2vec; Convolutional neural networks (CNNs) and architectures; Recurrent neural networks (RNNs), LSTM, GRU; Encoder Decoder Models, Attention Mechanism, Transformers, GANs, Diffusion Models, Graph Neural Networks"
  },
  {
    "Course Title": "Design for Social Innovation",
    "Course Code": "CS9.429",
    "Course Description": null,
    "LOs/COs": [
      "The course will provide a rigorous overview of social sector and the need for technology led innovations in addressing the same",
      "Leading to insights, concepts, and tools for designing solutions for social impact",
      "A social immersion led course to understand the problems and needs of the grassroots and solve them in creative ways leveraging technology",
      "Work with social organizations or NGOs to get a first-person view of the ground reality and understand problems that need to be solved",
      "Understand the tools and frameworks they need to define and design technology for social impact",
      "Explore creative solutions to address these social problems, leveraging emerging technologies",
      "Inspire social enterprises through the technology led journey"
    ],
    "Detailed Syllabus": "MODULE [I] Social Immersion: What Is Social Innovation; Interaction With Leading Changemakers; Identifying Core Developmental Sectors [Agri, Fintech, Healthcare, Edu etc] & Field Visits. MODULE [II] Societal Challenge Identification: Deep Dive into Defining the Problem; Market Research/Competitive Landscape; Circular Validation from Stakeholders [Organizations/Customers/End Users]. MO [IIDULEI] Design for Change: Ideation/Design Thinking on Problem Breakdown; Build An SRS Document; Identify Technology Components for Social Innovation; Project Design & Execution Plan. MODULE [IV] Technology for Social Innovation: Updates On Building the Technology; Examples of technology used in social innovation; Teams to build in the use of emerging technology/research. Finale: Hackathon #4: Final hackathon. Complete the solution; Deploy Solution in Stakeholder/End User Environment. Measure Impact"
  },
  {
    "Course Title": "Design for Testability",
    "Course Code": "EC2.407",
    "Course Description": null,
    "LOs/COs": [
      "CO-1: Understand the role of testing in VLSI design flow and apply the concepts of testing in IC Design for better yield",
      "CO-2: Apply various test pattern generation methods for automatic test pattern generation in production testing",
      "CO-3: Identify the design for testability methods used in combinational & sequential CMOS circuits",
      "CO-4: Tackle the problems associated with testing of semiconductor circuits at an early design stage, thus significantly reducing testing costs",
      "CO-5: Apply Built-in Self-Test (BIST) techniques for improving testability"
    ],
    "Detailed Syllabus": "1) Introduction: Role of testing in VLSI design flow, testing at different levels of abstraction, automatic test equipment. 2) Faults and fault modeling, detection of faults, fault simulation and its applications, test pattern generation, automatic testing procedures. 3) Design for testability: Various features incorporated for carrying out testing from input & output pins, scan architecture, test interface and boundary scan. 4) Built-in Self-Test (BIST), BIST concepts, test pattern generation, BIST architectures. 5) Testing of Analog and mixed signal ICs, testing of system on chip"
  },
  {
    "Course Title": "Design Thinking 101 - Research to Define",
    "Course Code": "PD1.301",
    "Course Description": null,
    "LOs/COs": [
      "CO-1: Understand the Human-Centered (HCD) led Empathy (end user advocacy) &Creative Thinking based approach for Problem solving and designing/delivering new products, solutions and services",
      "CO-2: Demonstrate good understanding of various methods and tools used to understand the user's socio-cultural-economic context during the research/empathies and define stages of the Design Thinking Process",
      "CO-3: Apply hands-on skills, methods and tools for user research including User Research, Empathy, Contextual Inquiries, Shadowing, User Personas, Use and User Journey mapping, etc",
      "CO-4: Create, document and present the various deliverables and communications including Stakeholder Mapping, User Personas, Use Case Scenarios, User Journey Maps, Empathy Maps etc. related to the Design Thinking process and deliverables",
      "CO-5: Demonstrate the ability to collaborate and co-create the design solution and integrate the DT process within the overall product development and management life cycle"
    ],
    "Detailed Syllabus": "UNIT 1. UNLEARNING: Initial part of the course will emphasize on unlearning and to cultivate a knack for design thinking, and creative problem solving. UNIT 2. UNDERSTANDING DESIGN AND DESIGN DOMAIN: Understanding Design; Role & Functions of design and designers; Design Elements; Understanding Design Domains and perspectives. UNIT 3. INTRODUCTION TO DESIGN THINKING: What is Design Thinking?; Why Design Thinking?; Design Thinking approach in new product development & innovative solutions. UNIT 4. DESIGN THINKING PROCESS: Design Thinking Process - human-focused, empathy, research, ideation and prototype-driven, innovative design approach; User-Centred Design / Double Diamond Process; Introduce/Initiate Design Thinking Pilot Project. UNIT 5. DISCOVERY PHASE: What is Discovery and Validation phase and why?; Understanding User Context? - Why & How to Empathies?; Understanding the User Needs and Goals; Understanding Business Goals; Tools and Methods and Deliverables. UNIT 6. DEFINE PHASE: Analysis and Synthesis of Data and Information; Driving Insights (both user and business) and solution directions; Tools and Deliverables of the Define phase. UNIT 7. DRIVING ACTIONABLE BRIEF: Through the process of analysis and synthesis, identifying user-business insights, arriving at an actional brief in form of HMW statement; Debriefing and briefing on upcoming course"
  },
  {
    "Course Title": "Design Thinking - Idea to Evaluate/Implement",
    "Course Code": "PD1.401",
    "Course Description": null,
    "LOs/COs": [
      "CO-1: Understand the Human-Centered (HCD led Empathy (end user advocacy) &Creative Thinking based approach for Problem solving and designing/delivering new products, solutions and services",
      "CO-2: Demonstrate good understanding of various methods and tools used to understand the user's socio-cultural-economic context during the research/empathies and define stages of the Design Thinking Process",
      "CO-3: Apply hands-on skills, methods and tools for user research including User Research, Empathy, Contextual Inquiries, Shadowing, User Personas, Use and User Journey mapping, etc",
      "CO-4: Create, document and present the various deliverables and communications including Stakeholder Mapping, User Personas, Use Case Scenarios, User Journey Maps, Empathy Maps etc. related to the Design Thinking process and deliverables",
      "CO-5: Demonstrate the ability to collaborate and co-create the design solution and integrate the DT process within the overall product development and management life cycle"
    ],
    "Detailed Syllabus": "UNIT 1. REVIST THE PREVIOUS LEARNINGS AND ACTIONABLE BRIEF: Revise the understandings and learnings of the earlier course. Revisit and deliberate on the actionable brief and tweak the same if needed. The process of divergence and convergence. UNIT 2. IDEATION (DIVERGENCE) PHASE: Power and Value of Ideation process; Process and techniques of Ideation to generate many ideas. Case study. UNIT 3. PROTOTYPING (DIVERGENCE) PHASE: Why prototyping?; Types of Prototypes - Low fidelity & high fidelity; Creation of prototypes. Case study. UNIT 4. USER TESTING AND VALIDATION: Why Test?; Types of user testing and evaluation; Process of user testing/validation using prototypes. UNIT 5. PROJECT WORK- IDEA GENERATION FOR THE PROJECT WORK: This week will be dedicated to a generation of ideas against the actionable brief. UNIT 6. PROJECT WORK - PROTOTYPE CREATION AND TESTING: Students will be required to develop several prototypes based on the ideas generated during the ideation phase and validate the ideas. UNIT 7. PROJECT WORK - TWEAKING IDEAS AND FINANLISING THE SOLUTION: Tweaking the ideas and further development of the same. Final presentation of the work"
  },
  {
    "Course Title": "Digital Image Processing",
    "Course Code": "CS7.404",
    "Course Description": null,
    "LOs/COs": [
      "CO-1: Give examples of how images are stored and represented in digital machines",
      "CO-2: Apply basic techniques for improving subjective perception of images",
      "CO-3: Apply basic techniques for filtering images in spatial and frequency domain",
      "CO-4: Apply basic techniques for morphological and geometric transformations of images",
      "CO-5: Apply techniques for color image processing",
      "CO-6: Apply basic techniques for high-level image processing (Image Segmentation, Image Restoration, Image Compression)"
    ],
    "Detailed Syllabus": "Unit 1: Introduction and Digital Image Fundamentals; Unit 2: Methods for Improving Subjective Perception of Images; Unit 3: Spatial and Transform Domain Image Processing; Unit 4: Morphological and Geometric Image Processing; Unit 5: Color Image Processing; Unit 6: High-level Image Processing and Advanced Approaches"
  },
  {
    "Course Title": "Digital Systems and Microcontrollers (DSM)",
    "Course Code": "EC2.101",
    "Course Description": null,
    "LOs/COs": [
      "CO-1: Solve problems pertaining to the application of Boolean algebra, number systems, simplification of logic expressions using Karnaugh maps",
      "CO-2: Develop a simplified combinational circuit as a solution for a given problem",
      "CO-3: Analyze a real-world problem to develop a digital design solution using sequential circuits to solve the problem",
      "CO-4: Describe the working of a basic 8-bit von Neumann architecture processor",
      "CO-5: Develop skills for simulating circuits using basic components on online simulation tools (example, Tinker CAD)",
      "CO-6: Design, implement and test a given logic circuit using basic electronic components such as bread boards, ICs etc"
    ],
    "Detailed Syllabus": "Unit 1: Number systems and inter conversions (binary, decimal, hexa decimal), postulates of Boolean algebra, binary logic gates, binary functions. Unit 2: Simplification of binary expressions using K-maps, logic function implementation, combinational circuits. Unit 3: Latches and flip-flops, types of flip-flops, internal circuit design and operation. Unit 4: Sequential circuits, state diagrams, state tables, state equations, applications of sequential circuits. Unit 5: Registers and counters, memory and processor architecture"
  },
  {
    "Course Title": "Digital VLSI Design",
    "Course Code": "EC2.408",
    "Course Description": null,
    "LOs/COs": [
      "CO-1: Understand the background that drive to the development of state-of-the-art VLSI digital circuits, the importance of low power, high-performance and power-delay optimal designs, state of the art design issues in digital circuits, understand the CMOS digital IC design process",
      "CO-2: Design and Synthesis of Verilog/VHDL codes, test benches to meet specifications, to synthesize Verilog/VHDL onto hardware using required EDA tools",
      "CO-3: design and analyze CMOS circuits using both analytically and SPICE tools, derive analytical circuit equations to estimate performances (e.g., power) of a VLSI design",
      "CO-4: Analyze the design flow to design complex CMOS digital circuit using required CAD tools. Create a cell library to be used in other designs",
      "CO-5: Create a low-power digital design, estimate static and dynamic power dissipation in CMOS circuits. Impact of CMOS technology scaling",
      "CO-6: Design of high-performance circuits, and power-delay optimal designs"
    ],
    "Detailed Syllabus": "Unit 1: Introduction to digital design, Digital design metrics, why low power, why high performance, Power-delay optimal designs, why technology scaling, issues in state-of-the-art digital designs. Unit 2: Combinational IC design, Sequential IC design, Role of CAD tools, RTL design, Logic Synthesis, Logic Simulations, Static Timing Analysis. MOS Capacitor, Electrical Characteristics of MOS Transistors, MOS Inverter, Switching Characteristics, CMOS Realization, CMOS Complex circuits, CMOS technology scaling, CMOS Gate sizing, Layout basics, Floor Planning, Introduction to Fin FET technology. Unit 3: Digital Design - From Power perspective: Dynamic power dissipation, Switching Activity, Static i.e. Leakage Power Dissipation, Impact of technology scaling on leakage currents/power. Unit 4: Digital Design - From Performance (i.e., delay) perspective: Computing the Capacitances, Propagation delays, Factors affecting the propagation delays, Mathematical formulation of the delays in CMOS circuits, Technology scaling impact on propagation delays, Impact of process variations on delays"
  },
  {
    "Course Title": "Discrete Structures",
    "Course Code": "MA5.101",
    "Course Description": null,
    "LOs/COs": [
      "CO-1: Demonstrate critical thinking, analytical reasoning, and problem-solving skills",
      "CO-2: Apply appropriate mathematical and probabilistic concepts and operations to interpret data and to solve problems",
      "CO-3: Identify a problem and analyze it in terms of its significant parts and the information needed to solve it",
      "CO-4: Formulate and evaluate possible solutions to problems, and select and defend the chosen solutions",
      "CO-5: Construct graphs and charts, interpret them, and draw appropriate conclusions",
      "CO-6: Apply the concepts of group theory, ring and field in various applications in computer science"
    ],
    "Detailed Syllabus": "Unit 1: Sets, relations, functions, permutations, combinations. Applications to relations. Logic, Propositional Equivalences, Predicates and Quantifiers Sets, Proof Techniques, Contradiction. Mathematical induction, pigeonhole principle. Cardinality of sets, finite and infinite sets, countable and uncountable sets, Cantor's numbering. Unit 2: Group, subgroup/normal subgroup, homorphism/automorphism/isomorphism/epimorphism, kemel, cosets, quotient group, product set in a group, center of a group, order/conjugate of an element, commutator. Coding theory (Application to group theory). Unit 3: Ring, Field, Finite field over a prime. Applications to finite fields. Unit 4: Recurrence relations, generating functions, numeric functions. Applications to recurrence relations. Unit 5: Basics of probability theory, birthday attacks. Applications on hash functions. Unit 6: Graphs, Adjacency, Special Graphs, Isomorphic Graphs, Paths, Cycles and Circuits, Connected Graphs, Eulerian Graphs, Hamiltonian Graphs and Planar Graphs"
  },
  {
    "Course Title": "Distributed Systems",
    "Course Code": "CS3.401",
    "Course Description": null,
    "LOs/COs": [
      "CO-1: Explain the challenges faced by distributed systems in terms of lack of global time, synchrony, faults, programming support, etc",
      "CO-2: Employ standard distributed programming frameworks to write distributed programs for problem solving",
      "CO-3: Explain the properties and design principles of various real-world and practical distributed systems",
      "CO-4: Interpret the impact of faults in distributed systems in the context of important problems such as distributed agreement, distributed consensus, and distributed transaction processing",
      "CO-5: Analyze distributed algorithms for graphs with respect to correctness, round complexity, and message complexity",
      "CO-6: Analyze the limitations of distributed systems and assess the operational scope of large-scale distributed systems"
    ],
    "Detailed Syllabus": "Unit 1: Introduction; Communication models; Time and Synchronization; Practice: MPI/Map-Reduce. Unit 2: Distributed file systems; Practice: GFS, Chubby. Unit 3: Consensus, Agreement, Locking; Distributed Database systems; Practice: NoSQL, MongoDB. Unit 4: Limitations of distributed computing; Self-Stabilization; CAP Theorem. Unit 5: Distributed algorithms for graphs; Advanced Topics such as Blockchain, Distributed Storage, and Distributed Program Verification"
  },
  {
    "Course Title": "Earthquake Resistant Design of Masonry Structures",
    "Course Code": "CE1.607",
    "Course Description": null,
    "LOs/COs": [
      "CO 1: Understand the seismic vulnerability of existing masonry structures against seismic forces",
      "CO 2: Acquainted with principles of earthquake resistant design of masonry structures",
      "CO 3: Understand the failure modes and complete behavior of masonry under different actions like compression, tension, shear, and bending",
      "CO 4: Analyze the seismic safety of masonry buildings and suggest the retrofit measures using codal provisions",
      "CO 5: Design the strengthened masonry components of a building using different techniques"
    ],
    "Detailed Syllabus": "Unit 1: Introduction to masonry, Masonry buildings in India, Material properties, Masonry units, Manufacturing process, Mortar, Grout, and reinforcement; Masonry assemblages, Masonry systems, Various tests, and standards. Unit 2: Masonry under compression: Prism strength, Failure mechanism, types of construction and bonds, Eccentric loading, Slenderness effective length and effective height, effect of openings, Code provisions, masonry in tension, flexural strength of masonry, shear and bending capacity of masonry. Unit 3: Behavior of masonry structures during past earthquakes: Common modes of failures, effect of roof and floor systems, Masonry under lateral loads: In-plane and out-of-plane loads, bending parallel and perpendicular to bed joints, Shear and flexure behavior of piers, Test and standards, lateral force distribution for flexible and rigid diaphragms, Combined axial and bending actions. Unit 4: Earthquake Resistant Measures: Analysis for earthquake forces, role of floor and roof diaphragm, Pier analysis using equivalent stiffness approach, Concept and design of bands, splints and bandages, Vertical reinforcement at corners and jambs, Code provisions. Unit 5: Retrofitting of masonry building: Techniques of repair and retrofitting of masonry buildings, IS: 13935 provisions for retrofitting, different strengthening methodologies and techniques"
  },
  {
    "Course Title": "Electronic Workshop-1",
    "Course Code": "EC2.102",
    "Course Description": null,
    "LOs/COs": [
      "CO1: Familiarization and demonstration of skill in handling electronic equipment and components such as Power Supplies, Signal Generator, CRO, breadboards, soldering iron, passive components and active devices",
      "CO2: Design and implementation of electronic circuits that involve analog and digital components, on breadboard and further observing, recording, analyzing and interpreting the results therein",
      "CO3: Demonstration of psycho-motor skills in the form of connecting components on a breadboard, wiring, soldering circuits, and understanding of electronic hazards",
      "CO4: Understanding and demonstration of tool usage in the form of multi-Sim/LTSpice for simulation, verification and analysis of circuits",
      "CO5: Understanding the role of software hardware interface in the form of software implementation on controller boards and their interface to electronic circuits. Demonstrate proficiency on the same"
    ],
    "Detailed Syllabus": "1. Know your equipment and components - Lab Equipment and components familiarization such as Power supply, Signal Generator, Oscilloscope, Breadboard, Transistor, Resistor etc... 2. Design, Implementation and Analysis - Implement circuits such as Voltage Regulator record, analyse and interpret the results. 3. Electronic Circuit Design Simulation Software - Learning to install and use Multisim. Design one of the earlier experiments on Multisim and compare hardware and simulation results. 4. The Art of Soldering - Solder one of the implemented circuits now on a general-purpose PCB/Vector Board, record results, compare with the previous implementation on the bread board. 5. Hardware Software Symbiosis - Use of controller boards to interface with electronic circuits and actuators, showcase the need for software-hardware interplay"
  },
  {
    "Course Title": "Embedded Systems Workshop",
    "Course Code": "EC3.202",
    "Course Description": null,
    "LOs/COs": [
      "CO-1: Develop and implement an IoT-based solution for a real-life problem",
      "CO-2: Assess system designs from IoT application point of view",
      "CO-3: Explain the working on microcontrollers, peripherals and its programming",
      "CO-4: Compare and select the sensors and actuators based on the system requirement",
      "CO-5: Compare different communication protocols for use in IoT systems",
      "CO-6: Employ techniques pertaining to the security, privacy and inoperability of IoT data",
      "CO-7: Examine various available solutions for data storage and cloud computing",
      "CO-8: Design and fabricate a functional PCB and mechanical enclosure for their IoT project"
    ],
    "Detailed Syllabus": "1. Sensing/Actuators and Interfacing: Sensor/Actuator selection, Physics of sensors, Interfacing (Serial interfaces, Analog out, SPI, UART, I2C). 2. Controller, Embedded Systems and Peripherals: Platform selection (ATMEL328, ESP32, STM8), Embedded Systems (power management, interrupts, memory managements, OTA), Peripherals (RTC, ADC channels). 3. Communications, Networking and IoT Architecture: Different IoT communication protocols (Zigbee/WiFi/BLE/4G/5G/eSim/LoRaWAN), Data Protocols (MQTT/HTTPS/COAP). 4. Data Storage and Computation: Cloud storage and computing, Data retrieval optimization, IoT standards for interoperability. 5. PCB and Enclosure Design. 6. Data privacy and security. 7. Dashboard and Visualization: Software/Approaches (UI/UX, Time Series Data Visualization). 8. Documentation"
  },
  {
    "Course Title": "Entropy and Information",
    "Course Code": "CS1.407",
    "Course Description": null,
    "LOs/COs": [
      "CO-1: Explain the basic concepts of Entropy, Joint Entropy Conditional Entropy, Relative Entropy and Mutual Information, Chain Rules, Differential Entropy, Maximal Entropy, Probability as a measure, Data Compression, Entropy Rates, Markov Chain, Entropy Rate, Random Walk, Data Compression and Channels",
      "CO-2: Demonstrate familiarity with process of constructing codes/optimal codes, carrying out data compression, finding out the channel capacity of the channel",
      "CO-3: Synthesize proofs of theorems The Uniqueness Theorem, Fundamental Theorem, Maximum Entropy Principle, using clear mathematical and logical arguments",
      "CO-4: Apply the concepts like source coding, channel capacity to real world problems in Communication Theory",
      "CO-5: Create communication models using principles of Information Theory and analyze them"
    ],
    "Detailed Syllabus": "1. ENTROPY CONCEPT IN PROBABILITY THEORY: Entropy of Finite Schemes, Joint Entropy and Conditional Entropy, Relative Entropy and Mutual Information, Chain Rules, The Uniqueness Theorem, Jensen's Inequality, Log Sum Inequality, Data Processing Inequalities, Sufficient Statistics, Fano's Inequality. 2. PROBABILITY MEASURE AND ASYMPTOTIC EQUIPARTION PROPERTY: Probability as a measure, Law of Large Number, Asymptotic Equipartition Theorem (AEP), Data Compression, Typical Sets. 3. ENTROPY RATES OF A STOCHASTIC PROCESS: Entropy of Markov Chains, Entropy Rate, Entropy Rate of a random walk on a weighted graph, Hidden Markov Models, Fundamental Theorems. 4. DATA COMPRESSION: Kraft Inequality, Optimal Codes, Bound on the optimal code length, Kraft inequality for Uniquely Decodable Codes, Huffman Codes, Optimality of Huffman code. 5. CHANNEL CAPACITY: Examples of Channel Capacity, Symmetric Channels, Properties of Channel Capacity, Joint Typical Sequence, Channel Coding theorem, Zero Error Codes, Fano's Inequality, Feedback Capacity. 6. DIFFERENTIAL ENTROPY MAXIMUM ENTROPY AND SPECTRAL ESTIMATION: Definition, AEP for Continuous Random Variable, Relation of Differential Entropy to Discrete Entropy, Joint and Conditional Entropy, Relative Entropy and Mutual Information, Maximum Entropy distributions, Anomalous Maximum Entropy Problem, Spectrum Estimation"
  },
  {
    "Course Title": "Environmental Science and Technology",
    "Course Code": "CS9.428",
    "Course Description": null,
    "LOs/COs": [
      "CO-1: Understand various environmental issues of concern",
      "CO-2: Identify various driving factors of environmental degradation",
      "CO-3: Evaluate different environmental technologies",
      "CO-4: Integrate IT in designing solutions to combat environmental problems",
      "CO-5: Comprehend green accounting and evaluation methods for ecosystem goods and services",
      "CO-6: Develop sense of environmental ethics and environmental legislation"
    ],
    "Detailed Syllabus": "Unit-1: Basics of Environmental Science & Technology: Comprehend environment and its issues, Environmental problems and challenges, Environmental Events. Unit-2: Earth components; Climate Change: Climate system, Climate feedback loops, Climate Models, Climate impact on environment; Global Catastrophes, unexpected climate changes. Unit-3: Role of geospatial technology in assessing environmental degradation. Unit-4: Carbon sequestration methods - vegetation, ocean and geological sequestration, IPCC, Clean Development Mechanisms, CO2, Environmental Stress - Mitigation: Impact on vegetation. Unit-5: Environmental Impact Assessment: Procedure, regulations and case studies. Unit-6: Environment and Information technology: green computation, green energy, Green Engineering and technology, e-waste-disposal mechanism - impact on health. Unit-7: Green accounting- Evolution of process, history, case studies, Accounting of goods and Services, Sustainability concepts. Unit-8: Environmental movements. Unit-9: Environmental Legislation & Impact Assessment: Important legislations related to Environment; Environmental Auditing; Environmental Ethics"
  },
  {
    "Course Title": "Fairness, Privacy and Ethics in Al",
    "Course Code": "CS7.504",
    "Course Description": null,
    "LOs/COs": [
      "CO-1: Understand sources of unfairness in Al systems",
      "CO-2: Demonstrate familiarity with different notions of individual fairness as well as group fairness",
      "CO-3: Synthesize algorithms designed to ensure individual fairness such as envy-free ness, proportionality, max-min share etc. and apprehend the complexities involved in ensuring",
      "CO-4: Create algorithms methods to mitigate discrimination based on sensitive attributes such gender/race/age etc. (group fairness) for fairness measures such as disparate impact, equalized odds, accuracy equity, predictive parity etc",
      "CO-5: Explain the attacks on the machine learning models and databases to interpret the data",
      "CO-6: Apply different techniques using differential privacy to ensure privacy of individuals leading to transparency in the system"
    ],
    "Detailed Syllabus": "Unit 1: Bias in the data, causality, Individual fairness vs group fairness. Unit 2: Individual fairness: envy freeness, max-min share, proportionality. Algorithms to achieve them such as round robin, cycle elimination, etc. Unit 3: Impossibility of fair classifier with perfect calibration. Unit 4: Group fairness (equalized odds, disparate impact, accuracy parity, predictive parity). Different preprocessing, post processing techniques and over all approach to build Al to mitigate discrimination. Unit 5: Differential Privacy (DP), Need for newer privacy measures, especially when federated learning is on rise. Possible attacks even data is anonymized. Unit 6: Techniques such as Laplace mechanism, gaussian mechanism, local DP, Bayesian DP"
  },
  {
    "Course Title": "Finite Element Method",
    "Course Code": "CE4.501",
    "Course Description": null,
    "LOs/COs": [
      "CO1: Develop a comprehensive understanding of finite element principles",
      "CO2: Formulate and solve boundary value problems using approximate methods and finite element techniques",
      "CO3: Analyze structural components using the finite element method",
      "CO4: Apply advanced finite element method to elasticity problems",
      "CO5: Apply numerical integration to identify the solution of boundary value problems"
    ],
    "Detailed Syllabus": "Module 1: Introduction to finite element method (FEM): Need for FEM, General finite element solution procedure, Boundary value problems: types of boundary conditions, Approximate solution to boundary value problems: Method of weighted residuals. Module 2: General one-dimensional (1D) boundary value problem and its applications: Axial deformation of bars: Approximate solution using Rayleigh-Ritz method, Galerkin method, Axial Spring element. Applications: One-dimensional heat flow, Column buckling. Higher order elements for 1D problems. Module 3: Beams, Frames and Trusses: Beam bending-governing differential equation, Two node beam element, Analysis of structural frames-Plane frame element, space frame element, Introduction to truss analysis. Module 4: 2D boundary value problems: triangular elements, isoparametric quadrilateral elements, Isoparametric mapping for quadrilateral elements, Numerical integration for quadrilateral elements, Four node quadrilateral element for 2D BVP, Eight node serendipity element. Isoparametric triangular elements. Module 5: Applications based on general 2D boundary value problem: Torsion of prismatic bars. 2D elasticity-Governing differential equations, Constant strain triangular element, Four node quadrilateral element, Eight node isoparametric element. Constitutive equations, governing differential equations, stress equilibrium equations, finite element equations for plane stress and plane strain conditions. Module 6: Numerical integration-Newton-Cotes rules, Trapezium rule, Simpson's rule, Error term, Gauss-Legendre rules, Gauss-Leguerre rule, Numerical integration for quadrilateral elements, Numerical integration for triangular elements"
  },
  {
    "Course Title": "Foundations for Signal Processing and Communication",
    "Course Code": "EC5.412",
    "Course Description": null,
    "LOs/COs": [
      "CO1: build strong foundation in the fundamental mathematical concepts used for the design of digital communication systems",
      "CO2: be able to apply mathematical tools to analyze and solve complex problems related to signal processing",
      "CO3: be equipped with basic models/modules to conduct research in the field of communication and signal processing",
      "CO4: develop critical thinking and problem-solving skills to address practical problems in communication systems and signal processing"
    ],
    "Detailed Syllabus": "Module 1: Rigorous Math Part: Probability Axioms, Random Variables and their distributions (CDF, PDF, PMF), Some Important Distributions, Joint and Conditional Distributions, Distributions of functions of Random Variables, Expectation of RVs and their functions; SPCOM Part: Random quantities in SPCOM, Notion of Communication Channel, Hypothesis testing, Simple Detection and Estimation problems in Signal Engineering. Module 2: Rigorous Math Part: Concentration inequalities (Markov, Chebyshev, Chernoff), Central Limit Theorem, Mean vector and covariance matrix, Joint Gaussian Distribution, Random Processes; SPCOM Part: Discrete Memoryless Channels and Notion of Channel Capacity, Gaussian Noise, Wireless Channel. Module 3: Sets with structure; Rigorous Math Part: Groups, Rings, Fields, Vector spaces, Inner Product on Vector Spaces; SPCOM part: The Vector Space of Finite Energy Continuous Signals, Vector Space of Sampled Signals, Vector Space of discrete-time quantized signals, Distinguishing features of Digital Signal Processing and Communication. Module 4: Rigorous Math part: Linear Independence/dependence, Span, Column space and row space of matrices, Basis and Dimension of subspaces, Basis Extension Theorem, Rank of a matrix, Change of Basis; SPCOM part: Fourier Series of L_2 signals as representation of signals using Fourier basis, Finite dimensionality of bounded-time, bounded-bandwidth L_2 signals, standard basis for Discrete-time signals, Standard Basis for Finite-field Signals, Discrete Fourier Transform as Change of Basis. Module 5: Rigorous Math Part: Linear Transformations between vector spaces and their associated Matrices, Eigen Values and Vectors, Triangularization, Diagonalization, SVD; SPCOM part: Continuous-time and Discrete-Time LTI systems and their Transfer Functions, Role of linear transformations in coding theory for forward-error correction, Do Estimation, MIMO Wireless Communication"
  },
  {
    "Course Title": "Gender and Society",
    "Course Code": "HS8.201",
    "Course Description": null,
    "LOs/COs": [
      "CO-1: Introduce students to basic concepts in gender theory and Feminist practice",
      "CO-2: Help students question their prior opinions and think in more informed ways about the nature of gender relations, individual roles, and socio-cultural formations",
      "CO-3: Literature shall be taught to demonstrate the various ways in which culture establishes, represents and perpetuates",
      "CO-4: Film shall used to demonstrate the various ways in which popular culture establishes, represents and perpetuates",
      "CO-5: Examples of Literature and film shall be used to discuss how culture can disrupt generic roles"
    ],
    "Detailed Syllabus": "Unit 1: Core concepts and terms: Differences between terms like Gender, Sex, Normative and Non-normative sexuality, Trans-bodies. Unit 2: Power, Ideology and Intersectionality's: Concepts of Power, Ideology, Patriarchy, and Privilege. What are intersectionality's, and why is it important to study them when we study gender? Unit 3: Feminist Movements: Rights struggles, Gains and losses, women in the workplace, Women in India. Unit 4: Representation of Gender: Who writes women? Short Stories on, about, and by women. Unit 5: Popular representations of women in cinema. How does popular visual culture shape gender politics?"
  },
  {
    "Course Title": "Geospatial Technology for Disaster Risk Modelling",
    "Course Code": "TBD",
    "Course Description": null,
    "LOs/COs": [
      "CO-1: Basic understanding on how geospatial technology helps in decision support for major disasters",
      "CO-2: Exposure to(a) retrieving space-based parameters/proxies for decision support, (b) real time mapping and (c) modeling of different disasters",
      "CO-3: Handling, interpretation and processing of analysis-ready remotely sensed data",
      "CO-4: Exposure to existing models of decision support and early warning system for major disasters",
      "CO-5: Identify potential areas of Al/ML applications in early warning system of major disasters"
    ],
    "Detailed Syllabus": "Unit-1: Introduction to disasters overview, perspectives, national/international frameworks, conceptual approach to disaster risk reduction and management using geospatial technology. Unit-2: Flood risk and impact; Introduction to floods; Remote sensing of floods; Flood risk and vulnerability modelling and assessment. Unit-3: Drought; Introduction to drought; Role of remote sensing in drought monitoring; Drought assessment and modelling. Unit-4: Forest fires & open biomass burning; Introduction to fires; Remote sensing of fires; Introduction to 'fire danger rating' (early warning system) modelling; Artificial Intelligence for fire monitoring and management. Unit-5: Landslides; Introduction to landslides; Remote sensing applications for Identification of landslide, classification and post-event analysis; Monitoring of landslides; Landslide susceptibility and hazard assessment"
  },
  {
    "Course Title": "Human-Computer Interaction",
    "Course Code": "PD1.501",
    "Course Description": null,
    "LOs/COs": [
      "CO-1: Demonstrate good understanding of Human-Computer Interaction and How it influences the User Experience of digital products, systems, solutions and services",
      "CO-2: Demonstrate good understanding of methods and tools used to understand the HCI from the perspectives of technology, human-centered design and human/social sciences such as cognitive, and digital anthropology perspective",
      "CO-3: Demonstrate good understanding of incorporating human-centered approach in HCI to deliver useful and easy to use soRware and IT products including Mobility, Healthcare, Learning, E-commerce and Utility etc",
      "CO-4: Demonstrate the ability to create, document and present the various deliverables and communications related to HCI, UX and UI Design including Human-Action Cycle, Personas, Use Cases, Task Flow and Analysis, Information Architecture diagram, Wireframes, UI Design, and Usability Testing etc",
      "CO-5: Demonstrate the ability to plan and execute usability testing including creating test cases, usability matrix, performs testing, record test data and analysethesametoiden? Fyusability issues and report the same for updating the design"
    ],
    "Detailed Syllabus": "UNIT 1. Introduction to Human-Computer Interaction: Introduction to HCI?; History of HCI; How Human interact with outside world?; Human Conceptual/Mental models; Conflict between Mental Models and Design Models. UNIT 2. UNDERSTANDING Human-Machine System: Understanding Human-Machine System; Human-Action Cycle (HAC); 7stagesofHuman-action cycle; User Experience. UNIT 3. Art and Science of User Experience and UI Design: Aaention and Memory; Gestalt theory and principles; UI Elements including colour and interaction model; Information and Interaction Design principles. UNIT 4. User-Centered approach to the Solware Design: Perceived Usefulness and perceived Ease of Use; Understanding User Persona; Why user person is important; Use cases, User stories; Task Flows & Task Analysis; Human-centeredsoRware Design Workflow. UNIT 5. User Experience and UI Design: Information Architecture; Wireframes and Storyboards; Low and High-Fidelity prototypes. UNIT 6. Usability Engineering and Testing: What is Usability, usability requirements and how to measure it?; Heuristics evaluation; Usability Test planning and conducting usability test; Usability matrix and test reporting. UNIT 7. Usability Engineering and Testing: Short term project; Project completion, documentation and submission"
  },
  {
    "Course Title": "Human Sciences Lab",
    "Course Code": "HS7.101",
    "Course Description": null,
    "LOs/COs": [
      "CO-1: Students will get an introduction to computational tools which can be used in social science research",
      "CO-2: Students will start using social theory to read, analyze and interpret various kinds of data",
      "CO-3: Students will be exposed to the potential of computational humanities and social sciences. They will identify not just the potential, but equally the limitations of computational methods in the social sciences"
    ],
    "Detailed Syllabus": "Unit 1: Bag of Words exercise, followed by analysis of the results. Unit 2: Identification and interpretation of correlations in social data. Statistical analysis, followed by study of the historical/sociological/political context. Unit 3: Crawling of tweets, followed by an analysis of the results from a social science perspective. Unit 4: Scraping of newspaper articles, followed by an analysis of the results from a social science perspective. Unit 5: Working with Political Data: Extracting electoral data from various sites, followed by an analysis of the results from a social science perspective"
  },
  {
    "Course Title": "Hydrological Modeling and Software Development",
    "Course Code": "CE5.502",
    "Course Description": null,
    "LOs/COs": [
      "CO-1: Develop awareness about various water and climate change related problems and help to provide best possible optimal solutions for better management of water resources",
      "CO-2: Integrate hydrological models with computational techniques",
      "CO-3: Employ computer science skills in developing hydrological modelling and water management tools",
      "CO-4: Design and develop open-source tools for mapping, analyzing and predicting hydrological processes",
      "CO-5: Develop critical thinking to help in solving real-time water related issues using computational algorithms and technologies",
      "CO-6: To improve the problem-solving skills for solving water resources management problems"
    ],
    "Detailed Syllabus": "Introduction: fundamentals of fluid mechanics and open channel flows; hydrology, rainfall and runoff processes and hydro-climatology, statistical analysis, optimization methods. Water Resources Systems: river basin and urban hydrology, river water quality modelling, flood and drought management, irrigation and reservoir operation and climate change. Technologies and Software: Open-source public domain software based on Microsoft Windows environment: US Environmental Protection Agency's Qual2k; MATLAB Tools: Air2stream; Windows based decision support systems. Development and Application of Software: Real-world applications at various scales for water resources management"
  },
  {
    "Course Title": "Information Retrieval and Extraction",
    "Course Code": "CS4.406",
    "Course Description": null,
    "LOs/COs": [
      "CO-1: Develop algorithms to retrieve information from unstructured data",
      "CO-2: Design and architect information retrieval systems for worldwide web",
      "CO-3: Design Web crawling systems",
      "CO-4: Design algorithms to process noisy data in document repositories",
      "CO-5: Develop information extraction system's"
    ],
    "Detailed Syllabus": "Unit 1: Introduction to Information retrieval, Information Extraction and Information Access systems. Unit 2: Information Retrieval Models and Evaluation of IR systems. Unit 3: Web Information Retrieval. Unit 4: Natural Language Processing in IR. Unit 5: Machine Learning in Information Retrieval Systems. Unit 6: Information Extraction. Unit 7: IR Applications"
  },
  {
    "Course Title": "Information Theory",
    "Course Code": "EC5.410",
    "Course Description": null,
    "LOs/COs": [
      "CO-1: Explain the definition and properties of various basic concepts in information theory such as entropy, relative entropy, and mutual information for discrete and continuous random variables",
      "CO-2: Interpret and apply the concept of asymptotic equipartition property and random binning proof technique",
      "CO-3: Discuss the basics of data compression and source codes such as Huffman codes, Lempel-Ziv",
      "CO-4: Employ random coding ideas to prove the Shannon's source coding and channel coding theorems for some simple sources and channels",
      "CO-5: Analyze the capacity of a communication channel through various illustrative examples",
      "CO-6: Apply Information Theory for Converse Proofs in various settings: Umbrella Converse for Data Exchange, Coded Caching, Private Information Retrieval"
    ],
    "Detailed Syllabus": "Unit 1: Random Variables as Signals at Source and Receivers, Source Coding Entropy and its properties, Relative entropy, Mutual information, Huffman codes and optimality, Asymptotic Equipartition Property and Typical set-based source coding. Unit 2: Channel coding - Channel capacity motivation and definition, Discrete memoryless channel, Channel coding theorem for DMC- achievability and converse, Differential Entropy, Guassian Channel Capacity. Unit 3: Polar Codes as Efficient Capacity Achieving Codes for DMCS. Unit 4: Converse Results using Information Theoretic Arguments: Private Information Retrieval, Data Exchange between Nodes, DNA Storage, Adversarial Channels"
  },
  {
    "Course Title": "Intro to Cognitive Science",
    "Course Code": "CG1.402",
    "Course Description": null,
    "LOs/COs": [
      "CO-1: demonstrate familiarity with seminal research findings in cognitive science",
      "CO-2: read, interpret, critique, and evaluate research in cognitive science",
      "CO-3: critically think about the relationship between diverse fields such as Al, philosophy, neuroscience, and cognitive science",
      "CO-4: identify flaws in how scientific results are communicated and critique scientific work in terms of confounds, experimental design, etc",
      "CO-5: appreciate the nature of scientific debate in cognitive science and be able to generate well-informed perspectives on these debates"
    ],
    "Detailed Syllabus": "Introduction; Evolution of Cognitive Science; A free-form discussion on consciousness; Empirical approaches in cognitive science; Brain: Organization; Intro to sensation and perception; Sensory systems; Perception and Perceptual Learning, Cross-modal interactions; Vision; Attention; Learning; Development; Memory; Language and Cognition; Knowledge Representation; Special topics: e.g. Music, mind, and technology; Several debate sessions with student debate teams"
  },
  {
    "Course Title": "Introduction to Psychology",
    "Course Code": "HS2.202",
    "Course Description": null,
    "LOs/COs": [
      "CO-1: apply psychology knowledge base  describe and discuss major concepts, theories, models and overarching themes in psychology; describe applications of psychology; analyse and compare the major goals of psychological science and will be able to utilize different research methods used by psychological research; evaluate the challenges and merits of psychological observations and analyses, assess the brain and behaviour research complexity; explain the major historical landmarks in psychological science and their links to contemporary research",
      "CO-2: apply scientific inquiry and critical thinking  apply major perspectives of Psychology and levels of analyses to explain psychological phenomenon; analyse and evaluate the difference between the personal anecdotal incidences and scientific inquiry to our everyday psychological experiences; compare common fallacies like confirmation bias, causation to correlation etc; design, conduct, analyse, evaluate and interpret basic psychological research; analyse, interpret, and evaluate the individual experience and socio-cultural perspectives to explain psychological phenomenon",
      "CO-3: Evaluate and Analyze research ethics of human/ behavioral sciences  analyse and compare the benefits and risk of given psychological research; apply key principles of APA Ethics guidelines for participants right protection",
      "CO-4: demonstrate effective communication skills",
      "CO-5: demonstrate personal and professional development  apply psychological learning to their personal and professional development, self regulation, project management, coordinate teamwork, and develop life directions"
    ],
    "Detailed Syllabus": "Unit 1: Introduction - Psychology as a Science, Goals of Psychology, History of Psychology. Unit 2: Methods - Research methods for psychological observations. Unit 3: Health & Psychology - Psychological health and disorders, Neuroscience and behaviour, Emotion. Unit 4: Social & Personality - Social, Psychological interventions and treatments, Personality. Unit 5: Cognitive - Attention, Gender, Memory. Unit 6: Learning & Development - Learning, Perception, Life-span development, Intelligence"
  },
  {
    "Course Title": "Introduction to Biology",
    "Course Code": "SC3.101",
    "Course Description": null,
    "LOs/COs": [
      "CO-1: Identify levels of organization (in different time and length scales) in living organisms",
      "CO-2: Describe the characteristics of living organisms",
      "CO-3: Apply principles of physics to biology",
      "CO-4: Distinguish different cellular and biomolecular structures and functions",
      "CO-5: Explain different cellular and biochemical processes and their control",
      "CO-6: Outline the applications of computers in biology",
      "CO-7: Evaluate and synthesize information from the scientific literature"
    ],
    "Detailed Syllabus": "Unit 1: Cellular foundations: Cell organelles, Membranes and cellular compartments, Tree of life. Unit 2: Chemical foundations: Biomolecules, Structure and function. Unit 3: Physical foundations: Bioenergetics, Catalysis, Enzymes, Photosynthesis, Respiration. Unit 4: How cells obtain energy from the food - metabolism. Unit 5: Genetic foundations: DNA, Genes, chromosomes, Genomes, Mutations. Unit 6: Evolutionary foundations, Systematics. Unit 7: DNA Replication, Repair, and Recombination - an overview. Unit 8: How Cells Read the Genome: From DNA to Protein. Unit 9: Control of Gene expression. Unit 10: Cell Signaling, Cell cycle. Unit 11: Analyzing and manipulating DNA. Unit 12: Introduction to sequencing and computational challenges"
  },
  {
    "Course Title": "Introduction to Economics",
    "Course Code": "HS5.202",
    "Course Description": null,
    "LOs/COs": [
      "CO1: Identify the different definitions of economics",
      "CO2: Distinguish between schools of thought in economics and understand their evolution",
      "CO3: Understand the foundations of micro, macro and international economics",
      "CO4: Analyze how the conditions of economic life are distinct in developing countries like India",
      "CO5: Comprehend how other disciplines can complement economics in explaining social phenomena and relevant policy interventions"
    ],
    "Detailed Syllabus": "1. Ways of doing economics: Different views on scope and definition of economics. Alternative schools of economic thought- Neoclassical, Marxist, Keynesian. 2. Theoretical foundations of microeconomics: Agent based understanding of decision making individuals and firms. Market structure and game theory. Welfare economics, Information economics. 3. Theoretical foundations of macroeconomics: Macroeconomic measurement. Aggregate demand, aggregate supply and determination of output. Inflation and Unemployment, Monetary and Fiscal Policy. Banking and the role of finance in the economy. 4. Introduction to the open economy: Basic trade theory- absolute advantage, comparative advantage, Heckscher-Ohlin Model. Exchange rate determination. External accounts of an economy. 5. Interdisciplinary engagements with economics: Economics and psychology. Economics and computational science, economics and climate science"
  },
  {
    "Course Title": "Introduction to Film Studies",
    "Course Code": "HS1.208",
    "Course Description": null,
    "LOs/COs": [
      "1. Introduce students to basic terms of film analysis and interpretation",
      "2. Introduction to Fundamental theories of cinema studies",
      "3. Understand cinema as a medium, a phenomenon, art, and industrial practice",
      "4. Introduction to Global Cinema Movements",
      "5. Introduction to Cinema in Art and Politics"
    ],
    "Detailed Syllabus": "Unit 1: Basic terms of analysis and interpretation. Mis-en-Scne, Cinematography, Editing, Sound, Narrative, Genre. Unit 2: Fundamental conversations on medium specificity, Realism in Cinema, Phenomenology of film, the Soviet School, Digital Cinema. Unit 3: Introduction to cinema movements. May include  German Expressionism, New Wave/s, Noir, Indian art film movement"
  },
  {
    "Course Title": "Introduction to History",
    "Course Code": "HS3.201",
    "Course Description": null,
    "LOs/COs": [
      "CO1: Define the concept of History and describe the development of the discipline",
      "CO2: Explain range of academic theories relating to the discipline of History",
      "CO3: Analyze features of historical writings and appreciate the importance of the past",
      "CO4: Evaluate the different methods of historical analysis",
      "CO5: Assess primary evidence",
      "CO6: Develop their own understanding about History and the Past"
    ],
    "Detailed Syllabus": "(1) Historical Time and Space: In this module students will be introduced to how historians have understood the flow of time and periodised time into historical ages. (2) Historical Fact and Objectivity: This module will define the historical fact, the different interpretations of what a fact is, and the debate among historians relating to historical objectivity. (3) The Main Theories of History: In this module students will be exposed to the main theoretical models of historical interpretation. (4) The Main Methods of Historical Analysis: This module will focus on source criticism, the advantages and limitation of the inductive and deductive methods, oral history, qualitative and quantitative methods. (5) Memory, heritage and public history: This module will provide students brief introductions to the fields of memory studies, heritage studies and public history"
  },
  {
    "Course Title": "Introduction to Linguistics 1",
    "Course Code": "CL1.101",
    "Course Description": null,
    "LOs/COs": [
      "CO-1: Students will have a good understanding of linguistic analysis",
      "CO-2: Students will be introduced to different word and sentence level theories",
      "CO-3: It will enable them in building text processing tools and systems",
      "CO-4: They will explore different languages in class working in teams",
      "CO-5: Using real examples, they will analyse language data to understand the concepts"
    ],
    "Detailed Syllabus": "1. What is language? Difference between human language and Animal languages. Natural language, Formal language and Artificial language, Characteristic features of human language, what we know about language. 2. Study of Human language  the field of Linguistics. 3. Looking at language from synchronic and diachronic points of view. 4. Areas of Study from structural perspective: a) Syntagmatic and paradigmatic aspects of language structure; b) Levels of structural analysis: Phonetics, Phonology, Morphology, Syntax; c) From evolution perspective: Historical Linguistics; d) From usage perspective: Sociolinguistics; e) From Psychological perspective: Mechanisms of language acquisition; f) Indian Grammatical Tradition: Paninian grammatical model; g) Writing Systems"
  },
  {
    "Course Title": "Introduction to Neural and Cognitive Modeling",
    "Course Code": "CG3.401",
    "Course Description": null,
    "LOs/COs": [
      "CO-1: develop understanding of how principles of mathematics and computation are applied for problems in neuroscience",
      "CO-2: identify the differences and similarities of how mathematical principles are applied for various levels of nervous system  from neuron to behavior",
      "CO-3: analyze and evaluate model components and relate them to the functions of the neural system",
      "CO-4: design computational solutions to novel problems and phenomena of neuroscience and evaluate their goodness of fit to the actual empirical data from neuroscience",
      "CO-5: analyze and compare the strengths and limitations of computational models in explaining brain/mind/behavior",
      "CO-6: Appreciate the functional insights that computational model gives about the complex cognitive system, develop novel computational models and reflect on how these enable practical solutions"
    ],
    "Detailed Syllabus": "Part I: Single-Neuron Level Models: Introduction to Neuroscience; Passive membrane models, Leaky Integrate and Fire (LIF) models, Hodgkin-Huxley model, Cable models of dendrites, Synapse model, Compartmental models. Part II: Network Level Models: Neural population codes; information representation; neural encoding and decoding; hierarchy and organization of sensory systems; Spiking Network models of sensory systems; Neuroplasticity and learning. Part III: Abstract Models: Introduction to Hebbian, Competitive and Error-driven learning rules; Reinforcement learning, Neural Network models of Perception, Attention, Memory, Language and Executive Function"
  },
  {
    "Course Title": "Introduction to Philosophy",
    "Course Code": "HS0.214",
    "Course Description": null,
    "LOs/COs": [
      "CO1: Explain the nature and scope of Philosophical inquiry",
      "CO2: Identify the issues pertaining to the validity of Knowledge",
      "CO3: Distinguish between the objective and subjective knowledge and to be able to identify the different approaches",
      "C04: Analyze the questions and methods related to self-understanding as different from the scientific inquiry",
      "CO5: Evaluate the debates in the domain of knowledge and belief-formation"
    ],
    "Detailed Syllabus": "Unit 1: Nature and the Scope of Philosophy: Philosophy as a Rational Inquiry, Second-order discipline, Phronesis and the Good Life (Aristotle). Unit 2: Epistemology: Impression and Ideas (David Hume), Cogito Ergo Sum (Descartes), Transcendental Aesthetic and Categories (Kant). Unit 3: Existentialism: bermensch and Eternal Recurrence of the Same (Nietzsche), Bad Faith and Authenticity (Sartre). Unit 4: Phenomenology: Intentionality and Horizon (Edmund Husserl); Ready-to-hand and Disclosure (Martin Heidegger). Unit 5: Hermeneutics: Hermeneutical Circle (Gadamer); Narrative Identity (Paul Ricouer)"
  },
  {
    "Course Title": "Introduction to Politics",
    "Course Code": "HS4.201",
    "Course Description": null,
    "LOs/COs": [
      "CO1: Describe the concept of politics and identify the general scope and methods of Political Science at an introductory level",
      "CO2: Explain range of academic theories relating to key concepts of Political Science",
      "CO3: Analyze the different features of Constitution and democratic institutions in India",
      "CO4: Evaluate the political process in India and suggest policy recommendations for reforms",
      "CO5: Assess the nature of Constitutional Government and Democracy in India from various perspectives",
      "CO6: Develop ones own understanding on how to address contemporary challenges in the Indian Political System"
    ],
    "Detailed Syllabus": "Module 1: Introduction to various perspectives on how we define politics and its domain; Nature and scope of Political Science as a field of knowledge; Meaning and origin of State: divine theory and social contract theory; Forms and functions of government. Module 2: Brief introduction to key concepts of Political Science; Liberty: Negative and Positive; Equality: Equality of Opportunity; Justice: Social Justice; Rights: Legal Rights and Human Rights; Democracy: Idea and Practice. Module 3: Philosophy and features of Indian constitution, Structure and functions of Parliament (Legislature), Prime Minister and his cabinet (Executive), Supreme Court of India (Judiciary); Balance of Power. Module 4: Structure and functioning of federalism in India; centre-state relations; Meaning and interpretation of secularism in the Indian context; Provisions for unity in diversity. Module 5: History and Features of Party system in India; National Parties and State Parties; Trends in the Party System; Electoral Process, Election Commission, Contemporary Challenges and Reforms"
  },
  {
    "Course Title": "Introduction to Quantum Field Theory",
    "Course Code": "SC1.421",
    "Course Description": null,
    "LOs/COs": [
      "CO-1: Explain the need for a quantum field theoretic description of nature",
      "CO-2: Recognize the basic differences between wave function and quantum field",
      "CO-3: Discuss the idea of second quantization",
      "CO-4: Apply second quantization to scalar, spinor, and electromagnetic field",
      "CO-5: Calculate transition amplitudes and scattering cross-section for different processes",
      "CO-6: Recognize the conceptual challenges in the quantum field theory"
    ],
    "Detailed Syllabus": "Unit 1: Introduction: review of backgrounds, motivations for QFT. Unit 2: Elements of Classical Field Theory: symmetries and No ether's theorem. Unit 3: Functional Formalism: path integral formalism, functional quantization, Feynman diagrams, quantization of scalar field, phi-4 theory. Unit 4: S-matrix: scattering cross-section and decay rates, from Feynman diagrams to S-matrix. Unit 5: Dirac Field: Dirac equation and its solutions, gamma matrices, quantization, Green's function. Unit 6 Quantum Electrodynamics (QED): Feynman rules for QED, cross-section of simple QED processes. Unit 7 Introduction to Renormalization"
  },
  {
    "Course Title": "Introduction to Remote Sensing",
    "Course Code": "CS9.440",
    "Course Description": null,
    "LOs/COs": [
      "CO-1: Explain the processes of optical remote sensing",
      "CO-2: Describe various sensors and their image characteristics",
      "CO-3: Extract information from satellite imagery using conventional methods",
      "CO-4: Apply advanced computational techniques for feature extraction",
      "CO-5: Discuss satellite imagery applications (ex. Forest, Urban, Agriculture)",
      "CO-6: Explain the basics of advanced remote sensing technologies"
    ],
    "Detailed Syllabus": "Unit-1: Introduction to Remote sensing: What is remote sensing? Earth Observation Satellites and Platforms. Unit-2: Physics of Electro Magnetic Radiation (EMR) Radiation laws applicable to remote sensing: EMR interaction with Atmosphere and Earth materials. Unit-3: Data acquisition and image characteristics, Image pre-processing, Image Enhancement. Unit-4: Information extraction- Multispectral classification  Visual Interpretation- Digital classification. Object based image classification, Stereo Imagery. Unit-5: Major applications in Vegetation /wildlife; Hydrology/Agriculture, Disaster management. Unit-6: Overview of Advanced topics: Drone, Hyperspectral and thermal, Microwave/Radar"
  },
  {
    "Course Title": "IoT Workshop",
    "Course Code": "CE9.609",
    "Course Description": null,
    "LOs/COs": [
      "CO-1(Understand): Explain the basic elements of an IoT system and the application of IoT for structural engineering",
      "CO-2(Analyze): Analyze and solve basic electrical circuits using Kirchhoffs laws",
      "CO-3(Understand): Describe the working principle of commonly available sensors and actuators",
      "CO-4(Understand): Explain the working on microcontrollers, peripherals and its programming",
      "CO-5(Apply): Write simple embedded programs and interface common sensors and actuators with Arduino and ESP 32 boards",
      "CO-6(Remember): State and identify different technologies related to Communications and Networking, Cloud Computing and Data Analysis, Interoperability Standards and security, Dashboard and Visualization",
      "CO-7(Create): Assess simple designs from IoT application point of view",
      "CO-8(Create): Develop and implement an IoT-based solution for a real-life problem in the domain of structural engineering"
    ],
    "Detailed Syllabus": "1. Basic properties of electricity and electrical circuits - DC, Voltage, Current, Power, Energy, Resistance, Ohms Law, Circuit Diagrams. 2. Kirchoffs voltage and current laws, series and parallel resistance, Voltage and Current divider. 3. Online Simulations using TinkerCAD. 4. Basic Circuits, Mesh analysis, Node analysis. 5. What is IoT, Embedded Systems, Components of Embedded Systems, Microcontrollers, Sensors and Actuators, Analog/Digital conversion, Internet structure, Protocols, TCP/IP. 6. Arduino Environment, C Programming, Arduino programming and debugging, URAT Protocol. 7. Interfacing with Arduino, Pulse Width Modulation, Arduino Libraries, I2C communication, Arduino Shields. 8. Peripherals: RTC, ADC channels, resolution, onboard memory, power, external/internal watchdog. 9. Communications and Networking in IoT. 10. Cloud Computing and Data Analysis. 11. Interoperability Standards and security. 12. Dashboard and Visualization. 13. Documentation and Productization"
  },
  {
    "Course Title": "Language and Society",
    "Course Code": "CL2.203",
    "Course Description": null,
    "LOs/COs": [
      "1. The course intends to familiarize students with the social dynamics of language in use",
      "2. After doing the course, the students should be able to identify and recognize various phenomena which are at play",
      "3. The students are expected to be able to classify these phenomena and explain some of their consequences",
      "4. At the end of the course, the students are expected to be able to analyze language data and employ basic concepts learned during the course for interpreting language data for computational models",
      "5. The course should give them the confidence to be able to design and develop computational models in real case scenarios",
      "6. The students will be working on real data projects in teams which will give them experience of working as teams to solve a real problem"
    ],
    "Detailed Syllabus": "1. Language Variation: Sociolinguistics and sociology of language, Variation in language, Linguistic variables and social variables. Speech Communities, Language, Dialects and Varieties. Standard language and Standardization, Regional and social dialects. Register, styles. Dialectology. 2. Language Contact: Bilingualism/Multilingualism, borrowing, code mixing/switching, pidginization and creolization, convergence, language maintenance/shift, language acquisition in a multilingual setting. Diglossia with or without bilingualism. 3. Social stratification of language. Inherent variability. Sociolinguistic variables: indicator, marker, stereotype. Style shifting. Hypercorrection. Language variation and language change. Social motivation for sound change. Sociolinguistic devices for effective communication. Communicative competence. Politeness strategies. Pronouns of power and solidarity. 4. Language and Culture: Directions of influence. The Whorfian hypothesis. 5. Critical Sociolinguistics. Language and power. Language and social attitudes: gender, race, education. 6. Language planning: codification and elaboration"
  },
  {
    "Course Title": "Learning and Memory",
    "Course Code": "CG1.403",
    "Course Description": null,
    "LOs/COs": [
      "CO1- Understand the basic principles of learning and memory in the brain",
      "CO2- Apply the fundamentals of behavior to brain network models",
      "CO3- Examine the experimental results from research in the field of learning and memory",
      "CO4- Evaluate a chosen topic, understand its current status and propose new ideas",
      "CO5- Develop an experimental design that can propel the field ahead"
    ],
    "Detailed Syllabus": "Introductory Module: Psychology of Learning and Memory; Neuroscience of Learning and Memory. Learning Module: Habituation, Sensitization, and Familiarization: Learning About Repeated Events; Classical Conditioning: Learning to Predict Significant Events; Operant Conditioning: Learning the Outcome of Behaviours; Generalization, Discrimination Learning, and Concept Formation. Memory Module: Episodic Memory and Semantic Memory; Skill Memory; Complementary learning systems in the brain /Memory network in the brain; Working Memory and Cognitive Control. Integrative Module: Emotional/Stress Influences on Learning and Memory; Social Learning and Memory: Observing, Interacting, and Reenacting; Development and Aging: Learning and Memory Across the Lifespan"
  },
  {
    "Course Title": "The Making of Contemporary India",
    "Course Code": "HS4.102",
    "Course Description": null,
    "LOs/COs": [
      "CO-1: Identify and explain major political, social, and economic trends and milestones that have made India what it is today",
      "CO-2: Understand and describe major frameworks and methods that scholars have used to study India",
      "CO-3: Compare and assess the potential as well as limitations of these frameworks and methods",
      "CO-4: Apply the essential conceptual foundations taught in this course to other courses that offer in-depth study of related topics and themes",
      "CO-5: Develop a critical vocabulary and perspective that will contribute to the growth of their individual research voice and expertise at the confluence of computing and human sciences"
    ],
    "Detailed Syllabus": "Unit 1: Colonial Background: overview of the main features of colonial rule and of Indias independence movement; important social and economic trends beginning in the late 19th and early 20th centuries. Unit 2: Independence, Partition, Constitution of the New Nation-State: detailed study of Independence and the making of the Constitution of India. Unit 3: 1950s to 2000s: overview of how Indias polity and society passed through transition and faced new challenges; major landmarks of independent Indias political, social, economic, and development journey. Unit 4: Long-term Processes: literacy and education, infant mortality and sex-ratios, migration and urbanization, and travel and communication"
  },
  {
    "Course Title": "MCS 1  Probability and Statistics",
    "Course Code": "MA6.301",
    "Course Description": null,
    "LOs/COs": [
      "CO-1: Understanding the basic probability concepts sample space, events, probability mass function, conditional probability, Bayes Rule, Random Variables, Probability Mass and Density functions, Cumulative distribution function, Expectation, Variance, Bernoulli Binomial, Gaussian, Geometric, Exponential, Poisson distributions",
      "CO-2: Demonstrate familiarity with use of Linearity of Expectation, Markovs and Chebyshevs Inequalities, Law of Large Numbers, Central Limit Theorem",
      "CO-3: Apply principles of Tail bounds and Central Limit Theorem to real world problems in Estimation, Randomized Algorithms, etc",
      "CO-4: Derive formulas for finding Maximum Likelihood Estimates (MLE) and Maximum Apriori Estimates (MAE) for Probability Models",
      "CO-5: Create mathematical models using principles of Probability and analyze them"
    ],
    "Detailed Syllabus": "Unit 1: Sample Spaces, Counting, Uniform Probability, Axioms of Probability, Continuous Probability Spaces, Conditional Probability, Bayes Rule, Independence. Unit 2: Random Variables, PMFs, Discrete Probability Distributions, Multiple Random Variables, Expectation, Variance, Covariance, Standard distributions of Bernoulli, Binomial, Geometric, Gaussian, Exponential, Poisson. Unit 3: Continuous Probability Distributions, Tail Bounds (Markov, Chebyshev, Chernoff), Law of Large Numbers, Central Limit Theorem. Unit 4: Bayesian Statistics, Maximum Aposteriori Estimation, Maximum Likelihood Estimation, Confidence Intervals"
  },
  {
    "Course Title": "MCS 2 - Linear Algebra",
    "Course Code": "MA6.302",
    "Course Description": null,
    "LOs/COs": [
      "CO-1: Understanding the basic mathematical concepts like vector space, Basis, Linear Transformation, Rank Nullity Theorem, Matrix Representation of Linear Transformations, System of Equations, Determinants",
      "CO-2: Demonstrate familiarity with Eigenvalues, Eigenvectors, Orthogonality and Matrix Decomposition theorems",
      "CO-3: Synthesize proofs of theorems related to Matrices and Vector Spaces using clear mathematical and logical arguments",
      "CO-4: Apply principles of Spectral Decomposition and Singular Value Decompositions to real world problems in Image Compression, Principal Component Analysis etc",
      "CO-5: Design dimension reduction techniques with approximation guarantees using Best Fit Subspaces",
      "CO-6: Create mathematical models using principles of Linear Algebra and analyze them"
    ],
    "Detailed Syllabus": "Unit 1: Vector spaces, subspaces, Linear dependence, Span, Basis, Dimension, Finite dimension vector spaces Linear transformation, Range and Null space of linear transformation, Rank Nullity Theorem, Sylvester's Law, Matrix representation of a linear transformation for finite dimensional linear spaces, Matrix operations, change of basis, Rank of a Matrix, Range and Null Space of a matrix representing a linear transformation. Linear spaces with inner product. Unit 2: System of Linear Equations, Row-echelon form, reduced row-echelon form. Gauss-Jordon elimination, Solution of linear systems using Gauss-Jordon elimination, matrix inversion by Gauss Jordon elimination, Understanding Range Space and Solution Space using Rank-Nullity Theorem. Unit 3: Eigenvalues and Inner product: Eigenvalues & Eigenvectors, Norms, Inner Products and Projections, Applications like Analysis of Random Walks. Unit 4: Advanced Topics: Spectral & Singular Value Decomposition Theorems, Applications of SVD and Best Fit Subspaces"
  },
  {
    "Course Title": "Mobile Robotics",
    "Course Code": "CS7.503",
    "Course Description": null,
    "LOs/COs": [
      "CO-1: Demonstrate familiarity with different modalities of robotic perception",
      "CO-2: Analyze robotic perception algorithms in the context of mapping an environment and localizing the robot in the environment",
      "CO-3: Explain the significance of mathematical frameworks of functional optimization and probabilistic reasoning in robotic perception and localization tasks",
      "CO-4: Apply principles of functional optimization and visual/lidar based sensing to propose analytical frameworks, algorithms for solving real world problems in robotic perception and navigation",
      "CO-5: Create and simulate the algorithms using state of the art software and libraries and evaluate its performance on specified tasks"
    ],
    "Detailed Syllabus": "Unit 1: Representation of Coordinate Frames, Rotation Matrices, Homogenous Transforms, Quaternions and Axis Angle Representations. Unit 2: LIDAR based Mapping and Localization. Unit 3: Principles of Computer Vision: Camera Modelling, Calibration, Reconstruction and Resection. Unit 4: Backend Optimization for LIDAR Based SLAM, Bundle Adjustment"
  },
  {
    "Course Title": "Modern Coding Theory",
    "Course Code": "EC5.411",
    "Course Description": null,
    "LOs/COs": [
      "1. Define and name some examples the notion of channels, channel capacity and capacity achieving codes, with examples such as LDPC codes, Reed Muller Codes and Berman Codes, and their application to 5G communication",
      "2. Understand principle of message passing decoding (MPD) and employ MPDfor LDPC Codes for Binary Erasure Channel and Binary Symmetric Channel",
      "3. Define Reed Muller Codes and demonstrate majority logic decoding",
      "4. Illustrate Capacity Achieving properties of Reed Muller Codes via Boolean function analysis",
      "5. Demonstrate principles of recursive code construction in Berman Codes and Polar Codes, with corresponding capacity achievability results"
    ],
    "Detailed Syllabus": "1. Channels and their Capacity; Notion of Capacity achieving Codes; Examples codes achieving capacity on various channels. Application in 5G and beyond. 2. Basics of Block Codes, Concept of LDPC Codes, Idea of Code Ensembles. 3. Message Passing Decoding of LDPC Codes, Analysis of decoding via Density evolution. 4. Reed Muller Codes: Definition, Properties, and Proof of Capacity achieving nature in Binary Erasure Channels, Idea of Capacity Achieving nature in other binary memoryless channels.. 5. Recursive Constructions for Berman Codes and Polar Codes: Definitions, basic properties, idea of capacity achieving nature in BMS channels"
  },
  {
    "Course Title": "Modern Complexity Theory",
    "Course Code": "CS1.405",
    "Course Description": null,
    "LOs/COs": [
      "CO-1: Understand different models of computation including Turing Machines, Boolean Circuits and complexity measures of time, space, depth",
      "CO-2: Demonstrate familiarity with various complexity classes including P, NP, PSPACE, NC and problems like Halting Problem, 3SAT",
      "CO-3: Design reductions between problems to show hardness of solving a problem in a complexity class",
      "CO-4: Synthesize proofs of upper and lower bounds of resources required for solving a computational problem using clear mathematical and logical arguments",
      "CO-5: Apply principles of NP-Completeness and NP-Hardness to avoid intractability in design of computational problems",
      "CO-6: Create mathematical models and complexity measures for novel computational models"
    ],
    "Detailed Syllabus": "Unit 1: Models of Computation and Impossibility Results: Turing Machines, Circuits, Encoding of Problems, Halting Problem, Shannons Counting Lower bound. Unit 2: Complexity Measures and Classes: Time, Space, Depth measures of complexity, Time, Space hierarchy theorems, Nondeterminism, Savitchs theorem, P, NP, P/poly, PSPACE, EXP, L, NL. Unit 3: Completeness and Hardness Reductions: 3SAT, Cook-Levin Theorem, NP-Complete, NL Complete, Hardness reductions for common problems like Vertex Cover, Independent Set, Knapsack etc. Unit 4: Advanced Topics: Definitions and relationships between PH, RP, BPP, NC including theorems like Karp-Lipton, Adlemans theorem, Der and omization Techniques"
  },
  {
    "Course Title": "Music Workshop",
    "Course Code": "HS1.210",
    "Course Description": null,
    "LOs/COs": [
      "CO-1 Understand the scope of research in music",
      "CO-2 Realise the potential of a thought as a seed to a productive work",
      "CO-3 Understand the relevance of music as an integral part of human life",
      "CO-4 Develop an inter disciplinary perspective on music",
      "CO-5 Come up with a work of their own, related to music"
    ],
    "Detailed Syllabus": "1. Text reading: The students will be introduced to a wide range of topics through the writings of different musicians, musicologists and music rasikas. 2. Introduction to all the basic concepts of music with special focus on Indian music. 3. Music listening: Music of different genres will be played for the students to observe and understand the importance of Sadhana in music. 4. Practical exercises: Various exercises based on notes, rhythm, scales, ragas and language. 5. Discussions on topics that students want to take up as their course project (individual sessions relevant to their topic)"
  },
  {
    "Course Title": "Network, Signals & Systems",
    "Course Code": "EC5.101",
    "Course Description": null,
    "LOs/COs": [
      "CO-1 Describe various circuit elements (R, C, L), supply (current, voltage), devices (op amp, diode)",
      "CO-2 Explain the operation and characteristics of each circuit element, behavior in specific circuit configuration (DC, AC, series, parallel, mixed)",
      "CO-3 Calculate equivalent circuit parameters (Thevenin, Norton), node voltages, branch currents etc. using reduction, KCL, KVL and reduction techniques",
      "CO-4 Calculate circuit response (steady state, transient) to various input stimulation and also explainthe concept of time constant for RC, RL and RLC circuits",
      "CO-5 Demonstrate understanding of and calculate Power, Energy, Loss and phasors w.r.t. circuit",
      "CO-6 Apply the above concepts to analyze and solve a real-life circuit problem",
      "CO-7 Describe signals using various representations including Fourier series representation for periodic signals",
      "CO-8 Describe systems abstractly using block diagrams and differential equations",
      "CO-9 Apply convolution operation and impulse responses for system analysis",
      "CO-10 Analyze signals and systems using Laplace transform representation"
    ],
    "Detailed Syllabus": "Unit 1: Circuit elements. Unit 2: Network theorems. Unit 3: Transient and Steady state analysis. Unit 4: Sinusoidal input and phasors. Unit 5: Two port networks. Unit 6: Signals, representation, sinusoids, and Fourier series. Unit 7: Systems and representations  differential equations, block diagram, operator, and functional form. Unit 8: Convolution integral and impulse response. Unit 9: Transfer function  Laplace transform, poles and zeros"
  },
  {
    "Course Title": "Open Quantum systems and Quantum Thermodynamics",
    "Course Code": "SC1.310",
    "Course Description": null,
    "LOs/COs": [
      "1. After the course, the students will have a fundamental understanding about kinematics and dynamics of noisy quantum systems",
      "2. Students will also have basic ideas on current research directions in quantum thermodynamics, a little of quantum communication, quantum information and quantum entanglement detection",
      "3. Students will have basic training on research in related topics through projects",
      "4. Students will have a firm background for pursuing a MS thesis in quantum information, communication and thermodynamics",
      "5. The course can be understood as a pre-PhD course related to quantum information science in general"
    ],
    "Detailed Syllabus": "1. Review on basic linear algebra; Metric space, Dual space, Hilbert space and bra-ket algebra. 2. Review on unitary quantum mechanics; Unitary evolution, state vectors, uncertainty principle, Schroedinger equation etc. 3. Pure and mixed states, basics on measurement theory, projective measurements, positive operator valued measures etc. 4. non-unitary evolution, tensor product space, bi-paretite quantum systems, global evolutions, non-unitary dynamics, completely positive trace preserving maps, operator-sum representation. 5. Monotones under completely positive operations, basics of distance measures and entropic measures. 6. Selected topics on complete positivity, positivity, Choi-Jamiolkowski isomorphism, Stinspring dilation, entanglement detection. 7. General quantum dynamical equations, master equation, Lindblad equation and its derivation from a few different perspectives, properties of Lindblad dynamics. 8. Basic idea on Markovianity and non-Markovianity from quantum mechanical perspectives. 9. Basic ideas on quantum heat engines and a few other selected topics on thermodynamics"
  },
  {
    "Course Title": "Operating Systems and Networks",
    "Course Code": "CS3.301",
    "Course Description": null,
    "LOs/COs": [
      "CO-1. Extend the concepts of layering and modularity to build new software systems",
      "CO-2. Develop appropriate scheduling/synchronization/memory management/ virtual memory/protection module for a new task-specific operating system",
      "CO-3: Implement an application on the top of given operating system in an efficient manner based on process and thread framework available in the given operating system",
      "CO-4. Architect the given system on the top of operating systems by exploiting the system calls of the given operating system services as far as possible",
      "CO-5. Develop a network-based application by exploiting networking related system calls"
    ],
    "Detailed Syllabus": "Unit 1: Introduction, Process and Memory Virtualization  Scheduling, Memory addressing and Paging, and Networking Overview; Unit 2: Concurrency  Threads and locking mechanisms, Common concurrency problems, Data transmission and Network Technologies; Unit 3: Persistence  File Systems, Protection, Network File Systems and basics of Network Security"
  },
  {
    "Course Title": "Physics of Early Universe",
    "Course Code": "SC1.415",
    "Course Description": null,
    "LOs/COs": [
      "CO-1 Explain the large-scale structure of the universe and its observational components",
      "CO-2 Demonstrate understanding of how mass, radiation distribution shapes the dynamics of the universe",
      "CO-3 Apply their knowledge and calculate dynamical properties of few model universe",
      "CO-4 Discover the thermal history of the early universe",
      "CO-5 Familiarize themselves with several unsolved problems in the research of cosmology"
    ],
    "Detailed Syllabus": "Unit-1: Universe Observed: Expansion. Isotropy and homogeneity. Age. Cosmic microwave background. Unit-2: Geometry and Dynamics: Universe in the eyes of Newton. Geometry. Mass and curvature. Freedman equations. Model universes: empty universe, matter or radiation dominated universe, multi-component universe. Unit-3: Black-body radiation and the early history: Observation of CMB. Recombination and decoupling. Last scattering. Temperature fluctuations. Unit-4: Very early history of the Universe: Thermal history. Nucleosynthesis. Cold dark matter. Unit-5: Inflation: Flatness, horizon, and monopole problem. Physics of inflation"
  },
  {
    "Course Title": "Principles of Programming Languages (PoPL)",
    "Course Code": "CS1.402",
    "Course Description": null,
    "LOs/COs": [
      "CO1: Document Abstract Syntax Document and critique the abstract syntax of industrial scale programming language like C or Java",
      "CO2: Design domain specific languages Design a small, domain purpose languages like a language for propositional logic and implement them",
      "CO3: Design object small, oriented language Design a small object-oriented language implement it either using an interpreter or by embedding it into a base language",
      "CO4: Compare languages Compare and analyse the semantic expressibility (in terms of first-class values) between imperative languages like C and functional languages Racket, and object-oriented languages like Java and Python",
      "CO5: Specify application interfaces Specify the structure of a software application like a spreadsheet or a word processor in terms of its interface as a language of user operations and its internal structure as an abstract machine"
    ],
    "Detailed Syllabus": "Functional Programming: Abstract vs. Concrete Syntax. Racket syntax, Functions, recursion, syntactic extensions, higher-order functions, map, reduce and other combinators. Operational Semantics: Abstract Reduction Systems, Transition Systems, Reduction, Simplification and Evaluation relations. Judgements and Rules. Rule Induction. Scope: Identifiers, Scope and extent, Lexical scope, Environments, Dynamic scope and parameters. Closures. State: Stores and imperative constructs, explicit and implicit store references, objects, invariants and safety, interfaces and constructors, inheritance, Parameter passing. Call-by-value, call-by-name and lazy evaluation. Control: Tail calls, Contexts, continuations, continuation passing style, exceptions, threads. Types: Types syntax, type safety theorems. Type inference. Special Topics (if time permits): Monads, Concurrency"
  },
  {
    "Course Title": "Principles of Semiconductor Devices",
    "Course Code": "EC2.409",
    "Course Description": null,
    "LOs/COs": [
      "CO-1: Describe quantum mechanics basics: Heisenbergs principle, energy band (conduction & valance bands, energy gap)",
      "CO-2: Explain the basic physics for PN junctions, MOS, MS junctions, MOSFET & BJT",
      "CO-3: Calculate basic semiconductor device parameters and solve problems related to design of above-mentioned semiconductor devices",
      "CO-4: Design very simple diode & MOSFET circuits"
    ],
    "Detailed Syllabus": "Unit 1: Semiconductor Properties. Unit 2: Quantum Mechanics and Energy Band Theory. Unit 3: Carriers in equilibrium, G-R processes. Unit 4: Carrier Transport. Unit 5: PN Junction physics. Unit 6: MOS & MOSFET. Unit 7: BJT"
  },
  {
    "Course Title": "Probability and Random Processes",
    "Course Code": "MA6.102",
    "Course Description": null,
    "LOs/COs": [
      "CO-1: Describe the probability space associated with an experiment, conditional probability and Bayes theorem",
      "CO-2: Give examples of discrete and continuous random variables and their distributions",
      "CO-3: Calculate conditional and marginal distributions, distributions of functions of random variables, expectation and variance",
      "CO-4: Analyze the properties of independent random variables, sums of random variables",
      "CO-5: Interpret the tail bounds, law of large numbers and central limit theorem",
      "CO-6: Evaluate the real-world applications of random variables and random processes"
    ],
    "Detailed Syllabus": "Unit 1 : Sets and set operations, Probability space, Conditional probability and Bayes theorem. Unit 2: Discrete random variables, probability mass function, probability distribution function, example random variables and distributions, Continuous random variables, probability density function, probability distribution function, example distributions. Unit 3: Joint distributions, functions of one and two random variables, expectation and variance, Conditional distribution, densities, conditional expectation, moment generating functions, characteristic functions. Unit 4: Markov, Chebyshev and Chernoff bounds. Random sequences and modes of convergence, Strong and weak laws of large numbers, central limit theorem. Unit 5: Random processes, Mean and covariance functions, Stationary processes and wide-sense stationary processes, power spectral density, linear filtering of random processes"
  },
  {
    "Course Title": "Probability and Statistics",
    "Course Code": "MA6.101",
    "Course Description": null,
    "LOs/COs": [
      "CO-1: Explain the axioms of probability and rules, discrete and continuous random variables",
      "CO-2: Derive the density function of transformations of random variables and use these to generate data corresponding to various distributions",
      "CO-3: Derive marginal and conditional distributions of multivariate random variables and probability bounds",
      "CO-4: Discuss the classical and Bayesian inference theory and applications",
      "CO-5: Discuss the basic random processes and their applications",
      "CO-6: Outline a proof of stated theorem and write the logically derived proof"
    ],
    "Detailed Syllabus": "Unit 1: Discrete Random Variables: Probability mass function, expectation and variance. Bernoulli distribution, Geometric distribution, Binomial distribution. Hypergeometric distribution and Poisson distribution. Bounding probabilities, tail sum formula, Markovs inequality and Chebyshevs inequality. Probability generating functions and moment generating functions. Unit 2: Continuous Random Variable: Probability density function, cumulative distribution function, expectation, mean and variance. Moment generating functions and uniqueness theorem. Chebyshevs inequality. The uniform distribution, the normal distribution. The Cauchy distribution. The exponential distribution, moments, memoryless property, hazard function. Gamma distribution, moments, Chi-square distribution. Unit 3: Multivariate Distributions: Cumulative distribution function method for finding the distribution of a function of random variable. Discrete bivariate distributions, marginal and conditional distributions. Continuous bivariate distributions, marginal and conditional distributions, independence of random variables. Covariance and correlation. Mean and variance of linear combination of two random variables. The joint Moment generating function (MGF) and MGF of the sum. The bivariate normal distribution. Linear combinations of independent random variables. Sequences of independent random variables and the weak law of large numbers. The central limit theorem. Unit 4: Statistical Inference and Random Processes: Point Estimation, Interval Estimation, Hypothesis Testing, Linear Regression, Bayesian Inference. Point Processes, Poisson Process, Discrete Time Markov Chains"
  },
  {
    "Course Title": "Product Management 101",
    "Course Code": "PD2.401",
    "Course Description": null,
    "LOs/COs": [
      "CO1: Understand the key role of a product manager in ideating & developing technical products for the Digital World",
      "CO2: Create a Product Strategy by using various market research techniques",
      "CO3: Develop a product mindset to create innovative product & solutions that solve complex technical problems that is required by the Market",
      "CO4: Execute product strategy through Roadmaps & Release Plans",
      "CO5: Learn various product development methodologies that can be applied to enable faster Go to Market"
    ],
    "Detailed Syllabus": "Module 1: Introduction to Product Management  the Art & Science of Product Management (What is product management, Types of Product Management, Product life cycle). Module 2: Product Strategy (Market Research, Product Value Proposition, Product Strategy: Market Needs, Key Differentiators, Business Goals). Module 3: Product Ideation & Market fit (Product Ideation, Product Feasibility, Product market Fit, User Journeys). Module 4: Adopting a Product Mindset (Prioritization, People, Process, Progress). Module 5: Product Roadmap (Top-Down Product Strategy, Featureless Roadmaps to feature roadmaps, Roadmaps to Release plans). Module 6: Product release execution (Product Prototyping & Market Validation, Product Development Process: Agile development process, Lean product development, Product release to market)"
  },
  {
    "Course Title": "Product Marketing",
    "Course Code": "PD2.501",
    "Course Description": null,
    "LOs/COs": [
      "CO1: Learn methods, models and frameworks that can be employed to developing strategy artifacts relevant to product marketing",
      "CO2: Apply the concepts and tools in the development of go-to-market strategy and sales playbooks",
      "CO3: Learn the principles of effective marketing, specifically those of pricing, positioning, narratives with respect to targeted segments and types of customers in each segment",
      "CO4: Understand the synthesis between product management and product marketing as to design and build better products from the beginning"
    ],
    "Detailed Syllabus": "Unit 1  Product Marketing and Product Management: Recap of 1) how marketing is an integral part of Product Management, 2) Product Management fundamentals, 3) Product Market Fit. Unit 2  Marketing Mix: 1) Value Model (4Cs), 2) Marketing Mix (4Ps) and how to use them in tandem to strategize product launch. Unit 3  Value Proposition and Promotion: 1) Segmentation and User Personas, 2) Customer Journey Mapping, 3) Pricing Mix, 4) Positioning, and 5) Product Branding. Unit 4  Customer Engagement: 1) Introduction to Marketing Communication, 2) Building a comprehensive narrative for marketing, and 3) Customer Engagement at all stages of acquisition. Unit 5  Sales Playbooks: 1) What are playbooks? and 2) how to develop an actionable playbook for sales. Unit 6  Go-to-Market Strategizing: 1) Customer Acquisition Strategies, 2) Defining the GTM Strategy, and 3) Executing the GTM Strategy successfully"
  },
  {
    "Course Title": "Quantum Information Theory",
    "Course Code": "TBD",
    "Course Description": null,
    "LOs/COs": [
      "1. Understand the mathematical formulations of postulates of quantum theory",
      "2. Understand the application of quantum systems for information processing tasks",
      "3. Examine basic mathematical tools and physical concepts used in quantum information theory",
      "4. Identify different types of quantum correlations and apply them in communication protocols",
      "5. Analyse information-theoretic aspects of quantum systems and processes"
    ],
    "Detailed Syllabus": "Unit 1: Overview of why the need of quantum information theory. Unit 2: Mathematical formulations of the postulates of the quantum theory: postulates of quantum theory pertaining to quantum information theory, closed (unitary evolution) and open (noisy evolution) quantum systems, quantum states, quantum channels, and quantum measurements. Unit 3: Quantum correlations: entanglement and nonlocal quantum correlations, measures and tests to quantify or test these correlations, Bell tests. Unit 4: Tools in quantum information theory: trace-distance, relative entropy, fidelity, formula and bounds for quantum entropy, quantum conditional entropy, quantum mutual information, quantum conditional mutual information, quantum data-processing inequality, strong subadditivity. Unit 5: Quantum communication protocol: quantum typicality, packing lemma, covering lemma, and some examples of quantum communication protocols, quantum resource theories"
  },
  {
    "Course Title": "Quantum Mechanics",
    "Course Code": "SC1.203",
    "Course Description": null,
    "LOs/COs": [
      "CO-1: Recognize the basic differences between the inherently probabilistic description in quantum mechanics with the deterministic description in the classical theories",
      "CO-2: Discover the role of linear algebra, complex analysis and probability theory in quantum mechanics and modern physics",
      "CO-3: Calculate and solve simple 1D quantum problems like particle in a box, the simple harmonic oscillator, and the free particle, etc",
      "CO-4: Apply their knowledge of basic problems in more complicated problems like the Hydrogen atom and discover advanced techniques",
      "CO-5: Recognize the conceptual challenges in quantum mechanics"
    ],
    "Detailed Syllabus": "Unit 1: Introduction: The Schrdinger equation and the uncertainty principle. Unit 2: Mathematical Formalism: Review of linear algebra, complex functions, Fourier transformation etc. and the generalized statistical interpretation, Heisenberg picture. Unit 3: Time independent Schrdinger equation: Infinite square well, harmonic oscillator, free particle, delta function potential, finite square well. Unit 4: 3D Problems: Spherical coordinates - Hydrogen atom, angular momentum, spin, two-particle systems, atoms. Unit 5: Advanced topics: Time independent perturbation theory, the variational principle, Bell's theorem"
  },
  {
    "Course Title": "Readings from Hindi Literature",
    "Course Code": "HS1.303",
    "Course Description": null,
    "LOs/COs": [
      "1. Greater interest and appreciation of literature in general",
      "2. Reasonable amount of knowledge of contemporary writing",
      "3. Motivation to continue reading and writing in creative literature in future",
      "4. Comparative understanding of literature in different languages",
      "5. Elementary understanding of literary criticism"
    ],
    "Detailed Syllabus": "I. History of Hindi literature. 2. Fiction: Nirmal Varma, Bhishm Sahani, Manto, Gyanranjan, Kamaleshwar, Uday Prakash, Ismat Chugtai, etc. 3. Poetry: Ajnyeya, Muktibodh, Nagarjun, Shamsher Bahadur Singh, Raghuveer Sahay, Faiz Ahmed Faiz, Nand Kishore Acharya, Sarveshwar Dayal Saksena, Manglesh Dabral, Vinod Kr Shukla, Kumar Vikal, Gagan Gill, Katyayani, Anamika, etc. 4. Play: Mohan Rakesh (Aadhe-adhoore). 5. Non-fiction and criticism: (i) Pleasure readings; (ii) aesthetics versus committed literature; (iii) Sociology of literature"
  },
  {
    "Course Title": "Real Analysis",
    "Course Code": "MA4.101",
    "Course Description": null,
    "LOs/COs": [
      "CO1: describe the fundamental properties of the real numbers that underpin the formal development of real analysis",
      "CO2: demonstrate the knowledge of an understanding of the theory of sequences and series",
      "CO3: demonstrate skills in constructing rigorous mathematical arguments",
      "CO4: apply the theory in the course to solve a variety of problems at an appropriate level of difficulty",
      "CO5: demonstrate skills in communicating mathematics",
      "CO6: analyse how abstract ideas and regions methods in mathematical analysis can be applied to important practical problems"
    ],
    "Detailed Syllabus": "Unit 1: Sequence of real No, Bounded and Unbounded Sets, Supremum, Infimum, Limit points of a set, Closed Set, Countable and uncountable sets. Sequences, Limit points of a Sequence. Limits Inferior and Superior, Convergent sequence, Non convergent sequence, Cauchy General Principle of Convergence, bounded and monotone sequence, Infinite Series, Positive Term Series, Convergence of series of real numbers, Necessary condition, Absolute convergence and power series, Convergence tests for series. Unit 2: Mean value theorems (Rolles Theorem, Cauchy Mean Value Theorem, Lagranges Mean Value Theorem), Indeterminate forms, Taylors Series, Partial derivatives. Integration as a limit of a sum, some integrable functions, Fundamental theorem of Calculus, Mean Value Theorems of Integral calculus, Integration by parts, Change of variable in an integral, Second Mean value theorem, Multiple integrals. Unit 3: Vector, Vector operations, Products, Areas and Determinants in 2D, Gradients, Curl and Divergence, Volumes and Determinants in space. Differential equations of first order and first degree. Linear ordinary differential equations of higher order with constant coefficients. Elements of Partial Differential Equation (PDE). Unit 4: Analytic function of complex variable, CR Equation, harmonic functions, Laplace equation, applications. Unit 5: Integration of a function of a complex variable, M-L inequalities. Cauchys Integral Theorem. Cauchys Integral formula. Taylors and Laurent Expansion, Poles and Essential Singularities, Residues, Cauchys residue theorem, Simple contour integrals"
  },
  {
    "Course Title": "Real-Time Embedded Systems",
    "Course Code": "CS3.502",
    "Course Description": null,
    "LOs/COs": [
      "CO-1: Explain the features of real-time systems and classify different types of real-time systems such as hard real-time, soft-real time based on the timing requirements",
      "CO-2: Apply an appropriate task model (such as periodic, sporadic, aperiodic, etc) based on task/application characteristics to model a real-time system",
      "CO-3: Analyze the schedule ability of a real-time system with different types of scheduling algorithms (static vs dynamic, preemptive vs non-preemptive) on a uniprocessor",
      "CO-4: Analyze the schedule ability of a real-time system with different types of scheduling algorithms (global, partitioned, semi-partitioned) on a multiprocessor platform",
      "CO-5: Analyze the schedule ability of a real-time system with shared resources",
      "CO-6: Assess the theory and experimental results presented in a relevant research paper and present it",
      "CO-7: Develop scheduling algorithms in a RTOS simulator"
    ],
    "Detailed Syllabus": "Unit 1: Real-Time Systems  Introduction and Concepts, Modeling Real-Time Systems. Unit 2: Commonly used approaches to Real-Time Scheduling  Clock Driven approach, Weighted Round Robin approach, Priority Driven Approach, Dynamic vs Static Systems, Offline vs Online Scheduling, Preemptive vs non-preemptive. Unit 3: Clock Driven Scheduling  Scheduling Aperiodic and Sporadic Jobs, Schedulability test. Unit 4: Priority Driven Scheduling  Static Priority: Rate Monotonic and Deadline Monotonic Algorithms, Dynamic Priority: EDF Algorithm, Schedulability tests. Unit 5: Scheduling Aperiodic and Sporadic jobs in Priority Driven Systems  Deferrable Server, Sporadic Server, Constant Utilization Server, Total Bandwidth Server and Weighted Fair Queuing Server. Unit 6: Multiprocessor Scheduling. Unit 7: Resources and Resource Access Control"
  },
  {
    "Course Title": "Research in Information Security",
    "Course Code": "CS8.501",
    "Course Description": null,
    "LOs/COs": [
      "CO-1: Demonstrate skills in solving research problems and critical thinking skills",
      "CO-2: Demonstrate security protocols practically",
      "CO-3: Analyse various techniques for security protocols against different potential attacks",
      "CO-4: Demonstrate the knowledge of Formal security verification using automated software validations tools",
      "CO-5: Survey the literature in detail on existing security protocols to enable oneself to design, analyse and implement new security protocols"
    ],
    "Detailed Syllabus": "Unit 1: Elliptic-Curve Cryptography (ECC), Key management in hierarchical access control, Key management, user authentication and access control, Proxy signature. Unit 2: Security in vehicular adhoc networks/Internet of Vehicles (IoV), Security in smart grid/smart home, Security in Cloud/Fog computing. Unit 3: Wireless Sensor Networks (WSNs) and Internet of Things (IoT) security. Unit 4: Intrusion detection and prevention. Unit 5: Blockchain and its security and privacy issues, Blockchain-based AI/ML security"
  },
  {
    "Course Title": "Retrofit of Existing Infrastructure",
    "Course Code": "TBD",
    "Course Description": null,
    "LOs/COs": [
      "1. Explain the theory and concepts of Structural Retrofit and identify the damage mechanism and distress in masonry and RC buildings",
      "2. Quantify damage and stresses in structurally deficient building though computational methods",
      "3. Propose suitable retrofit techniques depending upon the extent and type of damage and the type of building",
      "4. Apply the concepts of solid mechanics and structural analysis in analysis and design of retrofitted structural elements",
      "5. Evaluate retrofitted masonry and reinforced concrete buildings under seismic loading through computational methods"
    ],
    "Detailed Syllabus": "Module 1: Basic Concepts: Introduction; Retrofit and its concept; Advantages and challenges; Retrofit materials; Difference between repair, retrofit, strengthening and rehabilitation; Codal provisions, Different techniques of retrofit, Mesh techniques; Section enlargement techniques; Addition of structural components; Retrofit of foundation system. Module 2: Damage Assessment of Existing Buildings: Causes of structural damage; Purpose of assessment; Detailed vulnerability assessment; Rapid visual survey; Non-destructive and semi-destructive testing; Numerical assessment of structurally deficient building; Computational stress analysis of structurally deficient building. Module 3: Numerical Modelling of Retrofit Techniques for Existing Buildings: Local and global methods of retrofit; Modelling of various retrofit techniques in software - RC jacketing, shotcrete, shear walls, frames and bracing. Module 4: Re-evaluation of Retrofitted Building: Numerical assessment of retrofitted building; Comparison between structurally deficient and retrofitted building; Check for capacity/drift and strength parameters; Codal provisions and acceptance criterion"
  },
  {
    "Course Title": "Robotics: Dynamics and Control",
    "Course Code": "EC4.401",
    "Course Description": null,
    "LOs/COs": [
      "CO-1: Describe coordinate frames, spatial transformations, and mathematical representation of joints and links",
      "CO-2: Describe the kinematics and dynamics of rigid body systems - serial manipulator",
      "CO-3: Formulate and analyze the forward and inverse model using analytical and numerical methods",
      "CO-4: Develop software programs to generate trajectory and control the robot to track the commanded trajectory",
      "CO-5: Apply the learned robot model for joint space control and end-effector control of the manipulator and analyze them"
    ],
    "Detailed Syllabus": "Unit 1: Introduction to robotics and rigid body motion  robot structure and workspace, transformation matrices, mathematical representation of joints and links, mobility analysis and constraints. Unit 2: Manipulator forward and inverse kinematics  position analysis and velocity analysis, singularities. Unit 3: Robot Dynamics  Euler-Lagrangian formulation and simulation of equations of motion. Unit 4: Trajectory planning and generation. Unit 5: Robot control  joint space control and operation space control"
  },
  {
    "Course Title": "Science I",
    "Course Code": "SC1.110",
    "Course Description": null,
    "LOs/COs": [
      "CO-1: Analyze the aims, methodology of science and technology, and their impact on society",
      "CO-2: Explain Special Theory of Relativity and compute its consequences for typical scenarios of relevance",
      "CO-3: Demonstrate familiarity with Lagrangian and Hamiltonian formulations of mechanics, by formulating the equations of motion from basic principles for mechanical systems",
      "CO-4: Explain connections between thermodynamics and statistical mechanics and their use in modern chemical computations",
      "C0-5: Infer the stability of molecules using the concepts of hybridization and molecular orbital theory",
      "CO-6: Recognize the role of symmetry in nature",
      "CO-7: Demonstrate problem solving skills up to a level that allows application to research topic of their interest"
    ],
    "Detailed Syllabus": "Unit 1: Mathematical modeling in sciences, (i) geometry and linear algebra, (ii) change and calculus and (iii) chance and probability. Simple models can have complicated behavior: logistic map demonstrates deterministic chaos. Unit 2: Forms in nature. Scales of length, time and energy in nature. Special theory of relativity: postulates, Lorentz Transformation, Length Contraction, Time dilation, Doppler effect, relative velocity determination, twin paradox, relativistic momentum and energy. Space time graphs, and relativity of simultaneity. Unit 3: Review of Newtonian Mechanics and its difficulties / failures. Introduction to Lagranian and Hamiltonian formulations, and application to mechanical problems. Unit 5: Need for Quantum Mechanics. Schrodinger equation for time-dependent and time independent scenarios. Application to atoms and molecules; provide qualitative picture of orbital hybridization to explain the molecular structures. Unit 6: Review of Thermodynamics and introduction Statistical Mechanics and applications to problems of relevance. Lasers. Fermi statistics, bandgap in semiconductors"
  },
  {
    "Course Title": "Science Lab -I",
    "Course Code": "SC4.110",
    "Course Description": null,
    "LOs/COs": [
      "CO-1: Setup and perform optics experiments to measure properties of material like optical rotation, wavelength of monochromatic light etc",
      "CO-2: Setup and perform chemistry experiments to measure properties like pH, concentration of chemicals and",
      "CO-3: Perform physical measurements to measure properties like frequency of osciallator, youngs modulus etc"
    ],
    "Detailed Syllabus": "Unit-1: Determination of the Specific Rotation of Sucrose and Composition of Sucrose Solution by a Polarimeter. Unit-2: Potentiometric Titration of a Mohr Salt Solution with Standard K2Cr2O7. Unit-3: Kinetic Study of the Decomposition of H2O2 in the Presence of FeCl3 Solution and the Effect of the Catalyst on the Rate Constant. Unit-4: Verification of the Beer-Lamberts Law with a given solution and the determination of the concentration of a solution. Unit-5: Determination of pKa of a Weak Acid by pH-Metric Titration Method. Unit-6: Newtons Ring Method to measure Radius of Curvature of Plano-Convex Lens. Unit-7: Determination of Youngs Modulus of Material of a Beam by Method of Flexure. Unit-8: To determine the number of rulings per unit length of a diffraction grating. Unit-9: Stewart and Gees Method for Determining the Magnetic Field of the Earth. Unit-10: To Measure Slit-Width and the Separation between two Slits of Double Slit, by Observing Diffraction and Interference Fringes and to Compare them by Microscopic Measurement"
  },
  {
    "Course Title": "Signal Detection and Estimation Theory",
    "Course Code": "EC5.406",
    "Course Description": null,
    "LOs/COs": [
      "CO-1: Describe the various detection methods for detecting/classifying the deterministic/random signals with perfect or statistical knowledge of their parameters",
      "CO-2: Discuss the various estimation methods for estimating the parameters of linear and non-linear signal models in the presence of Gaussian and non-Gaussian noise",
      "CO-3: Analyze and design an optimal detector for a given false alarm rate to detect deterministic/random signals",
      "CO-4: Analyze and design a minimum variance unbiased estimator, if it exists, for estimating the parameters of a signal",
      "CO-5: Implement and perform numerical analysis of the estimation and detection methods using Matlab",
      "CO-6: Apply a suitable method for the estimation/detection problems in the diverse engineering fields"
    ],
    "Detailed Syllabus": "Unit 1: Estimation Theory - Minimum Variance Unbiased (MVU) Estimation, Cramer Rao lower bound, Fisher Information, Neyman-Fisher factorization, Sufficient and complete test statistics, Rao Blackwell-Lehmann-Scheffe theorem. Unit 2: Estimation methods - Best linear unbiased estimation (BLUE), Least square estimation (LSE), Maximum likelihood estimation (MLE), Bayesian Approach, Numerical methods - Newton Raphson and Expectation maximization (EM) methods. Unit 3: Detection Theory - Hypothesis testing, Neyman-Pearson (NP) theorem, Likelihood ratio test (LRT), Receiver operating characteristic (ROC), Minimum probability of error, Bayes Risk, Minimum Bayes risk detector, MAP detector. Unit 4: Detection methodsDetection of deterministic signals - Matched filter for WGN and non WGN, Binary and M-array signal detection using matched filter. Detection of random signals - Estimator-correlator and linear model; Detection of deterministic signal with unknown parameters - Composite hypothesis testing, Generalized LRT (GLRT), Bayesian approach, Rao test, Wald test"
  },
  {
    "Course Title": "Signal Processing",
    "Course Code": "EC5.201",
    "Course Description": null,
    "LOs/COs": [
      "CO-1: Describe continuous-time and discrete-time signals using various representations",
      "CO-2: Apply various transforms including Fourier transform, DTFT, and Z transform to study signals and systems",
      "CO-3: Apply sampling theorem to do analog-to-digital conversion of signals, perform ideal and non-ideal reconstruction of signal from its samples",
      "CO-4: Examine computational complexity of efficient DFT implementations using FFT",
      "CO-5: Design digital filters with specified requirements to process signals",
      "CO-6: Analyze systems and real-world signals using signal processing tools in MATLAB software",
      "CO-7: Analyze a signal processing application or problem by reading research papers and performing simulations as part of the course project"
    ],
    "Detailed Syllabus": "Unit 1: Fourier transform (FT) of continuous-time signals, analysis of linear and time invariant (LTI) systems using Fourier transform. Unit 2: Sampling and reconstruction of bandlimited signals, analog-to-digital conversion, aliasing, quantization. Unit 3: Analysis of discrete-time signals and systems using Fourier transform (DTFT) and Z- Transform. Unit 4: Discrete Fourier transform (DFT) for finite length sequences, efficient implementation of DFT using radix-2 fast Fourier transform (FFT) algorithms. Unit 5: Digital filter design, techniques for FIR and IIR filter design"
  },
  {
    "Course Title": "Software Quality Engineering",
    "Course Code": "CS9.429",
    "Course Description": null,
    "LOs/COs": [
      "CO-1: Understand software quality concepts and gain skills necessary to design and analyze quality aspects of software systems",
      "CO-2: Apply various measurement techniques to re-engineer software systems",
      "CO-3: Apply specialized knowledge to identify open research problems and disseminate state-of-the art in software quality engineering research.",
      "CO-4: Critique the quality of published research papers with well-known assessment criteria",
      "CO-5: Synthesize novel solutions to open research problems in software quality engineering by following well-established principles of software engineering research."
    ],
    "Detailed Syllabus": "Process and Product Quality. Measurement Fundamentals  Why, What and How? Qualities and Tactics. Software Development Life Cycle  V & V perspective. Formal Methods and Quality. Usability and Accessibility. Qualities in intelligent Systems  Model, Data and System. Secure Software Engineering. Other research topics."
  },
  {
    "Course Title": "Software Systems Development",
    "Course Code": "CS6.302",
    "Course Description": null,
    "LOs/COs": [
      "1. Make students to have working knowledge of tools and technologies to build software systems.",
      "2. They can analyze and evaluate the ideas to develop the applications.",
      "3. Comfortable enough to work with various Unix-like computing environments.",
      "4. Able to write simple to complex scripts/programs.",
      "5. In a position to build small to medium sized software applications using various tools and technologies to automate tasks/solve problems.",
      "6. Students will be able to extend the existing applications/softwares to add more functionalities."
    ],
    "Detailed Syllabus": "1. Shell Programming - Linux basic commands, script writing, Swiss-army- knife tools (vi, grep, awk, sed ..). 2. Web Programming - Intro to basic concepts of the World Wide Web (WWW) and tools used to develop web apps. -Client-side & server-side scripting (HTML, XHTML, CSS, Java script, Python,). 3. Database Programming, Networking and Security concepts."
  },
  {
    "Course Title": "Spatial Informatics",
    "Course Code": "CS4.408",
    "Course Description": null,
    "LOs/COs": [
      "CO-1: Describe how Spatial Data Science helps uncover patterns",
      "CO-2: Apply Geospatial techniques to Prepare the data for analysis",
      "CO-3: Analyze the spatial and temporal data and interpret its outcomes",
      "CO-4: Assessment of application of Spatial data science in key domain areas",
      "CO-5: Design research projects that helps synthesize the learning into an application"
    ],
    "Detailed Syllabus": "1. What is Geographical Information Systems (GIS)? 2. Fundamental concepts of Space. 3. Geospatial data and its Digital representation  Vectors and Raster. 4. GIS Data collection, Editing and Data formats. 5. Data structures for Spatial data and Spatial data management (Geospatial database). 6. Spatial Data Query and Analysis  Spatial Analysis, Network Analysis. 7. Data compatibility - Projections and Georeferencing. 8. Spatial reasoning and uncertainty. 9. Web-GIS, GML and Map services. 10. Geospatial applications in few areas like in Hydrology (Water flows and floods); Ecology and Environment; Land use and Land cover; Urban planning and Transportation. 11. Topics in Spatial Informatics: 3DGIS, Open-Source Initiatives in GIS/RS."
  },
  {
    "Course Title": "Spatial Thinking and Practice",
    "Course Code": "TBD",
    "Course Description": null,
    "LOs/COs": [
      "CO-1: Comprehend concept of spatio-temporal analysis",
      "CO-2: Describe various surveying methods",
      "CO-3: Describe the significance of Global navigation systems",
      "CO-4: Implement a range of photogrammetric measurement techniques",
      "CO-5: Explain the basics of geodesy technology",
      "CO-6: Criticize the relevance of surveying methods in geospatial context"
    ],
    "Detailed Syllabus": "Unit-1: Concept of Space and Time: Geographical entities and Phenomena, Properties of Space, Size and Scale, comprehend spatial and temporal data throughout the processes of conceptualization, representation, computation, and visualization. Unit-2: Surveying: Principles of Surveying, Measuring equipment, Techniques, Levelling, Triangulation and Trilateration, Plane Table Surveys, Modern surveying equipment- Total Station, The mathematical model and errors, Random and systematic errors, adjustments techniques. Unit-3: GNSS: Intro to GNSS; GNSS survey, Keplerian laws, inertial coordinate systems etc., Overview of GNSS: GLONASS, GALILEO, BIDOU, IRNSS satellite systems etc., Differential GPS: GNSS Basic Observables: GNSS Surveying Techniques. Planning and field observations: Networking, data post processing. GNSS applications to Global, Regional and Local issues. Unit-4: Digital Photogrammetry: Fundamental principles and techniques of Photogrammetry surveying, camera calibration, image orientation, stereoscopic viewing, and digital image processing, photogrammetric methods for terrain modeling, Digital elevation model (DEM) generation Integration with other geospatial technologies (LiDAR, UAVs). Unit-5: Geodesy: Introduction to geodesy & its development; Earth and its gravity field. Earth and its atmosphere  physical properties, Introduction to GPS- its components, Instruments & processing software, GPS signals. GPS data collection, Data Handling-, GPS data processing, Errors in GPS data  Satellite Geometry, Multipath errors & corrections; Accuracy of GPS data. Datum transformation. Geoid modelling."
  },
  {
    "Course Title": "Spectroscopy",
    "Course Code": "SC2.304",
    "Course Description": null,
    "LOs/COs": [
      "CO-1 Outline the basic principles of different spectroscopic techniques",
      "CO-2 Analyze electronic, vibrational, and rotational spectra of molecules",
      "CO-3 Apply classical and quantum mechanical models to spectroscopy",
      "CO-4 Calculate the normal modes of simple molecules"
    ],
    "Detailed Syllabus": "Unit 1: Introduction: Classical mechanical description of spectroscopy, quantum mechanics and energy quantization, energy-level diagram, energy spectrum: electronic states, vibrational states, rotational states, excitation and relaxation, absorption and emission of electromagnetic waves by materials. Unit 2: Atomic Spectra: Spectral series of hydrogen and alkali atoms, selection rules, L-S coupling, many-electron atoms, isotope shift, hyperfine splitting of spectral lines. Unit 3: Molecular Spectra: Electronic spectra of diatomic and polyatomic molecules, Born Oppenheimer approximation, Franck-Condon principle, absorption and emission spectra, fluorescence and phosphorescence, Jablonsky diagram, effect of solvation of electronic spectra, rotational spectrum of a diatomic molecule using a rigid rotator model, energy levels and spectrum of a non-rigid diatomic molecule, effect of isotopic substitution on rotational spectra, vibrational spectrum of a diatomic molecule using the harmonic and anharmonic oscillator models. vibrational rotational coupling in a diatomic molecule, molecular spectra of chain molecules. Unit 4: Raman and Infrared Spectroscopy: Classical and quantum theory of Raman effect, normal vibrations of CO2 and H2O molecules, vibrational and rotational Raman spectra, basic concept of infrared spectroscopy, interpretation of Raman and IR spectra, identification of Raman-active and/or IR-active modes based on symmetry arguments. Unit 5: Introduction to Nuclear Magnetic Resonance (NMR), and Electron Spin Resonance (ESR) spectroscopy."
  },
  {
    "Course Title": "Speech Analysis and Linguistics",
    "Course Code": "CL2.405",
    "Course Description": null,
    "LOs/COs": [
      "CO-1: Explaining the basics of speech and linguistics.",
      "CO-2: Analyzing the linguistics in the state-of-the-art speech applications.",
      "CO-3: Applying computational linguistics foundations for speech analysis.",
      "CO-4: Analyzing the speech applications using phonemic, prosodic and text modelling.",
      "CO-5: Explaining the basics of phonemic, prosodic and text analysis.",
      "CO-6: Designing the algorithms for phonemic, prosodic and text modelling."
    ],
    "Detailed Syllabus": "Unit-1: Speech and linguistic basics -- Description of frames, phonemes, syllables, words, phrases, sentences and its use in speech-based feature computation. Unit-2: Linguistics in speech analysis -- Overview of speech applications (such as ASR, TTS, Speech pathology etc..), use of phonemes, graphemes, prosody and text. Unit-3: Phonemic analysis -- Phonemes and its accents, visual phonetics (Spectrogram, articulatory videos), pronunciation variations and modelling, grapheme to phoneme conversion, phoneme accent variations and identification. Unit-4: Prosodic analysis -- Prosodic structure, word and syllable prominence, prominence detection and its applications, Intonation and its modelling (such as ToBI etc..), pitch and prominence variations, intonation identification, pauses, disfluencies and its detection, speech rhythm and speaking rate. Unit-5: Text analysis -- language modelling, neural language models, metrics, text normalization, character-based speech analysis."
  },
  {
    "Course Title": "Speech Signal Processing",
    "Course Code": "EC5.408",
    "Course Description": null,
    "LOs/COs": [
      "CO-1: Explaining the speech production and modeling of it.",
      "CO-2: Analyzing the algorithms for speech events extraction.",
      "CO-3: Applying mathematical foundations of signal analysis for speech feature extraction.",
      "CO-4: Analyzing the speech signals using excitation source and prosody.",
      "CO-5: Explaining the basics of speech applications.",
      "CO-6: Designing the algorithms for speech events detection and speech applications building."
    ],
    "Detailed Syllabus": "Unit 1: Overview of signal processing, speech production, speech perception, types of speech, and LTI model of speech production. Unit 2: Pitch, formants, epochs and vowel region extraction. Unit 3: Speech analysis: STFT analysis, Linear prediction analysis and cepstral analysis. Unit 4: Prosody analysis and excitation source analysis of speech. Unit-5: Applications of speech processing such as speech recognition, speaker recognition and speech synthesis."
  },
  {
    "Course Title": "Statistical Methods in Artificial Intelligence",
    "Course Code": "CS7.403",
    "Course Description": null,
    "LOs/COs": [
      "CO-1: Demonstrate capability to model and represent physical entities as vectors (feature vectors) and carry out numerical computation.",
      "CO-2: Formulate and solve many practical problems as classification and regression. Also appreciate other problem settings like clustering, structured prediction.",
      "CO-3: Explain the fundamental mathematical ideas behind the popular machine learning algorithms",
      "CO-4: Discuss the practical (computational) challenges in design and implementation of machine learning algorithms including (i) dimensionality reduction (ii) computational complexity (iii) convergence of the algorithm (iv) offline and online computation",
      "CO-5: Apply the learnings on practical problems and real-life data. Appreciate the challenges with the real-world data sets.",
      "CO-6: Discuss the nuances of conducting experiments, analyzing performances and expose the world of empirical science in computation."
    ],
    "Detailed Syllabus": "Unit 1: Representation, Vectors, Distributions, Dimensionality reduction, problems and challenges in machine learning. Unit 2: Basic algorithms in machine learning, PCA, Perceptrons, Decision Trees, Analysis. Unit 3: Popular algorithms and settings including unsupervised learning, Support Vector Machines, Kernels, Bias and Variance, Model Selection. Unit 4: Neural Network Learning, Multi-Layer Perceptron, Backpropagation Algorithms, Exposure to Deep Learning."
  },
  {
    "Course Title": "Structural Dynamics",
    "Course Code": "CE1.501",
    "Course Description": null,
    "LOs/COs": [
      "CO-1. Develop knowledge and skills to mathematically express dynamics of structural systems",
      "CO-2. Employ the computer application skills in developing structural dynamics tools for predicting structural response to dynamic loading like earthquakes",
      "CO-3. Demonstrate problem solving skills for various scenarios of structural dynamics and work towards a research-based approach to the course",
      "CO-4: Develop critical thinking to help improve dynamic responses of structures",
      "CO-5. Analyze ethical and effective structural design practices in line with good dynamic response of structures under earthquake loading",
      "CO-6. Reorganize inter-personal skills required to manage possible inter-disciplinary, inter departmental collaborations in structural engineering and thus in structural dynamics"
    ],
    "Detailed Syllabus": "Unit 1: Response of simple Single Degree of Freedom (SDOF) systems: Introduction to structural dynamics; Definition of DOF; idealization of structure as SDOF system; Formulation of equations of motion for various SDOF systems; Free vibration of systems; Damping in structures; Undamped Systems; Forced vibration of systems; Steady state response to harmonic forces; Experimental determinations of natural frequency; Duhamel's integral and other methods. Unit 2: Analysis of Multi-Degree of Freedom (MDOF) systems: Static force displacement relationship; Strain energy of system; Formulation of equation of motion; Evaluation of natural frequencies and modes; Free vibration of undamped systems; Forced vibration of damped systems; Review of time history & response spectrum methods. Unit 3: Numerical Methods, and Approximate methods of computing natural frequencies: Eigen value problems and applications: Mode superposition principle; modal truncation errors; Ritz Vector approach; Direct Integration methods: Explicit methods - Central difference method; Implicit methods - Newmark- method; Rayleigh's method; Dunkerley's method; Rayleigh-Ritz method. Unit 4: Base excited systems: Formulation of equations of motion for SDOF and MDOF systems; Concept of spectral quantities; Response spectrum; Fundamentals of earthquake engineering; Discussion on IS 1893 (1:2016 provisions for buildings. Unit 5: Overview of dynamics of continuous systems: Vibration of flexural beams and shear beams: Equation of motion; Free vibration and Forced vibration."
  },
  {
    "Course Title": "Structural Engineering Design Studio",
    "Course Code": "CE1.502",
    "Course Description": null,
    "LOs/COs": [
      "CO-1 Use the understanding of the structural analysis concepts of structural components, for structural system design.",
      "CO-2 Write computer programs, to develop structural analysis software.",
      "CO-3 Analyse the structure using commercially available software",
      "CO-4 Design the components and systems using commercially available software",
      "CO-5 Appreciate the challenges in construction industry and get equipped to address some of the challenges"
    ],
    "Detailed Syllabus": "Unit 1: Review of Structural Analysis  Analysis of Planar Trusses, Shear Force and Bending Moment Diagrams, Structural Analysis-Force Methods-Displacement Methods, Deflected Shape Deflections, Approximate Methods of Analysis- Gravity and Lateral Loads-Beams, Frames. Unit 2: Numerical Methods  Bi-Section Method, Gauss Elimination, Newton-Raphson. Unit 3: Introduction to MATLAB  Vectors, Arrays and Matrices, Branching Statements and Loops, Introduction to Plotting, Linear Algebra, Curve Fitting, Script and Functions, Graphics -2D and 3D, Development of GUI Tool. Unit 4: Application of MATLAB  Analysis of Beams & Frames, Gravity and Lateral Load Analysis of Frames, Analysis of Planar Trusses. Unit 5: Introduction to STAAD, SAP2000 & ETABS  Modelling, Analysis and Design Concepts, Elastic Analysis and Design-Reinforced Concrete Building -Bare Frame Analysis, Analysis of Frames with Unreinforced Masonry Infills, Steel Building, Elastic Earthquake Behaviour of Buildings Modal Analysis-Linear Dynamic Analyses and Design-Response Spectrum Analysis, Time History Analysis, Introduction to Inelastic Earthquake Behaviour of Buildings-Nonlinear Static Analysis Essentials- Nonlinear Static Analysis."
  },
  {
    "Course Title": "Structural Safety of Built Infrastructure",
    "Course Code": "TBD",
    "Course Description": null,
    "LOs/COs": [
      "CO1: Evaluate the significance of structural assessment in preventing collapses and analyze structural safety through real-world examples and visual inspection techniques.",
      "CO2: Utilize both traditional methods like thrust line analysis for stability and advanced numerical methods for static and dynamic analysis of structures.",
      "CO3: Develop proficiency in using computational methods, material models, and modelling techniques to assess structural components and systems accurately.",
      "CO4: Apply various non-destructive testing methods to evaluate the integrity and safety of structures through practical applications and case studies.",
      "CO5: Evaluate the safety of existing structures based on reliability-based methods."
    ],
    "Detailed Syllabus": "Module 1: Introduction to structural assessment, structural collapse, choice of assessment method based on available information, type of collapse, and level of assessment. Rapid visual inspection, relevant recommendations, simple methods: thrust line analysis, stability under self-weight, gravity loads, lateral loads, equilibrium governing systems. Module 2: Computational methods in structural assessment: failure theories for ductile and brittle materials, material models: continuous, micro and macro models, modelling techniques: Finite element method, discrete element method. Module 3: Non-Destructive Testing (NDT) Techniques, Overview of non-destructive testing methods, Application of NDT in structural assessment. Introduction to structural reliability. Module 4: Case Studies: Detailed discussion of case studies on structural failures of built infrastructure, indicators and rehabilitation schemes."
  },
  {
    "Course Title": "Systems Biology",
    "Course Code": "SC3.203",
    "Course Description": null,
    "LOs/COs": [
      "CO-1: Identify regulatory motifs of biological networks",
      "CO-2: Infer the design principles of biological systems",
      "CO-3: Analyze biological systems by mathematical modelling"
    ],
    "Detailed Syllabus": "Unit 1: Network organization: Motifs, modules, and hierarchical networks. Unit 2: Design principles of biological systems. Unit 3: Dynamic modelling of biochemical systems. Unit 4: Biological Switches and Clocks. Unit 5: Robustness of Biological systems. Unit 5: Biological noise."
  },
  {
    "Course Title": "Systems Thinking",
    "Course Code": "EC5.202",
    "Course Description": null,
    "LOs/COs": [
      "CO-1: Apply knowledge of 1st principles from physics to develop system model",
      "CO-2: Develop state-space formulation for systems and analyze the behavior of 1st and 2nd order systems via time-domain specification for transients and steady-state",
      "CO-3: Design and develop proportional, derivative and integral controllers",
      "CO-4: Demonstrate a familiarity with organization of biological system and their parts",
      "CO-5: Apply principles of control to biological systems",
      "CO-6: Analyze emergent properties of biological systems by mathematical modeling"
    ],
    "Detailed Syllabus": "Unit 1: Mathematical modelling of systems via transfer functions and state-space. Unit 2: Time-domain performance and stability analysis of first and second order systems. Unit 3: Biological signals and systems (case study). Unit 4: Design principles of biological systems and control. Unit 6: Modeling and design of biological circuits."
  },
  {
    "Course Title": "Theory of Elasticity",
    "Course Code": "CE0.501",
    "Course Description": null,
    "LOs/COs": [
      "CO 1: Explain the basics concepts of stress, strain, tensor, vector, traction, and important properties of solids.",
      "CO 2: Discuss the fundamental theories of elasticity.",
      "CO3: Idealize the physical systems through mathematical equations.",
      "CO4: Represent the state of stress and strain in a body (2D and 3D) with respect to different planes or orientations.",
      "CO5: Analyze the boundary value problems using equilibrium, compatibility, and constitutive relations.",
      "CO 6: Derive the governing equations and their solutions for application to problems in plane stress and plane strain state, torsion and bending."
    ],
    "Detailed Syllabus": "Unit 1: Elasticity and its types, Inelastic material, Difference between theory of elasticity and strength of material, Materials and its properties, Assumptions in elasticity, Mathematical preliminaries: cartesian co-ordinates, introduction to tensor, matrix representation, operators and symbols. Unit 2: Concept of stresses and strains, Infinitesimal area and volume, 2D and 3D stress tensor, Stress and strain transformation at a point in an elastic body, Difference between stress and traction, Cauchys stress, Components of traction, Strain tensors, Types of deformation, Measurement of surface strains. Unit 3: Rigid body translation and rotation of an element in space, Generalized Hooks law, Stress strain relationships, Equilibrium equations, Strain-displacement relationships, Compatibility conditions, Constitutive relations. Unit 4: Principal planes, Principal stresses and invariants, Octahedral plane and stresses, Deviatoric stress, Hydrostatic stress, Plain stress, Plain strain, Formulation of boundary value problems in equilibrium and compatibility, Stress functions, Biharmonic equation, Solution of 2D problems by the use of polynomials. Unit 5: Torsion of bars, Saint venant principle, Rigid body rotation, bending of beams, Elastic stability, Factors affecting lateral stability, Analysis of beam-column with different loading conditions, Different types of buckling."
  },
  {
    "Course Title": "Thinking and Knowing in the Human Sciences  II",
    "Course Code": "HS0.202",
    "Course Description": null,
    "LOs/COs": [
      "CO-1: Students will understand how a historical and sociological perspective helps to understand society. They will be learn to see the human world appears through the lens of these two disciplines and their insights.",
      "CO-2: Students will understand the methods, assumptions, principles, and the foundational ideas of the various schools of history.",
      "CO-3: Students will understand key concepts and theoretical and methodological tools in sociology.",
      "CO-4: Students will see the potential as well as the limitations of historical and sociological approaches to social analysis.",
      "CO-5: Students will use sociological and historiographical theories and frameworks. They will gain some experience in engaging with academic texts as well as primary sources in a theoretically informed manner."
    ],
    "Detailed Syllabus": "Unit 1: Sociological Concepts: Social Structures, Individuals and Groups, Socialisation, Structure/Agency, Status and Roles, Rules, Values, Norms, Culture, Discourse, Deviance. Unit 2: Sociological Frameworks and Theories: Understanding social stratification through the structural functionalist, Marxist and the Weberian methods. Introduction to key ideas of Emile Durkheim, Karl Marx and Max Weber. Unit 3: Social Institutions and Processes in India. Unit 4: Ideas of History (Progress, Decline, Morality; Facts, Objectivity, Interpretation). Unit 5: Concepts of Time and Space. Unit 6: Main methods of knowing the past (Inductive and deductive methods; structuralism and post-structuralism)."
  },
  {
    "Course Title": "Topics in Applied Optimization",
    "Course Code": "MA8.401",
    "Course Description": null,
    "LOs/COs": [
      "CO-1. Learn additional theory needed from calculus and linear algebra for optimization.",
      "CO-2. Learn to model various applications from data science as an optimization problem.",
      "CO-3. Learn to prove convergence estimates and complexity of the algorithms.",
      "CO-4. Learn to code optimization solvers efficiently using Python.",
      "CO-5. Demonstrate expertise in applying optimization methods in research problems."
    ],
    "Detailed Syllabus": "Unit 1: Convex Sets, Convex Functions, Duality, Convex Optimization Problems (9 hours). Unit 2: Steepest Descent, Newton methods, Quasi-Newton Methods, Interior Point Methods, Stochastic Optimization algorithms (SGD, RMSprop, ADAM, SVRG, etc.), Convergence Estimates (6 hours). Unit 3: Applications of optimization: Recommender Systems, Support Vector Machines, Neural networks, Image, and Video Completion, Extreme Classification, Gans (9 hours)."
  },
  {
    "Course Title": "Topics in Nanosciences",
    "Course Code": "SC2.401",
    "Course Description": null,
    "LOs/COs": [
      "CO-1. Define terminology used in the fields of nanoscience and nanotechnology.",
      "CO-2. Explain the nanoscale confinement effects on various material properties.",
      "CO-3. Discuss various methods of synthesis of nanoparticles.",
      "CO-4. Identify the factors that need control for the preparation of stable and controlled sized and shaped nanoparticles.",
      "CO-5. Explain the determination of the particle size and shape.",
      "CO-6. Identify and formulate appropriate methods and experimental techniques that can be used to study various nanoscale materials and phenomena.",
      "CO-7. Analyze the size- and shape-dependent physical/chemical properties of nanoparticles.",
      "CO-8. Identify various applications of nanoparticles and their future potential.",
      "CO-9. Describe the advantages and limitations of nanostructured materials."
    ],
    "Detailed Syllabus": "Unit 1. Introduction to Nanoscience. Nanomaterials: Definitions and Scopes. Length Scales: Size Scales, Surface and Interface, Surface Energy, Coordination Numbers. Classification of nanomaterials: Clusters and Magic Numbers, Nanoparticles, and Colloids. Metal, Semiconductor, and Bio Nanomaterials. Unit 2. Properties of Nanomaterials. Electrons in Nanostructures. Discrete states vs. band structure: Effects of dimensionality and symmetry in nanostructures. Metal-to-nonmetal transition. Thermodynamics and Kinetics of Small-Sized Systems. Capillarity, Liquid droplets, Lotus effect. Self assembly principles. Adsorption, Electrostatic and Steric Stabilization. Classical nucleation theory. Size and shape control in nanoparticle formation. Magnetic (Super paramagnetism), Electrical (quantized conduction and Coulomb Staircase), Optical (size and shape effects), Thermal (melting and conduction), Mechanical and Catalytic properties. Unit 3. Making Nanostructures. Top-down and bottom-up methods. Unit 4. Tools for Nano systems. Microstructure/Chemistry/Defects and Structure. AFM, SEM, TEM, XRD, SAXS, Nanoindentation. Unit 5. Applications of Nanomaterials. Catalysis, Band Gap Engineered Quantum Devices, Sensors, Field Effect Transistor (FET), Photoelectrochemical Cells, Photonic Crystals and Waveguides, Theragnostics (Magnetothermal Therapy), food and agriculture industries, automobile, textile, water treatment and civil applications, use in energy, space, and defense. Unit 6. Concerns and Challenges of Nanotechnology. Environmental, ecological and health hazards of nanoparticles. Nanotoxicology and its effect."
  },
  {
    "Course Title": "User Research Methods",
    "Course Code": "CS9.501",
    "Course Description": null,
    "LOs/COs": [
      "CO-1: Apply basic qualitative and quantitative research methods, like3-dimensional framework using attitudinal and behavioral, quantitative and qualitative, and context of use; conduct field study, stakeholder interviews, log analysis etc.",
      "CO-2: Design and develop field and lab studies, by employing various research methods like interviews, comparative analyses etc., write proposal",
      "CO-3: Evaluate the users need and pain points, identify and recognize the problem and gaps, generate possible solutions to user problems",
      "CO-4: Analyze the ethics of conducting study and observations",
      "CO-5: Synthesize the user research data and summary"
    ],
    "Detailed Syllabus": "Unit 1: Understanding User. Introduction and Overview  foundation of user experience, key terms, highlight the hall of shame, why user centric design and control is important; attitudinal and behavioural dimension. User need assessments, Qualitative research method, Interview protocols followed up with activities. Know your user  age, gender, cognitive / psychological perspectives, people with disability or accessibility. Unit 2: Lab and Field, Quantitative and Qualitative methods. Observation Techniques. Conducting studies in usability lab, Lab studies  eye-tracking, behavioural observations, control design observations. Field study, site visits, naturalistic observations, controlled field experiment, individual and group survey and focused interviews, customer satisfaction, remote testing. Industry practice - A/B and Multivariate testing, card sorting or tree testing, qualitative and quantitative method, how to deliver user research results. Unit 3: Ethics. Code of conduct; Participants Rights, Privacy-data safety, Respect  individual rights, time and effort, Sensitive and Empathetic; Risk analysis; Informed Consent. How to conduct interview, make observations, and extract data from interview, ethics and consent, user research protocols, survey based observations. Unit 4: Statistics  How to present User Research Results. Data Visualization and Presentation. Qualitative Analysis  Thematic, values, product quality etc. organize and summarise data. Quantitative Analysis  count, accuracy, response time or time taken to complete the task or speed analysis, visualization, learning curve. Analysis  Qualitative and quantitative analysis, survey and questionnaire analyses."
  },
  {
    "Course Title": "VALUE EDUCATION  I",
    "Course Code": "OC3.101",
    "Course Description": null,
    "LOs/COs": [
      "CO-1: Apply the basic framework of universal human values to the self.",
      "CO-2: Look at larger issues that (for many reasons) most are not exposed to: social, political, community, family, individual, etc. in a sensitized way.",
      "CO-3: Understand themselves and their own roles within the bigger context. What are really, truly important to them? What are made important by others?",
      "CO-4: Engage and connect with others and nurture the relationships.",
      "CO-5: Think to shape and change the world, and not be mere technologists or scientists."
    ],
    "Detailed Syllabus": "Unit 1: Goal in life - short term and long-term goals; Basic aspirations - Happiness and Prosperity; Role of education and human conduct; Self-exploration; Developing a holistic view. Unit 2: Gratitude and the need to acknowledge ones gratefulness; Understanding Self and Other. Unit 3: Living in harmony at 4 levels: self-self, self-family, self-society, self-nature. Unit 4: Understanding needs of body and self; Right understanding of physical facilities and relationships; Understanding human relationships; Trust and Respect - the foundational values in relationships. Unit5: Harmony in Society; The sense of safety, justice and peace in society; Nature and Sustainability; Self-reliance and Gandhian thought."
  },
  {
    "Course Title": "VLSI Design",
    "Course Code": "EC2.201",
    "Course Description": null,
    "LOs/COs": [
      "CO-1: Analyze delay and noise performances of CMOS inverter",
      "CO-2: Apply the knowledge of delay and noise analysis of CMOS inverter for other logic styles",
      "CO-3: Apply the knowledge of different logic styles for developing digital building blocks such as gates, multiplexors, latches and flip-flops",
      "CO-4: Design delay optimized multistage logic circuits by using method of logical effort",
      "CO-5: Design combinational circuits using CMOS and pass transistor logic for minimum delay and maximum noise margin performances",
      "CO-6: Design a delay optimized sequential CMOS circuit such as 8-bit multiplier for the given load and speed requirements, while ensuring no setup time or hold time violations and verify its post layout performance using SPICE tools"
    ],
    "Detailed Syllabus": "Unit 1 (Introduction to VLSI design):1) Introduction to VLSI design (top-bottom approach) - flow, applications, technologies, 2) MOSFET, FinFET transistors  Geometry and model, 3) Introduction to basic building blocks - SPICE, HDL, layout, 4) Moores law, technology scaling, current trends(5- lectures/7.5-hours). Unit 2 (CMOS Inverter): 1) Static characteristics- VTC, switching threshold, Noise margin, 2) Dynamic characteristics  rise time, fall time, delay, power, 3) Why CMOS Inverter, 4) CMOS inverter design flow- problem of achieving higher speeds (solution/technique discussed in the following unit), 5) From inverters to other logic - pull-up, pull-down networks, tristate inverter, Gates, Mux, Latches, Flip-flops, set-up hold time, clocked CMOS and true single phase clocked (TSPC) latches (7- lectures/10.5-hours). Unit 3 (Multistage Logic Design and Optimization: 1) Parasitics in layout causing performance degradation  field transistor, active MOS, gate-drain overlap, latch-up, 2) Method of logical effort fan-out, Stage effort, electrical effort, device sizing, design examples. (5-lectures/7.5-hours). Unit 4 (Other Logic Styles): Pseudo nMOS, pass transistor logic, Cascode Voltage Switch Logic (CVSL), Dynamic logic. (3-lecturs/4.5-hours). Unit 5 (Other topics Introduction to System Design using HDL): Finite state machines  Mealy, Moore, Intro to RTL,Data path, Control unit, combinational and sequential circuit design examples (6-lectures/9-hours)."
  },
  {
    "Course Title": "Work, Entrepreneurship and Technology in Contemporary Societies",
    "Course Code": "HS2.303",
    "Course Description": null,
    "LOs/COs": [
      "CO-1 Students will develop a foundational understanding of issues, definitions, and processes related to work, entrepreneurship, and technology.",
      "CO-2 Students will be able to acknowledge the panoply forms of work and their organization. They would be introduced to work across sectors: agriculture, manufacturing, and services. Subsequently, the students would have a sound knowledge of how global economic forces shape local work arrangements.",
      "CO-3 Students will be able to distinguish how economic engagements (work and entrepreneurship) differ in the context of the global north and the global south. They would be able to engage in the transformation of economic engagements in the past century. Thus, the students would engage in diverse working conditions (formal and informal) and spread self-employed entrepreneurial enterprises.",
      "CO-4 Students will be able to analyze how social institutions (such as technology, gender, class, and caste) shape entrepreneurial enterprises and work engagements. The students will be introduced to concepts of embeddedness, networks, and communities that shape the economic lives of individuals.",
      "CO-5 Students will understand how work and entrepreneurship, rather than being binaries, are deeply interconnected. With an appreciation of multiple economic scales of entrepreneurship and work, the course will highlight the role of capital, labor, and technology in creating deeply connected processes.",
      "CO-6 Students will develop a critical outlook on how technology shapes economic engagements (work and entrepreneurship) and how there is a bottom-up adoption and usage of technology that gives rise to unintended economic consequences."
    ],
    "Detailed Syllabus": "Unit-1 Sociology of work: Theories and basic concepts of work. Historical discourses and practices around work. Introduction to sectoral (agriculture, manufacturing, and service) understanding of work in contemporary markets. Unit-2 Diverse forms of work: Formal and informal work, and productive and reproductive work. Debt and bondage in labour markets; precarity and dignity within contemporary work arrangements. Role of social institutions (gender, caste, and technology) in shaping work and work relations. Unit-3 Introduction to entrepreneurship: Definition of entrepreneurship, historical discourses in the sociology of entrepreneurship: charismatic individuals, entrepreneurial groups, entrepreneurship as a process. Types of entrepreneurial engagements: Silicon Valley entrepreneurs, intrapreneurship, main-street entrepreneurs, and self-employed entrepreneurs. Unit-4 Entrepreneurial processes and outcomes: Value creation and the role of finance in entrepreneurship. Role of social networks (kinship and peer networks) in the entrepreneurial process. Reciprocity and resources within entrepreneurial ventures. Unit-5 Technology and contemporary economy: Historical transformation technology from the 19th century to the present  highlighting key phases of technological transformation, Globalization and technological adoption, Contingent work and digital technology, Role of technology in contemporary entrepreneurship, and technology as an institution."
  },
  {
    "Course Title": "Wireless Communications",
    "Course Code": "EC5.407",
    "Course Description": null,
    "LOs/COs": [
      "CO-1: Identify and explain the fundamental operational and design problems of wireless communication systems.",
      "CO-2: Demonstrate understanding of evolution of different wireless communication systems and standards.",
      "CO-3: Determine the type and appropriate model of wireless fading channels based on the system parameters and the properties of the wireless medium.",
      "CO-4: Design appropriate receiver and transmitter diversity techniques and analyze their performance theoretically and via simulations.",
      "CO-5: Design appropriate multiple-antenna transceivers and evaluate rate and error performance.",
      "CO-6: Demonstrate understanding of OFDM and massive MIMO techniques and application in existing and upcoming wireless systems."
    ],
    "Detailed Syllabus": "Unit 1: Review of digital communication, optimal detection, overview of wireless communication generations and standards. Unit 2: Channel modeling; Multipath propagation; pathloss and fading; types of fading; frequency and time selectivity. Unit 3: Diversity techniques; spatial, time and frequency diversity; performance analysis of various diversity techniques. Unit 4: MIMO communication systems; capacity analysis; MIMO receivers. Unit 5: OFDM, massive MIMO, multiuser communication."
  }
]