[
  {
    "Course Title": "Advanced Computer Architecture",
    "Course Code": "CS2.501",
    "Course Description": "This course delves into advanced computer architecture, focusing on the design and optimization of high-performance computing systems. It covers instruction-level and data-level parallelism, including superscalar processors, GPUs, and vector architectures. The curriculum explores sophisticated memory hierarchy designs, emerging memory technologies, and domain-specific accelerators like TPUs. Furthermore, students will examine the application of AI/ML techniques for architectural enhancements, such as cache optimization and power management. A critical component addresses security vulnerabilities, including side-channel attacks. Upon completion, students can analyze complex architectures, identify performance bottlenecks, and propose effective mitigation strategies, encompassing security considerations.",
    "Detailed Syllabus": [
      "Unit 1: Instruction Level Parallelism and Superscalar Processors; Microarchitecture design and analysis of Out-of-Order processors; Compiler and Architecture Interactions.",
      "Unit 2: Data Level Parallelism and SIMD/GPU Architectures; Vector Architectures; GPUs; Compiler and Architecture Interactions.",
      "Unit 3: Memory Hierarchy Design and Emerging Memory Technologies; Design of Cache Memory; Distributed Shared Memory; Memory Consistency Models; Non-volatile memories.",
      "Unit 4: Emerging and Domain Specific Accelerators; Hardware accelerators for deep neural networks and Genomics; AMD AI/ML Engine; TPUs.",
      "Unit 5: AI/ML Techniques in Architecture; Reinforcement Learning Techniques in Cache Optimization, Branch Prediction etc.; Power Management.",
      "Unit 6: Security; Side Channel Attacks such as Spectre and Meltdown"
    ]
  },
  {
    "Course Title": "Advanced Computer Networks",
    "Course Code": "CS3.402",
    "Course Description": "This Advanced Computer Networks course delves into the intricate principles governing modern network design, analysis, and management. It explores network traffic modeling, performance measurement, and robust flow and congestion control mechanisms, including various TCP variants. The curriculum covers sophisticated routing protocols, router design, and Quality of Service considerations, alongside wireless network technologies and mobility support. Furthermore, it examines cutting-edge topics like Software-Defined Networking (SDN), Information-Centric Networking (ICN), and overlay networks. Upon completion, students will be equipped to apply advanced routing, analyze privacy-enhancing techniques, and design scalable frameworks for contemporary enterprise network infrastructures.",
    "Detailed Syllabus": [
      "Unit 1: Modeling and measurement: Network traffic modeling, network measurement, simulation issues, network coding techniques.",
      "Unit 2: Flow and congestion control, TCP variants, TCP modeling, active queue management.",
      "Unit 3: Routing: Router design, scheduling, QoS, integrated and differentiated services.",
      "Unit 4: Wireless networks: Mobility supports, MAC, multicast.",
      "Unit 5: Overlay networks and Emerging applications: SDN, ICN, P2P, CDN, Web caching, cross-layer optimizations, VoIP, SIP, video over P2P"
    ]
  },
  {
    "Course Title": "Advanced Natural Language Processing (NLP)",
    "Course Code": "CS7.501",
    "Course Description": "This advanced Natural Language Processing course explores contemporary paradigms in semantic representation, from distributed to contextual models such as ELMO and BERT. It critically examines statistical and neural approaches to Machine Translation, alongside advanced methods for extractive and abstractive summarization. The curriculum further integrates the application of Reinforcement Learning within NLP contexts. Through this exploration, students will gain a comprehensive understanding of deep learning models and apply these sophisticated techniques to tackle complex, fundamental NLP tasks.",
    "Detailed Syllabus": [
      "Unit 1: Distributed Semantics.",
      "Unit 2: Contextual Distributed Semantics; Models such as ELMO, BERT, ERNIE and their derivatives.",
      "Unit 3: Statistical Machine Translation methods; Early Neural Machine Translation models.",
      "Unit 4: Extractive and Abstractive Summarization; Neural Summarization Methods.",
      "Unit 5: Reinforcement learning for NLP"
    ]
  },
  {
    "Course Title": "Advanced Operating Systems",
    "Course Code": "CS3.304",
    "Course Description": "This course offers an in-depth exploration of advanced operating system design and implementation principles, with a significant focus on the Linux kernel. Students will analyze core OS abstractions, system calls, and delve into critical components like virtual memory management, CPU scheduling algorithms, and concurrent programming paradigms. Practical engagement involves kernel module programming, extending system calls, and understanding kernel startup and debugging techniques. Upon completion, students will possess a profound understanding of OS internals, practical kernel development skills, and an awareness of contemporary research directions in operating systems.",
    "Detailed Syllabus": [
      "History of Operating Systems, Processes and OS Abstractions, OS APIs, Interrupts and system calls, Introduction to the Linux Kernel, Compiling the kernel, Module programming, Writing your own system calls, Overview of kernel startup and initialization, Kernel Debugging Techniques, Interrupts PICS, APICS, exceptions (traps) and hard interrupts, IDTs, Address Spaces and Loading, Virtual Memory, Memory allocators, Overview of memory spaces: logical segmentation, linear virtual, actual physical, Detecting BIOS-provided physical RAM map, paging, buddy system, setting up page directories (global, upper, middle), tables and PTES, (N)UMA, nodes, zone, memory types, Setting up buddy system, Allocating contiguous pages from buddy system, Setting up slabs for small memory objects, CPU Scheduling, Threads, Process structures, organization, initialization, Concurrent Programming, Locking, Deadlocks, Structures: thread union, thread info, stack, task, and thread struct, Creating kernel threads, using kthread, Kernel process scheduling, Scheduling processes with red-black tree, process switching, Context switches, Switching to suspended process, Linux File Systems and Disk Scheduling"
    ]
  },
  {
    "Course Title": "Algorithms and Operating Systems",
    "Course Code": "CS3.306",
    "Course Description": "This course provides a foundational understanding of Operating Systems and core algorithmic principles. Students will explore OS components including processes, multithreading, scheduling, process synchronization, memory management, and deadlock handling. Concurrently, the course delves into fundamental algorithmic thinking, complexity analysis, and design paradigms such as greedy, divide and conquer, dynamic programming, and graph algorithms. Practical outcomes include the ability to design efficient algorithms for complex computational problems, optimize resource management within operating environments, and implement robust applications by leveraging process and thread frameworks.",
    "Detailed Syllabus": [
      "Unit 1: Introduction to Operating Systems; Introduction to Algorithms and Complexity; Introduction to Process, multithreading and process scheduling.",
      "Unit 2: Process Synchronization; Greedy Algorithms; Divide and Conquer Algorithms.",
      "Unit 3: Dynamic Programming; Memory Management.",
      "Unit 4: Deadlocks; Graph Algorithms"
    ]
  },
  {
    "Course Title": "Algorithm Analysis and Design",
    "Course Code": "CS1.301",
    "Course Description": "This course provides a rigorous exploration of fundamental principles in algorithm analysis and design. Students will engage with classic design paradigms, including greedy algorithms, divide and conquer, and dynamic programming, applying them to problems such as graph algorithms and network flows. The curriculum then progresses to advanced topics like computational intractability, NP-completeness, and strategies for managing hard problems. Furthermore, the course introduces modern algorithmic approaches, covering approximation, randomized, and an overview of quantum algorithms. Upon completion, students will possess the ability to analyze algorithm efficiency, select appropriate design paradigms for diverse computational challenges, and understand methods for addressing inherent problem hardness.",
    "Detailed Syllabus": [
      "1. Basic graph algorithms",
      "2. Greedy algorithms",
      "3. Divide and Conquer",
      "4. Dynamic Programming",
      "5. Network flows",
      "6. NP and computational intractability",
      "7. Intro to Approximation and Randomized algorithms",
      "8. Intro to Quantum algorithms"
    ]
  },
  {
    "Course Title": "Applied Ethics",
    "Course Code": "HS0.303",
    "Course Description": "This course offers a rigorous examination of the philosophical foundations and analytical tools necessary for critical ethical inquiry. It navigates foundational concepts, argument analysis, and delves into challenges such as moral skepticism, cultural relativism, and the nature of 'good'. The curriculum then explores moral responsibility and critically evaluates major normative theories—consequentialism, deontology, and virtue ethics—applying them to contemporary ethical dilemmas. Students will develop advanced skills in analyzing ethical arguments, formulating nuanced justifications, and applying diverse normative frameworks to complex moral problems.",
    "Detailed Syllabus": [
      "Unit I- Introduction: Distinction between conventional and critical ethics, philosophical tools for argument analysis, intuition, evidence, justification, and explanation.",
      "Unit II - Skepticism: Intrinsic vs Instrumental value, challenge of egoism, problem of cultural relativity and subjectivism, error theory and nihilism, distinction between being ethical and seeming ethical.",
      "Unit III - Goodness: the problem of defining 'good', naturalistic fallacy and the open question argument, implications of the experience machine thought experiment.",
      "Unit IV - Responsibility: challenge of attributing moral responsibility to agents, the control, competence and epistemic conditions of responsibility, moral luck.",
      "Unit V - Normative theories: Consequentialism, deontology, and virtue ethics.",
      "Unit VI - Practical ethics: discussion of specific moral problems"
    ]
  },
  {
    "Course Title": "Automata Theory",
    "Course Code": "CS1.302",
    "Course Description": "Automata Theory provides a foundational exploration into theoretical computation, examining abstract machines and the formal languages they process. The course systematically covers finite automata (DFA, NFA) and their relationship with regular languages, including expressions and grammars. It then progresses to context-free grammars and pushdown automata, analyzing context-free languages. Finally, it introduces Turing machines, exploring universal computation, recursive languages, and fundamental concepts of computability and its inherent limitations. Students will gain proficiency in designing computational models, classifying formal languages, and understanding computational theory's boundaries.",
    "Detailed Syllabus": [
      "Unit 1: Introduction, Finite State Machines, Deterministic Finite Automata (DFA), Nondeterministic Finite Automata (NFA), Equivalence of NFA and DFA, Regular Expressions, Regular Languages, Closure Properties of regular languages, Pumping Lemma, Grammars, Left and Right-linear grammars.",
      "Unit 2: Context Free Grammar (CFG), Chomsky Normal Form, Push Down Automata (PDA), Equivalence of CFG and PDA, Context Free Languages (CFL), Deterministic PDA and Deterministic CFL, Pumping Lemma for context free languages.",
      "Unit 3: Introduction to Turing machines, Total Turing Machines, Recursive languages, Recursively enumerable languages, The Halting problem"
    ]
  },
  {
    "Course Title": "Basics of Ethics",
    "Course Code": "HS0.203",
    "Course Description": "This course introduces the foundational concepts and philosophical inquiry of ethics, emphasizing critical reasoning and argument analysis. It explores the distinctions between conventional and philosophical ethical approaches, alongside challenges posed by ethical skepticism, egoism, and cultural relativism. The curriculum delves into the complexities of defining 'good' and attributing moral responsibility. Students will engage with major normative ethical theories, including consequentialism, deontology, and virtue ethics, understanding their tenets and scope. By the end, students will be equipped to analyze ethical arguments, navigate conceptual challenges in normative inquiry, and formulate nuanced ethical justifications, fostering a critical understanding of moral frameworks.",
    "Detailed Syllabus": [
      "Unit I - Introduction: Distinction between conventional and critical ethics, philosophical tools for argument analysis, intuition, evidence, justification, and explanation.",
      "Unit II - Skepticism: Intrinsic vs Instrumental value, challenge of egoism, problem of cultural relativity and subjectivism, error theory and nihilism, distinction between being ethical and seeming ethical.",
      "Unit III - Goodness: the problem of defining 'good', naturalistic fallacy and the open question argument, implications of the experience machine thought experiment.",
      "Unit IV - Responsibility: challenge of attributing moral responsibility to agents, the control, competence and epistemic conditions of responsibility, moral luck.",
      "Unit V - Normative theories: Consequentialism, deontology, and virtue ethics"
    ]
  },
  {
    "Course Title": "Behavioral Research: Experimental Design",
    "Course Code": "CG3.402",
    "Course Description": "This course provides a comprehensive foundation in behavioral research, focusing on experimental design principles and methodologies. It covers the entire research process, from hypothesis formulation, operationalization, and literature review to various experimental designs, data collection strategies (including web/mobile and crowdsourcing), and advanced statistical analysis techniques like descriptive, inferential, and data reduction methods. Students will develop the practical skills to design, deploy, and analyze behavioral experiments, critically evaluate ethical considerations, and effectively communicate their research findings in academic formats.",
    "Detailed Syllabus": [
      "1. Introduction to Research Methods: Qualitative and Quantitative Approaches; Conducting Behavioural Research; Ethics in Research; Institute Review Board (IRB) Process.",
      "2. Starting on Research, Experimental Design: Hypothesis Testing, Type I and II errors, Hypothesis-based vs Exploratory Research, Operationalizing Research, Literature Review; Sampling, Types of variables and levels of Measurements, Designing an Experiment; Validity, Reliability and Cross-validation in Research.",
      "3. Types of Experimental design: Non-Experimental Designs, Pilot Testing; Data Collection: Surveys Questionnaires; Data Representation: Levels of Measurement, Human Annotation, Different types of design: Simple randomized design, Factorial designs, Simple repeated measures design, Randomized blocks design, Latin square type designs, Between-subject and within-subject factors in an experiment; Scaling Behavioural Experiments: web and mobile experiments, crowdsourcing, big data, large-scale experiments, citizen science, online data collection (PsiTurk, Mechanical Turk, etc).",
      "4. Data Visualization and Analysis: Descriptive Statistics, Tests of Normality and Data Transformation, Outliers, Collinearity in Data, Data Summarization vs Data Reduction Techniques: Exploratory Factor Analysis, Principal Component Analysis, Discriminant Factor Analysis.",
      "5. Introduction to Statistical Analysis: Inferential Statistics-Tests of Difference and Tests of Association: Multi-level tests (ANOVA): nonparametric and parametric tests of difference chi-square test, Mann Whitney U test, Binomial Sign test, Wilcoxon's T test, Related and Unrelated t tests; nonparametric and parametric tests of association correlation, regression; Significance testing.",
      "6. Communicating and Assessing Research: Writing, Poster and general Presentations (formatting of the research paper using APA and IEEE journal/conference formats)"
    ]
  },
  {
    "Course Title": "Bioinformatics",
    "Course Code": "SC3.202",
    "Course Description": "This course provides a comprehensive introduction to Bioinformatics, emphasizing computational methods for managing and interpreting biological sequence and structural data. It covers essential biological databases, next-generation sequencing technologies, and fundamental algorithms for sequence alignment (pairwise and multiple), pattern searching, and database querying. Students will explore principles of phylogenetic reconstruction and various gene prediction methodologies, integrating probabilistic models. Upon completion, students will be proficient in utilizing web-based bioinformatics tools and implementing core analytical methods for biological sequence interpretation.",
    "Detailed Syllabus": [
      "Unit 1: Overview Bioinformatics, Gene and Genome structure, Gene Technology Restriction Endonucleases, Cloning vectors, DNA sequencing - PCR, cDNA and Whole Genome sequencing, NGS and third generation sequencing technologies.",
      "Unit 2: Bio Databases: Major Bioinformatics Resources NCBI, EBI, PubMed, Primary Nucleotide and Proteins Databases - GenBank, Uniport, PDB, Genome Browsers - Ensemble, UCSC, k-mer analysis and their significance in biological sequences.",
      "Unit 3: Sequence Alignment: Pairwise Alignment - Types of pairwise alignments - Global, Local and Overlap alignments, Dot Plots, dynamic programming (DP) algorithm, Scoring matrices for nucleotides and proteins and gap penalties, Sequence-based Database Search algorithms - BLAST, FASTA, Multiple Alignment, Algorithms for Global and Local MSA - DP, Progressive based (ClustalX), Iterative methods, motif search-based methods.",
      "Unit 4: Modeling Molecular Evolution - Phylogeny: Markov models of base substitution, Computing Phylogenetic Distances, Phylogenetic Tree Construction Methods, PHYLIP.",
      "Unit 5: Gene Prediction: Gene Prediction approaches Open Reading Frames, Homology search, Content-based methods, Markov models"
    ]
  },
  {
    "Course Title": "Bio-instrumentation and Devices",
    "Course Code": "EC1.202",
    "Course Description": "This course delves into the fundamental principles and design of bio-instrumentation and devices, with a primary focus on electrophysiological signal acquisition and processing. It covers the generation of biological signals, their capture using micro-electrode systems, and subsequent amplification and conditioning via instrumentation amplifiers and specialized low-power CMOS circuits. The curriculum further explores Bio-MEMs, microfluidics, and lab-on-a-chip diagnostic devices, alongside various semiconductor and non-electrical sensing technologies. Students will gain the ability to design and analyze systems for processing electrophysiological signals and understand the operation of cutting-edge diagnostic tools.",
    "Detailed Syllabus": [
      "Module 1: Biological signals: electrophysiology (cardio, near, muscular); other signals. Understanding various biological system and the electrical signal they generate. Capturing the signals for biomedical systems. Micro-electrode arrays and micro-electrode systems.",
      "Module 2: Amplification & Signal Conditioning basics: Opamps; Instrumentation Amplifier; TIA: Review of analog circuits and amplifiers (AEC). Circuit system for specific applications.",
      "Module 3: CMOS VLSI circuit design, Potentiostat; switch cap amps: Discussion and analysis of specialized circuits and circuit design techniques for low power.",
      "Module 4: Diagnostic devices: UTAS & Lab-on-a-chip (RT PCR, On-chip-olfaction): Introduction to Bio-MEMs, Micro-fluidics. Basics of device fabrication theory (non-semiconductor). Status quo and review of some cutting-edge lab-on-chip applications. Introduction to smart systems.",
      "Module 5: JFET, ISFET, ChemFET; Non-electrical devices: Introduction to other semiconductor and non-semiconductor-based devices. Discussion and working of various devices. Current and future trends. Brief discussion on FinFETs.",
      "Module 6: Noise & noise efficient design"
    ]
  },
  {
    "Course Title": "Biomolecular Structure Interactions and Dynamics",
    "Course Code": "SC3.321",
    "Course Description": "This course profoundly explores biomolecular structure, interaction, and dynamics, critical for comprehending biological function. It covers foundational physicochemical principles, kinetics, and thermodynamics essential for dissecting biomolecular mechanisms. Students will investigate key experimental methods and structural concepts applied to protein and nucleic acid architectures. The curriculum integrates advanced computational approaches, including molecular modeling, docking, and molecular dynamics simulations. Learners will develop proficiency in inferring biomolecular function and interactions from sequence data and effectively utilize relevant structural and functional databases for comprehensive biological inquiry.",
    "Detailed Syllabus": [
      "Navigating the 'Sequence - Structure - Function' Space for Biomolecules. Understanding the 'physicochemical' principles underlying the 'structure-interaction-dynamics-function' of biomolecular machines. Application of the above principles to analyze the relationship of few molecular systems"
    ]
  },
  {
    "Course Title": "Blockchain and Web3 Development",
    "Course Code": "TBD",
    "Course Description": "This course provides a comprehensive exploration of blockchain technology and Web3 development principles. It covers foundational concepts like decentralization, distributed consensus, and the architecture of Bitcoin and Ethereum, including smart contracts and the EVM. Students will master Solidity programming, focusing on secure contract design, token standards, and the integration of decentralized applications (DApps). The curriculum also delves into advanced topics such as decentralized storage, oracle integration, and various blockchain scaling solutions. Graduates will be equipped to develop robust DApps, applying knowledge of smart contract security, scalability, and storage considerations.",
    "Detailed Syllabus": [
      "Unit 1: Introduction to decentralization and distributed consensus, Bitcoin blockchain, transactions and scripting, addresses and wallets, crypto mining, security attacks and anonymity in blockchain.",
      "Unit 2: Bitcoin vs. Ethereum, the need for smart contracts, tokens vs. coins, Ethereum Virtual Machine (EVM), isolation and security in EVM execution model, gas system, PoS consensus.",
      "Unit 3: Solidity, Remix IDE, basic variable types, functions, arrays, structs, and mappings, handling errors, imports, modifiers, inheritance, events and return variables, interacting with contract Application Binary Interface (ABI), memory modifiers and cost concerns, token standards (ERC-20, ERC-721, and ERC-1155).",
      "Unit 4: DApps, backend languages, development frameworks (Truffle vs. Hardhat vs. Foundry), integrating frontend, backend, and smart contracts, unit tests, interacting with the outside world using Oracles, decentralized storage (temporarily on IPFS, permanently on Arweave), secure development using Open Zeppelin, upgradable smart contracts.",
      "Unit 5: Scaling solutions, state channels, payment channels (PCN and PCH), side/child chains, commit and Plasma chains, Rollups (zk and Optimistic), cross chains, hybrid solutions"
    ]
  },
  {
    "Course Title": "Business Fundamentals",
    "Course Code": "PD2.421",
    "Course Description": "This course, Business Fundamentals, provides a comprehensive introduction to the essential concepts and practices underpinning modern business. It explores forms of business ownership, economic principles, and organizational structures, alongside fundamental management areas such as Operations, HR, Marketing, Accounting, Finance, Information Systems, and Strategy. Integrating themes of ethics, social responsibility, total quality management, and global business, the curriculum also delves into product development and value creation. Students will cultivate capabilities in strategic decision-making, resource optimization, and effective product marketing, enabling them to comprehend firm strategies and lead product initiatives.",
    "Detailed Syllabus": [
      "Introduction to Foundations of Business; Forms of Business Ownership; Business and Economics; Organization Structure; Fundamental areas of Management: Operations Management, HR, Marketing, Accounting and Finance, Information Systems, Strategy Management; Ethics and Social Responsibility; Total Quality Management; Product Development Process and Value Creation; Managing Teams, Leadership and Global Business"
    ]
  },
  {
    "Course Title": "Chemistry Topics for Engineers",
    "Course Code": "SC2.309",
    "Course Description": "This course provides engineers with a foundational understanding of essential chemical principles, emphasizing modern analytical techniques and advanced materials. It covers modern atomic and molecular spectroscopy, including NMR and ESR, for chemical identification and characterization. The curriculum then explores molecular orbital theory, electronic properties of solid materials, and various advanced systems like superconductors, conducting polymers, and nanomaterials. An introduction to green synthesis principles is also included. Upon completion, students will apply spectroscopic methods for analysis, comprehend material electronic properties, identify diverse applications of modern materials, and understand sustainable chemical practices.",
    "Detailed Syllabus": [
      "Unit 1: Introduction to modern atomic theory and its application to explain the atomic spectra and molecular spectra. Origin of electronic, vibrational and rotational levels, and their signatures in spectra. (3L)",
      "Unit 2: Excited states of atom and molecules. Lasers. Fluorescence, phosphorescence, and Froster energy transfer",
      "Unit 3: Introduction to Nuclear Magnetic Resonance Spectroscopy, and Electron Spin Resonance Spectroscopy (2L)",
      "Unit 4: Modern Electrochemistry. Butler-Volmer equation. Biosensing using electrochemical principles (4L)",
      "UNIT 5: Molecular Orbital Theory (Polar and Ionic compounds, Conductors, Semiconductor); Inorganic Pigments and Phosphors; and Superconductors Chemistry. (5L)",
      "UNIT 6: Modern and Futuristic Materials: Hydrides and Hydrogen Storage Materials; Molecular Materials; Liquid Crystals; Conducting Polymers; Supramolecular and Nanostructured Materials. (6L)",
      "UNIT 7: Green Synthesis: Principles and methods of synthesis with examples. (1L)"
    ]
  },
  {
    "Course Title": "Chemical Kinetics and Reaction Dynamics",
    "Course Code": "SC2.305",
    "Course Description": "This course explores chemical kinetics and reaction dynamics, foundational to understanding chemical change. It covers empirical rate laws, integrated kinetics, and temperature dependence, progressing to complex reaction mechanisms, homogeneous catalysis, and photochemistry. Students will delve into molecular reaction dynamics, applying collision and transition state theories to interpret potential energy surfaces. The curriculum also examines electron transfer processes and modern ultrafast laser techniques. Ultimately, students will analyze reaction mechanisms, predict rates, and connect theoretical principles to experimental observations and practical applications across scientific and industrial fields.",
    "Detailed Syllabus": [
      "Unit 1: Empirical chemical kinetics: Experimental techniques; The rates of reactions; Integrated rate laws; Reactions approaching equilibrium; The temperature dependence of reaction rates; Accounting for the rate laws; Elementary reactions; Consecutive elementary reactions; Impact on biochemistry: The kinetics of the helix-coil transition in polypeptides; Unimolecular reactions. (2L)",
      "Unit 2: Chain reactions; The rate laws of chain reactions; Explosions; Polymerization kinetics; Stepwise polymerization; Chain polymerization; Homogeneous catalysis; Features of homogeneous catalysis; Enzymes. (2L)",
      "Unit 3: Photochemistry, Kinetics of photophysical and photochemical processes; Impact on: The chemistry of stratospheric ozone; Applications: Impact on environmental sciences, biochemistry, and other areas. (1L)",
      "Unit 4: Molecular Reaction Dynamics: Reactive encounters; Collision theory; Diffusion-controlled reactions; The material balance equation. (2L)",
      "Unit 5: Transition state theory; The Eyring equation; Thermodynamic aspects; The dynamics of molecular collisions; Reactive collisions; Potential energy surfaces; Some results from experiments and calculations. (2L)",
      "Unit 6: The investigation of reaction dynamics with ultrafast laser techniques; Electron transfer in homogeneous systems; The rates of electron transfer processes; Theory of electron transfer processes; Experimental results; Impact on biochemistry: Electron transfer in and between proteins. (2L)",
      "Unit 7: Special topics (oscillating reactions, etc.)"
    ]
  },
  {
    "Course Title": "Computational Linguistics 2",
    "Course Code": "CL3.202",
    "Course Description": "Computational Linguistics 2 delves into advanced aspects of natural language understanding, focusing on semantic and pragmatic analysis. The course comprehensively explores word and sentence meaning, including lexical relations, ambiguity, and formal semantic representations. A significant emphasis is placed on computational pragmatics and discourse analysis, covering context-dependent meaning, conversational structure, coherence, and speaker intention. Topics further extend to knowledge representation, text classification, sentiment analysis, Gricean maxims, and speech act theory. Students will acquire the skills to develop computational resources for contextual text interpretation and apply cutting-edge CL/NLP techniques to real-world dialogue and discourse data, enabling both theoretical research and practical application.",
    "Detailed Syllabus": [
      "Unit 1: Background for studying word meaning and sentence meaning, sentence meaning and propositional content; sense and reference; referent, extension, prototype, stereotype; deixis and definiteness; predicates, referring expressions, universe of discourse; properties of sentences analytic, contradiction, entailment; properties of predicates - reflexive, symmetry, transitive. Word meaning and sentence meaning, content word and grammatical word, contextual variation; Speaker meaning vs Sentence meaning. Building resources using Lexical semantic relations Synonymy, Antonymy, Hyponymy, Troponymy, Meronymy; Metaphor and Metonymy; Polysemy and Homonymy; Semantic fields; Lexical ambiguity; Building dictionaries; Ontologies.",
      "Unit 2: Formal Semantics: Formal representation of natural language semantic features, case frames, semantic primitives. Logic, notation for simple propositions; connectives and, or, but, if etc.; Logical expressions for ambiguous sentences.",
      "Unit 3: Pragmatics and Discourse: Pragmatics and Discourse analysis as a study of context dependent aspects of meaning; text, co-text, context and relevance. Computational Discourse analysis: Studying Structure of text and coherence; exchange structure and conversational analysis; turn taking; adjacency pairs; preference organization; deixis; anaphora; ellipsis; discourse connectives and relations; Structural analysis of different kinds of texts.",
      "Unit 4: Text classification and generation: Memory and knowledge representation as schemas - frames, scripts and story grammar; Generation and processing of texts: Sentiment Analysis. Humour Analysis.",
      "Unit 5: Computational Pragmatics: Language Understanding; Meaning beyond textual context; speaker's intention and hearer's inference; inference bridging inferences, causal and spatial inferences, elaborative and restrictive inferences; Application of pragmatic concepts in Dialogue Systems: conversational implicature, conventional implicature, entailment and presupposition; co-operative interaction and Gricean maxims; speech act theory; language as action, performatives, direct and indirect speech acts and felicity conditions; politeness maxims; Austin and Searle's speech acts; Dialogue data annotation: Dialog Acts, Rhetorical Structure Theory"
    ]
  },
  {
    "Course Title": "Computer Problem Solving",
    "Course Code": "CS0.301",
    "Course Description": "This course introduces fundamental principles of computer problem-solving, emphasizing the C programming language. It covers essential programming concepts including variables, control flow, arrays, functions, and pointers. The curriculum progresses to advanced topics such as memory management, file handling, and the implementation of core data structures like stacks, queues, and linked lists. Students will also explore sorting algorithms and the critical analysis of algorithm complexity. Upon completion, students will be equipped to design and implement robust C programs, effectively manage data, and critically assess the efficiency of computational solutions.",
    "Detailed Syllabus": [
      "Unit 1: Basics of C Programming, Variables declaration, Input-Output, Operators.",
      "Unit 2: Arrays and Strings and Control Statements.",
      "Unit 3: Functions, Pointers.",
      "Unit 4: File Handling, Memory management.",
      "Unit 5: Stacks, queues, Linked Lists.",
      "Unit 6: Sorting Algorithms.",
      "Unit 7: Understanding Algorithm Complexity.",
      "Unit 8: Problem Solving and Computations Thinking"
    ]
  },
  {
    "Course Title": "Computer Programming",
    "Course Code": "CS0.101",
    "Course Description": "This course provides a comprehensive introduction to computer programming, covering foundational concepts from basic computer organization and program execution models to advanced data structures. Students will learn core programming constructs suchases variables, operators, conditionals, loops, functions, and arrays, progressing to dynamic memory management, pointers, and linked lists. The curriculum emphasizes practical skills through exposure to essential development tools for editing, compilation, debugging, and source code management (GIT, GDB, Make). Upon completion, students will be equipped to design, implement, and manage robust computational solutions efficiently and effectively.",
    "Detailed Syllabus": [
      "Unit 1: Basic computer organization, Von Neumann architecture and stored program concept; High level programming languages, assemble code, binary instructions, compilers and assemblers; Programming editing, compilation and execution cycle; Use of variables as reference to memory locations; Basic data types and their representation.",
      "Unit 2: Operators and precedence levels, expressions; Writing straight-line sequence of code; Standard I/O Libraries; Conditional Statements (if-then-else) and Loops (for, while etc.); Arrays.",
      "Unit 3: Functions and parameter passing mechanisms; Standard libraries for string manipulation, disk file access etc.; Structures, Unions and Enumerations.",
      "Unit 4: Recursion; Program stack, scope and lifetime of variables; Pointers, heap memory, dynamic memory management, linked lists and memory leaks.",
      "Unit 5: Preprocessor directives; Source code management tools like GIT and use of GDB for program debugging; Multi-file programming and Make files"
    ]
  },
  {
    "Course Title": "Computing in Sciences-1",
    "Course Code": "SC4.101",
    "Course Description": "Computing in Sciences-1 introduces fundamental computational methodologies for molecular modeling. The course begins with an exploration of quantum mechanical principles, covering concepts like the Variational Theorem, Density Functional Theory, and basis sets, alongside practical aspects of geometry optimization and frequency calculations. It then transitions to classical molecular mechanics, examining Newtonian equations of motion and the ergodic hypothesis to model molecular dynamics and derive thermodynamic properties. Students will develop familiarity with prepackaged software commonly used in quantum chemistry and molecular dynamics, enabling them to analyze molecular systems and compute essential thermodynamic properties.",
    "Detailed Syllabus": [
      "Unit 1: Basic outline of application of quantum mechanics to molecule/s. Variational Theorem, and introduction to density functional theory. Basis sets. Geometry Optimization and Frequency calculation. And other 'simple' properties from output of Quantum Chemistry software.",
      "Unit 2: Motivation for Classical mechanical models of molecules. Use of Newtonian equations of motion to model dynamics of molecular systems. Motivation for ergodic hypothesis, and calculation of thermodynamic properties"
    ]
  },
  {
    "Course Title": "Data Analytics-I",
    "Course Code": "CS4.405",
    "Course Description": "This course provides a foundational understanding of Data Analytics, commencing with data summarization techniques, characterization, discrimination, and data warehousing principles. It systematically explores core algorithms for pattern mining, association rule discovery, and various classification and regression methods. The curriculum further delves into clustering approaches and outlier analysis, concluding with emerging trends. Upon completion, students will be adept at describing, performing, and prescribing suitable data analytics solutions for complex business problems, enabling them to construct improved methods and formulate innovative data-driven services.",
    "Detailed Syllabus": [
      "Unit 1: Introduction, data summarization through characterization, discrimination and datawarehousing techniques;",
      "Unit 2: Concepts and algorithms for mining patterns and associations;",
      "Unit 3: Concepts and algorithms related to classification and regression;",
      "Unit 4: Concepts and algorithms for clustering the data;",
      "Unit 5: Outlier analysis and future trends"
    ]
  },
  {
    "Course Title": "Data and Applications [Half]",
    "Course Code": "CS4.301",
    "Course Description": "This course provides a foundational understanding of data management principles and their application in modern systems. Students will learn to state data requirements and develop conceptual models using ER diagrams. It delves into the relational data model, covering relational algebra, tuple calculus, and normalization for robust database design. Practical skills are honed through Structured Query Language (SQL), integrity constraints, and database connectivity. The course culminates in designing and implementing applications that effectively interact with relational databases, enabling efficient data access and manipulation.",
    "Detailed Syllabus": [
      "Unit 1: Data, Database, Database System;",
      "Unit 2: Data models, Conceptual Data Modeling, ER Models;",
      "Unit 3: Relational Data Model, Relational Algebra, Tuple Relational Calculus;",
      "Unit 4: SQL, Constraints, Triggers, Database Connectivity, Applications;",
      "Unit 5: Normalization, Relational Database Design"
    ]
  },
  {
    "Course Title": "Data Structures & Algorithms for Problem Solving",
    "Course Code": "CS1.304",
    "Course Description": "This course delves into fundamental and advanced data structures and algorithms, emphasizing their critical role in efficient problem-solving. It systematically covers core data types like linked lists, stacks, queues, trees, and graphs, alongside essential algorithmic techniques such as recursion, dynamic programming, searching, and traversal. Further exploration includes specialized structures like hash tables, tries, and heaps, integrating analysis of algorithmic complexity and correctness proofs. This comprehensive foundation equips students to analyze real-world problems, select optimal data structures and algorithms, and implement robust, efficient solutions.",
    "Detailed Syllabus": [
      "Unit 1: Review of basic data structures and algorithms (Linked list, stack, queue, 2D arrays, dynamic programming, recursion etc.).",
      "Unit 2: Algorithms on Trees and Graphs (Binary Search Tree, AVL Tree, Heaps, Graph Traversal, shortest path algorithms etc.).",
      "Unit 3: Problem solving with other data structures and algorithms (Hashing, Tries, Splay Trees, Range Trees, sorting etc.)"
    ]
  },
  {
    "Course Title": "Deep Learning: Theory and Practices",
    "Course Code": "CS7.601",
    "Course Description": "This course provides a comprehensive exploration of deep learning, covering its theoretical foundations and practical applications. It begins with feedforward neural networks, backpropagation, and optimization techniques, addressing critical aspects like bias-variance trade-off and regularization. The curriculum delves into key architectures including auto-encoders, convolutional and recurrent neural networks (LSTMs/GRUs), culminating in modern paradigms like Transformers, Generative Adversarial Networks, Diffusion Models, and Graph Neural Networks. Students will develop the expertise to design, implement, and critically evaluate advanced neural network solutions.",
    "Detailed Syllabus": [
      "This course covers fundamentals of Deep Learning including: Feedforward neural networks, back propagation, optimization methods; Bias variance tradeoff, regularization techniques; Auto-encoders, VAES, Word2vec; Convolutional neural networks (CNNs) and architectures; Recurrent neural networks (RNNs), LSTM, GRU; Encoder Decoder Models, Attention Mechanism, Transformers, GANs, Diffusion Models, Graph Neural Networks"
    ]
  },
  {
    "Course Title": "Design for Social Innovation",
    "Course Code": "CS9.429",
    "Course Description": "This course focuses on leveraging design thinking and emerging technologies to address critical social challenges. Students engage in deep social immersion, identifying grassroots problems and collaborating with changemakers and social organizations. The curriculum progresses through problem definition, ideation, and the design of technology components, culminating in the development and deployment of innovative solutions. Participants will gain practical frameworks and tools to conceptualize, design, and implement impactful technology-led interventions, inspiring future social enterprises.",
    "Detailed Syllabus": [
      "MODULE [I] Social Immersion: What Is Social Innovation; Interaction With Leading Changemakers; Identifying Core Developmental Sectors [Agri, Fintech, Healthcare, Edu etc] & Field Visits.",
      "MODULE [II] Societal Challenge Identification: Deep Dive into Defining the Problem; Market Research/Competitive Landscape; Circular Validation from Stakeholders [Organizations/Customers/End Users]. MO [IIDULEI] Design for Change: Ideation/Design Thinking on Problem Breakdown; Build An SRS Document; Identify Technology Components for Social Innovation; Project Design & Execution Plan.",
      "MODULE [IV] Technology for Social Innovation: Updates On Building the Technology; Examples of technology used in social innovation; Teams to build in the use of emerging technology/research. Finale: Hackathon #4: Final hackathon. Complete the solution; Deploy Solution in Stakeholder/End User Environment. Measure Impact"
    ]
  },
  {
    "Course Title": "Design for Testability",
    "Course Code": "EC2.407",
    "Course Description": "This course explores the essential principles and practices of Design for Testability (DFT) in VLSI circuit design. It covers fundamental concepts of testing, including fault modeling, fault simulation, and automatic test pattern generation (ATPG). Students will delve into various DFT methodologies, such as scan architectures and boundary scan, crucial for enhancing the testability of combinational and sequential CMOS circuits. The curriculum also examines Built-in Self-Test (BIST) techniques and architectures, alongside challenges in testing analog, mixed-signal, and System-on-Chip designs. This equips students to address semiconductor circuit testing issues early, thereby reducing production costs and improving product yield.",
    "Detailed Syllabus": [
      "1) Introduction: Role of testing in VLSI design flow, testing at different levels of abstraction, automatic test equipment.",
      "2) Faults and fault modeling, detection of faults, fault simulation and its applications, test pattern generation, automatic testing procedures.",
      "3) Design for testability: Various features incorporated for carrying out testing from input & output pins, scan architecture, test interface and boundary scan.",
      "4) Built-in Self-Test (BIST), BIST concepts, test pattern generation, BIST architectures.",
      "5) Testing of Analog and mixed signal ICs, testing of system on chip"
    ]
  },
  {
    "Course Title": "Design Thinking 101 - Research to Define",
    "Course Code": "PD1.301",
    "Course Description": "This course introduces Design Thinking as a human-centered approach to creative problem-solving and innovation. Students will first explore foundational design concepts and the core principles of Design Thinking, including its role in new product development. The curriculum deepens into the Discovery phase, focusing on methods for user research, empathy, and understanding user and business contexts. Subsequently, the Define phase covers data analysis, synthesis, and insight generation to formulate actionable problem statements. Practical application of tools for user personas, journey mapping, and stakeholder mapping equips students to advocate for end-users and integrate design thinking within product lifecycle management.",
    "Detailed Syllabus": [
      "UNIT 1. UNLEARNING: Initial part of the course will emphasize on unlearning and to cultivate a knack for design thinking, and creative problem solving.",
      "UNIT 2. UNDERSTANDING DESIGN AND DESIGN DOMAIN: Understanding Design; Role & Functions of design and designers; Design Elements; Understanding Design Domains and perspectives.",
      "UNIT 3. INTRODUCTION TO DESIGN THINKING: What is Design Thinking?; Why Design Thinking?; Design Thinking approach in new product development & innovative solutions.",
      "UNIT 4. DESIGN THINKING PROCESS: Design Thinking Process - human-focused, empathy, research, ideation and prototype-driven, innovative design approach; User-Centred Design / Double Diamond Process; Introduce/Initiate Design Thinking Pilot Project.",
      "UNIT 5. DISCOVERY PHASE: What is Discovery and Validation phase and why?; Understanding User Context? - Why & How to Empathies?; Understanding the User Needs and Goals; Understanding Business Goals; Tools and Methods and Deliverables.",
      "UNIT 6. DEFINE PHASE: Analysis and Synthesis of Data and Information; Driving Insights (both user and business) and solution directions; Tools and Deliverables of the Define phase.",
      "UNIT 7. DRIVING ACTIONABLE BRIEF: Through the process of analysis and synthesis, identifying user-business insights, arriving at an actional brief in form of HMW statement; Debriefing and briefing on upcoming course"
    ]
  },
  {
    "Course Title": "Design Thinking - Idea to Evaluate/Implement",
    "Course Code": "PD1.401",
    "Course Description": "This course systematically explores Design Thinking as a human-centered approach to innovation and problem-solving. Students will learn methods for empathic user research, creative ideation, and structured prototyping, moving from initial concept generation to tangible solutions. The curriculum emphasizes iterative user testing and validation processes to refine designs, alongside practical skills in documenting and presenting key deliverables. Upon completion, learners will possess the ability to collaborate effectively in co-creating and integrating robust design solutions within the broader product development and management lifecycle.",
    "Detailed Syllabus": [
      "UNIT 1. REVIST THE PREVIOUS LEARNINGS AND ACTIONABLE BRIEF: Revise the understandings and learnings of the earlier course. Revisit and deliberate on the actionable brief and tweak the same if needed. The process of divergence and convergence.",
      "UNIT 2. IDEATION (DIVERGENCE) PHASE: Power and Value of Ideation process; Process and techniques of Ideation to generate many ideas. Case study.",
      "UNIT 3. PROTOTYPING (DIVERGENCE) PHASE: Why prototyping?; Types of Prototypes - Low fidelity & high fidelity; Creation of prototypes. Case study.",
      "UNIT 4. USER TESTING AND VALIDATION: Why Test?; Types of user testing and evaluation; Process of user testing/validation using prototypes.",
      "UNIT 5. PROJECT WORK- IDEA GENERATION FOR THE PROJECT WORK: This week will be dedicated to a generation of ideas against the actionable brief.",
      "UNIT 6. PROJECT WORK - PROTOTYPE CREATION AND TESTING: Students will be required to develop several prototypes based on the ideas generated during the ideation phase and validate the ideas.",
      "UNIT 7. PROJECT WORK - TWEAKING IDEAS AND FINANLISING THE SOLUTION: Tweaking the ideas and further development of the same. Final presentation of the work"
    ]
  },
  {
    "Course Title": "Digital Image Processing",
    "Course Code": "CS7.404",
    "Course Description": "This course delves into the foundational principles and practical techniques of Digital Image Processing. It covers digital image fundamentals, enhancing subjective perception, and various filtering methods in both spatial and transform domains. Students will explore morphological and geometric transformations, color image processing, and advanced approaches including segmentation, restoration, and compression. The course equips learners with the skills to analyze, manipulate, and enhance digital images for diverse applications.",
    "Detailed Syllabus": [
      "Unit 1: Introduction and Digital Image Fundamentals;",
      "Unit 2: Methods for Improving Subjective Perception of Images;",
      "Unit 3: Spatial and Transform Domain Image Processing;",
      "Unit 4: Morphological and Geometric Image Processing;",
      "Unit 5: Color Image Processing;",
      "Unit 6: High-level Image Processing and Advanced Approaches"
    ]
  },
  {
    "Course Title": "Digital Systems and Microcontrollers (DSM)",
    "Course Code": "EC2.101",
    "Course Description": "This course provides a comprehensive foundation in digital systems design, starting with number systems, Boolean algebra, and fundamental logic gates. It progresses through the design and simplification of combinational circuits using Karnaugh maps, leading into the analysis and design of sequential circuits, including latches, flip-flops, and state machines. The curriculum further explores registers, counters, memory organization, and basic von Neumann processor architecture. Students will develop analytical and practical skills to design, simulate, and implement digital logic solutions, preparing them for advanced studies in microcontrollers and computer engineering.",
    "Detailed Syllabus": [
      "Unit 1: Number systems and inter conversions (binary, decimal, hexa decimal), postulates of Boolean algebra, binary logic gates, binary functions.",
      "Unit 2: Simplification of binary expressions using K-maps, logic function implementation, combinational circuits.",
      "Unit 3: Latches and flip-flops, types of flip-flops, internal circuit design and operation.",
      "Unit 4: Sequential circuits, state diagrams, state tables, state equations, applications of sequential circuits.",
      "Unit 5: Registers and counters, memory and processor architecture"
    ]
  },
  {
    "Course Title": "Digital VLSI Design",
    "Course Code": "EC2.408",
    "Course Description": "This course explores the fundamental principles and advanced practices of Digital VLSI Design. It focuses on state-of-the-art methodologies for realizing low-power, high-performance, and power-delay optimal digital circuits. The curriculum covers essential CMOS device characteristics, combinational and sequential circuit design, and the critical application of EDA tools for RTL design, logic synthesis, and simulation. Emphasis is placed on comprehensive analysis of dynamic and static power dissipation, alongside detailed examination of propagation delays and their optimization under technology scaling and process variations. Students will develop proficiency in designing, analyzing, and optimizing complex digital VLSI systems using both analytical and CAD tools.",
    "Detailed Syllabus": [
      "Unit 1: Introduction to digital design, Digital design metrics, why low power, why high performance, Power-delay optimal designs, why technology scaling, issues in state-of-the-art digital designs.",
      "Unit 2: Combinational IC design, Sequential IC design, Role of CAD tools, RTL design, Logic Synthesis, Logic Simulations, Static Timing Analysis. MOS Capacitor, Electrical Characteristics of MOS Transistors, MOS Inverter, Switching Characteristics, CMOS Realization, CMOS Complex circuits, CMOS technology scaling, CMOS Gate sizing, Layout basics, Floor Planning, Introduction to Fin FET technology.",
      "Unit 3: Digital Design - From Power perspective: Dynamic power dissipation, Switching Activity, Static i.e. Leakage Power Dissipation, Impact of technology scaling on leakage currents/power.",
      "Unit 4: Digital Design - From Performance (i.e., delay) perspective: Computing the Capacitances, Propagation delays, Factors affecting the propagation delays, Mathematical formulation of the delays in CMOS circuits, Technology scaling impact on propagation delays, Impact of process variations on delays"
    ]
  },
  {
    "Course Title": "Discrete Structures",
    "Course Code": "MA5.101",
    "Course Description": "This course introduces fundamental concepts in discrete mathematics, essential for computer science. It covers foundational topics such as sets, relations, functions, and formal logic, alongside various proof techniques including induction. Students will delve into algebraic structures like group theory, ring theory, and finite fields, exploring their applications. The curriculum also encompasses recurrence relations, basic probability theory with applications, and comprehensive graph theory. By the end, students will enhance their critical thinking, analytical reasoning, and problem-solving skills, enabling them to apply these mathematical and probabilistic concepts effectively in diverse computer science scenarios.",
    "Detailed Syllabus": [
      "Unit 1: Sets, relations, functions, permutations, combinations. Applications to relations. Logic, Propositional Equivalences, Predicates and Quantifiers Sets, Proof Techniques, Contradiction. Mathematical induction, pigeonhole principle. Cardinality of sets, finite and infinite sets, countable and uncountable sets, Cantor's numbering.",
      "Unit 2: Group, subgroup/normal subgroup, homorphism/automorphism/isomorphism/epimorphism, kemel, cosets, quotient group, product set in a group, center of a group, order/conjugate of an element, commutator. Coding theory (Application to group theory).",
      "Unit 3: Ring, Field, Finite field over a prime. Applications to finite fields.",
      "Unit 4: Recurrence relations, generating functions, numeric functions. Applications to recurrence relations.",
      "Unit 5: Basics of probability theory, birthday attacks. Applications on hash functions.",
      "Unit 6: Graphs, Adjacency, Special Graphs, Isomorphic Graphs, Paths, Cycles and Circuits, Connected Graphs, Eulerian Graphs, Hamiltonian Graphs and Planar Graphs"
    ]
  },
  {
    "Course Title": "Distributed Systems",
    "Course Code": "CS3.401",
    "Course Description": "This course provides a comprehensive exploration of distributed systems, examining their fundamental principles, communication models, and synchronization challenges. Students will delve into key topics including distributed file systems, consensus algorithms, and distributed database architectures, utilizing practical frameworks like MPI and Map-Reduce. The curriculum addresses critical limitations such as fault tolerance and the CAP Theorem, alongside advanced concepts like distributed algorithms for graphs and Blockchain. Upon completion, learners will be equipped to analyze, design, and implement resilient distributed solutions, understanding their inherent complexities and operational scope.",
    "Detailed Syllabus": [
      "Unit 1: Introduction; Communication models; Time and Synchronization; Practice: MPI/Map-Reduce.",
      "Unit 2: Distributed file systems; Practice: GFS, Chubby.",
      "Unit 3: Consensus, Agreement, Locking; Distributed Database systems; Practice: NoSQL, MongoDB.",
      "Unit 4: Limitations of distributed computing; Self-Stabilization; CAP Theorem.",
      "Unit 5: Distributed algorithms for graphs; Advanced Topics such as Blockchain, Distributed Storage, and Distributed Program Verification"
    ]
  },
  {
    "Course Title": "Earthquake Resistant Design of Masonry Structures",
    "Course Code": "CE1.607",
    "Course Description": "This course explores the fundamental principles of earthquake-resistant design for masonry structures, addressing their inherent seismic vulnerability. It meticulously examines the material properties and complex behavior of masonry under various actions, including compression, tension, shear, and bending, especially under seismic loading. Students will analyze common failure modes observed in past earthquakes and understand codal provisions for seismic safety. The curriculum covers the design of strengthening components and delves into advanced techniques for assessing the seismic safety of existing masonry buildings, equipping students to recommend and implement effective retrofit measures.",
    "Detailed Syllabus": [
      "Unit 1: Introduction to masonry, Masonry buildings in India, Material properties, Masonry units, Manufacturing process, Mortar, Grout, and reinforcement; Masonry assemblages, Masonry systems, Various tests, and standards.",
      "Unit 2: Masonry under compression: Prism strength, Failure mechanism, types of construction and bonds, Eccentric loading, Slenderness effective length and effective height, effect of openings, Code provisions, masonry in tension, flexural strength of masonry, shear and bending capacity of masonry.",
      "Unit 3: Behavior of masonry structures during past earthquakes: Common modes of failures, effect of roof and floor systems, Masonry under lateral loads: In-plane and out-of-plane loads, bending parallel and perpendicular to bed joints, Shear and flexure behavior of piers, Test and standards, lateral force distribution for flexible and rigid diaphragms, Combined axial and bending actions.",
      "Unit 4: Earthquake Resistant Measures: Analysis for earthquake forces, role of floor and roof diaphragm, Pier analysis using equivalent stiffness approach, Concept and design of bands, splints and bandages, Vertical reinforcement at corners and jambs, Code provisions.",
      "Unit 5: Retrofitting of masonry building: Techniques of repair and retrofitting of masonry buildings, IS: 13935 provisions for retrofitting, different strengthening methodologies and techniques"
    ]
  },
  {
    "Course Title": "Electronic Workshop-1",
    "Course Code": "EC2.102",
    "Course Description": "This foundational course in practical electronics provides hands-on experience with essential lab equipment and electronic components. Students will engage in designing, implementing, and analyzing both analog and digital circuits on breadboards. The curriculum progresses to circuit simulation using industry-standard software like Multisim, followed by mastering practical soldering techniques for permanent circuit assembly. A significant focus is placed on understanding software-hardware interfaces through controller board integration. This course equips students with comprehensive skills to design, simulate, build, and verify functional electronic systems.",
    "Detailed Syllabus": [
      "1. Know your equipment and components - Lab Equipment and components familiarization such as Power supply, Signal Generator, Oscilloscope, Breadboard, Transistor, Resistor etc...",
      "2. Design, Implementation and Analysis - Implement circuits such as Voltage Regulator record, analyse and interpret the results.",
      "3. Electronic Circuit Design Simulation Software - Learning to install and use Multisim. Design one of the earlier experiments on Multisim and compare hardware and simulation results.",
      "4. The Art of Soldering - Solder one of the implemented circuits now on a general-purpose PCB/Vector Board, record results, compare with the previous implementation on the bread board.",
      "5. Hardware Software Symbiosis - Use of controller boards to interface with electronic circuits and actuators, showcase the need for software-hardware interplay"
    ]
  },
  {
    "Course Title": "Embedded Systems Workshop",
    "Course Code": "EC3.202",
    "Course Description": "This workshop delves into the practical design and implementation of embedded systems within an Internet of Things (IoT) framework. It systematically covers sensor/actuator interfacing, microcontroller programming, and diverse communication protocols like Zigbee, WiFi, and MQTT. Students will explore embedded system architectures, cloud-based data storage, and essential considerations for data privacy, security, and interoperability. The curriculum further encompasses PCB design, mechanical enclosure fabrication, and data visualization techniques. Upon completion, participants will possess the skills to develop, assess, and fabricate functional IoT solutions for complex, real-life applications.",
    "Detailed Syllabus": [
      "1. Sensing/Actuators and Interfacing: Sensor/Actuator selection, Physics of sensors, Interfacing (Serial interfaces, Analog out, SPI, UART, I2C).",
      "2. Controller, Embedded Systems and Peripherals: Platform selection (ATMEL328, ESP32, STM8), Embedded Systems (power management, interrupts, memory managements, OTA), Peripherals (RTC, ADC channels).",
      "3. Communications, Networking and IoT Architecture: Different IoT communication protocols (Zigbee/WiFi/BLE/4G/5G/eSim/LoRaWAN), Data Protocols (MQTT/HTTPS/COAP).",
      "4. Data Storage and Computation: Cloud storage and computing, Data retrieval optimization, IoT standards for interoperability.",
      "5. PCB and Enclosure Design.",
      "6. Data privacy and security.",
      "7. Dashboard and Visualization: Software/Approaches (UI/UX, Time Series Data Visualization).",
      "8. Documentation"
    ]
  },
  {
    "Course Title": "Entropy and Information",
    "Course Code": "CS1.407",
    "Course Description": "This course delves into the foundational principles of Information Theory, exploring concepts such as entropy, mutual information, and their role in quantifying uncertainty. It systematically examines stochastic processes, including Markov chains and random walks, and applies these principles to critical areas like data compression and channel capacity. The curriculum covers the construction of optimal codes and the determination of channel limits. Furthermore, students will synthesize proofs of fundamental theorems and investigate advanced topics like differential entropy and maximum entropy. The course culminates in the ability to analyze communication systems and design robust communication models, preparing students for practical applications in communication theory.",
    "Detailed Syllabus": [
      "1. ENTROPY CONCEPT IN PROBABILITY THEORY: Entropy of Finite Schemes, Joint Entropy and Conditional Entropy, Relative Entropy and Mutual Information, Chain Rules, The Uniqueness Theorem, Jensen's Inequality, Log Sum Inequality, Data Processing Inequalities, Sufficient Statistics, Fano's Inequality.",
      "2. PROBABILITY MEASURE AND ASYMPTOTIC EQUIPARTION PROPERTY: Probability as a measure, Law of Large Number, Asymptotic Equipartition Theorem (AEP), Data Compression, Typical Sets.",
      "3. ENTROPY RATES OF A STOCHASTIC PROCESS: Entropy of Markov Chains, Entropy Rate, Entropy Rate of a random walk on a weighted graph, Hidden Markov Models, Fundamental Theorems.",
      "4. DATA COMPRESSION: Kraft Inequality, Optimal Codes, Bound on the optimal code length, Kraft inequality for Uniquely Decodable Codes, Huffman Codes, Optimality of Huffman code.",
      "5. CHANNEL CAPACITY: Examples of Channel Capacity, Symmetric Channels, Properties of Channel Capacity, Joint Typical Sequence, Channel Coding theorem, Zero Error Codes, Fano's Inequality, Feedback Capacity.",
      "6. DIFFERENTIAL ENTROPY MAXIMUM ENTROPY AND SPECTRAL ESTIMATION: Definition, AEP for Continuous Random Variable, Relation of Differential Entropy to Discrete Entropy, Joint and Conditional Entropy, Relative Entropy and Mutual Information, Maximum Entropy distributions, Anomalous Maximum Entropy Problem, Spectrum Estimation"
    ]
  },
  {
    "Course Title": "Environmental Science and Technology",
    "Course Code": "CS9.428",
    "Course Description": "This course provides a comprehensive exploration of environmental science and technology, addressing pressing global challenges such as climate change, degradation, and resource management. It synthesizes foundational environmental issues with advanced technological applications, including geospatial analysis, carbon sequestration methods, and green IT solutions. The curriculum also delves into crucial assessment frameworks like Environmental Impact Assessment and green accounting principles. Students will gain the capacity to evaluate diverse environmental technologies, integrate digital solutions for problem-solving, and develop a robust understanding of environmental ethics and legislative frameworks, fostering informed and responsible environmental stewardship.",
    "Detailed Syllabus": [
      "Unit-1: Basics of Environmental Science & Technology: Comprehend environment and its issues, Environmental problems and challenges, Environmental Events.",
      "Unit-2: Earth components; Climate Change: Climate system, Climate feedback loops, Climate Models, Climate impact on environment; Global Catastrophes, unexpected climate changes.",
      "Unit-3: Role of geospatial technology in assessing environmental degradation.",
      "Unit-4: Carbon sequestration methods - vegetation, ocean and geological sequestration, IPCC, Clean Development Mechanisms, CO2, Environmental Stress - Mitigation: Impact on vegetation.",
      "Unit-5: Environmental Impact Assessment: Procedure, regulations and case studies.",
      "Unit-6: Environment and Information technology: green computation, green energy, Green Engineering and technology, e-waste-disposal mechanism - impact on health.",
      "Unit-7: Green accounting- Evolution of process, history, case studies, Accounting of goods and Services, Sustainability concepts.",
      "Unit-8: Environmental movements.",
      "Unit-9: Environmental Legislation & Impact Assessment: Important legislations related to Environment; Environmental Auditing; Environmental Ethics"
    ]
  },
  {
    "Course Title": "Fairness, Privacy and Ethics in Al",
    "Course Code": "CS7.504",
    "Course Description": "This course critically examines fairness, privacy, and ethical considerations in AI systems. Students will investigate sources of algorithmic bias, exploring diverse notions of individual fairness (e.g., envy-freeness) and group fairness (e.g., equalized odds). The curriculum synthesizes algorithms to mitigate discrimination, addressing the complexities of achieving equitable AI. Additionally, it tackles data privacy challenges, covering potential attacks on machine learning models. Practical techniques like differential privacy (e.g., Laplace, Gaussian mechanisms) are applied to ensure robust individual privacy, fostering transparency and responsible AI development.",
    "Detailed Syllabus": [
      "Unit 1: Bias in the data, causality, Individual fairness vs group fairness.",
      "Unit 2: Individual fairness: envy freeness, max-min share, proportionality. Algorithms to achieve them such as round robin, cycle elimination, etc.",
      "Unit 3: Impossibility of fair classifier with perfect calibration.",
      "Unit 4: Group fairness (equalized odds, disparate impact, accuracy parity, predictive parity). Different preprocessing, post processing techniques and over all approach to build Al to mitigate discrimination.",
      "Unit 5: Differential Privacy (DP), Need for newer privacy measures, especially when federated learning is on rise. Possible attacks even data is anonymized.",
      "Unit 6: Techniques such as Laplace mechanism, gaussian mechanism, local DP, Bayesian DP"
    ]
  },
  {
    "Course Title": "Finite Element Method",
    "Course Code": "CE4.501",
    "Course Description": "This course offers a foundational understanding of the Finite Element Method (FEM), beginning with core principles and approximate solution techniques for boundary value problems. It systematically covers the formulation and application of FEM to one-dimensional scenarios, including structural elements like bars, beams, and trusses. The curriculum advances to two-dimensional problems, exploring triangular, quadrilateral, and isoparametric elements, coupled with essential numerical integration methods. Students will gain proficiency in formulating, solving, and analyzing complex structural and elasticity problems using finite element techniques.",
    "Detailed Syllabus": [
      "Module 1: Introduction to finite element method (FEM): Need for FEM, General finite element solution procedure, Boundary value problems: types of boundary conditions, Approximate solution to boundary value problems: Method of weighted residuals.",
      "Module 2: General one-dimensional (1D) boundary value problem and its applications: Axial deformation of bars: Approximate solution using Rayleigh-Ritz method, Galerkin method, Axial Spring element. Applications: One-dimensional heat flow, Column buckling. Higher order elements for 1D problems.",
      "Module 3: Beams, Frames and Trusses: Beam bending-governing differential equation, Two node beam element, Analysis of structural frames-Plane frame element, space frame element, Introduction to truss analysis.",
      "Module 4: 2D boundary value problems: triangular elements, isoparametric quadrilateral elements, Isoparametric mapping for quadrilateral elements, Numerical integration for quadrilateral elements, Four node quadrilateral element for 2D BVP, Eight node serendipity element. Isoparametric triangular elements.",
      "Module 5: Applications based on general 2D boundary value problem: Torsion of prismatic bars. 2D elasticity-Governing differential equations, Constant strain triangular element, Four node quadrilateral element, Eight node isoparametric element. Constitutive equations, governing differential equations, stress equilibrium equations, finite element equations for plane stress and plane strain conditions.",
      "Module 6: Numerical integration-Newton-Cotes rules, Trapezium rule, Simpson's rule, Error term, Gauss-Legendre rules, Gauss-Leguerre rule, Numerical integration for quadrilateral elements, Numerical integration for triangular elements"
    ]
  },
  {
    "Course Title": "Foundations for Signal Processing and Communication",
    "Course Code": "EC5.412",
    "Course Description": "This course establishes a rigorous mathematical foundation for understanding and designing signal processing and communication systems. It systematically explores probability theory, random variables, and stochastic processes, applying these to analyze communication channels and noise. Further, it delves into abstract algebra and linear algebra, covering vector spaces, linear transformations, Fourier analysis, and their applications in signal representation and system analysis. Students will develop critical thinking and problem-solving skills, enabling them to apply these mathematical tools to complex problems and conduct foundational research in communication and signal processing.",
    "Detailed Syllabus": [
      "Module 1: Rigorous Math Part: Probability Axioms, Random Variables and their distributions (CDF, PDF, PMF), Some Important Distributions, Joint and Conditional Distributions, Distributions of functions of Random Variables, Expectation of RVs and their functions; SPCOM Part: Random quantities in SPCOM, Notion of Communication Channel, Hypothesis testing, Simple Detection and Estimation problems in Signal Engineering.",
      "Module 2: Rigorous Math Part: Concentration inequalities (Markov, Chebyshev, Chernoff), Central Limit Theorem, Mean vector and covariance matrix, Joint Gaussian Distribution, Random Processes; SPCOM Part: Discrete Memoryless Channels and Notion of Channel Capacity, Gaussian Noise, Wireless Channel.",
      "Module 3: Sets with structure; Rigorous Math Part: Groups, Rings, Fields, Vector spaces, Inner Product on Vector Spaces; SPCOM part: The Vector Space of Finite Energy Continuous Signals, Vector Space of Sampled Signals, Vector Space of discrete-time quantized signals, Distinguishing features of Digital Signal Processing and Communication.",
      "Module 4: Rigorous Math part: Linear Independence/dependence, Span, Column space and row space of matrices, Basis and Dimension of subspaces, Basis Extension Theorem, Rank of a matrix, Change of Basis; SPCOM part: Fourier Series of L_2 signals as representation of signals using Fourier basis, Finite dimensionality of bounded-time, bounded-bandwidth L_2 signals, standard basis for Discrete-time signals, Standard Basis for Finite-field Signals, Discrete Fourier Transform as Change of Basis.",
      "Module 5: Rigorous Math Part: Linear Transformations between vector spaces and their associated Matrices, Eigen Values and Vectors, Triangularization, Diagonalization, SVD; SPCOM part: Continuous-time and Discrete-Time LTI systems and their Transfer Functions, Role of linear transformations in coding theory for forward-error correction, Do Estimation, MIMO Wireless Communication"
    ]
  },
  {
    "Course Title": "Gender and Society",
    "Course Code": "HS8.201",
    "Course Description": "This course delves into the foundational theories and practices of gender studies, examining its multifaceted construction within socio-cultural contexts. Students will analyze core concepts such as gender, sex, and diverse sexualities, alongside frameworks of power, ideology, patriarchy, and intersectionality. The curriculum traces the evolution of feminist movements and critically examines how gender is established, represented, and potentially disrupted through literary works and popular cinema. Ultimately, the course fosters a critical understanding of gender relations, empowering students to challenge preconceived notions and engage informedly with societal roles and cultural formations.",
    "Detailed Syllabus": [
      "Unit 1: Core concepts and terms: Differences between terms like Gender, Sex, Normative and Non-normative sexuality, Trans-bodies.",
      "Unit 2: Power, Ideology and Intersectionality's: Concepts of Power, Ideology, Patriarchy, and Privilege. What are intersectionality's, and why is it important to study them when we study gender?",
      "Unit 3: Feminist Movements: Rights struggles, Gains and losses, women in the workplace, Women in India.",
      "Unit 4: Representation of Gender: Who writes women? Short Stories on, about, and by women.",
      "Unit 5: Popular representations of women in cinema. How does popular visual culture shape gender politics?"
    ]
  },
  {
    "Course Title": "Geospatial Technology for Disaster Risk Modelling",
    "Course Code": "TBD",
    "Course Description": "This course provides a comprehensive exploration of geospatial technology for disaster risk modelling. It integrates principles of remote sensing and GIS to address disaster risk reduction and management across diverse contexts. Students will analyze specific disaster phenomena, including floods, droughts, forest fires, and landslides, focusing on their monitoring, assessment, and vulnerability modelling through space-based data. The curriculum emphasizes practical skills in processing remotely sensed data, understanding existing early warning systems, and identifying applications of AI/ML. Graduates will be equipped to contribute to evidence-based decision support for disaster management and resilience building.",
    "Detailed Syllabus": [
      "Unit-1: Introduction to disasters overview, perspectives, national/international frameworks, conceptual approach to disaster risk reduction and management using geospatial technology.",
      "Unit-2: Flood risk and impact; Introduction to floods; Remote sensing of floods; Flood risk and vulnerability modelling and assessment.",
      "Unit-3: Drought; Introduction to drought; Role of remote sensing in drought monitoring; Drought assessment and modelling.",
      "Unit-4: Forest fires & open biomass burning; Introduction to fires; Remote sensing of fires; Introduction to 'fire danger rating' (early warning system) modelling; Artificial Intelligence for fire monitoring and management.",
      "Unit-5: Landslides; Introduction to landslides; Remote sensing applications for Identification of landslide, classification and post-event analysis; Monitoring of landslides; Landslide susceptibility and hazard assessment"
    ]
  },
  {
    "Course Title": "Human-Computer Interaction",
    "Course Code": "PD1.501",
    "Course Description": "This course explores the foundational principles of Human-Computer Interaction (HCI), examining its profound influence on the user experience of digital products. It delves into human-machine systems, cognitive models, and the Human-Action Cycle, integrating key UX and UI design principles, including Gestalt theory, information architecture, and prototyping. Emphasizing a user-centered approach, the curriculum covers persona development, task analysis, and design workflows. Students will gain the ability to create useful and intuitive digital solutions, alongside competently planning, executing, and reporting on comprehensive usability testing to refine product designs.",
    "Detailed Syllabus": [
      "UNIT 1. Introduction to Human-Computer Interaction: Introduction to HCI?; History of HCI; How Human interact with outside world?; Human Conceptual/Mental models; Conflict between Mental Models and Design Models.",
      "UNIT 2. UNDERSTANDING Human-Machine System: Understanding Human-Machine System; Human-Action Cycle (HAC); 7stagesofHuman-action cycle; User Experience.",
      "UNIT 3. Art and Science of User Experience and UI Design: Aaention and Memory; Gestalt theory and principles; UI Elements including colour and interaction model; Information and Interaction Design principles.",
      "UNIT 4. User-Centered approach to the Solware Design: Perceived Usefulness and perceived Ease of Use; Understanding User Persona; Why user person is important; Use cases, User stories; Task Flows & Task Analysis; Human-centeredsoRware Design Workflow.",
      "UNIT 5. User Experience and UI Design: Information Architecture; Wireframes and Storyboards; Low and High-Fidelity prototypes.",
      "UNIT 6. Usability Engineering and Testing: What is Usability, usability requirements and how to measure it?; Heuristics evaluation; Usability Test planning and conducting usability test; Usability matrix and test reporting.",
      "UNIT 7. Usability Engineering and Testing: Short term project; Project completion, documentation and submission"
    ]
  },
  {
    "Course Title": "Human Sciences Lab",
    "Course Code": "HS7.101",
    "Course Description": "The Human Sciences Lab offers an intensive exploration into the application of computational methods for social science research. Students will engage with diverse datasets, from textual corpora like social media and news articles to electoral statistics, employing techniques such as Bag of Words and statistical correlation. This involves hands-on practice in data acquisition, interpretation, and critical analysis. The course develops proficiency in leveraging computational tools while fostering the critical application of social theory to interpret findings, enabling students to discern both the potential and inherent limitations of these methodologies.",
    "Detailed Syllabus": [
      "Unit 1: Bag of Words exercise, followed by analysis of the results.",
      "Unit 2: Identification and interpretation of correlations in social data. Statistical analysis, followed by study of the historical/sociological/political context.",
      "Unit 3: Crawling of tweets, followed by an analysis of the results from a social science perspective.",
      "Unit 4: Scraping of newspaper articles, followed by an analysis of the results from a social science perspective.",
      "Unit 5: Working with Political Data: Extracting electoral data from various sites, followed by an analysis of the results from a social science perspective"
    ]
  },
  {
    "Course Title": "Hydrological Modeling and Software Development",
    "Course Code": "CE5.502",
    "Course Description": "This course delves into hydrological modeling, emphasizing the integration of computational techniques for advanced water resource management. It covers foundational principles, including fluid mechanics, hydrology, statistical analysis, and optimization methods. The curriculum then progresses to complex systems, exploring river basin and urban hydrology, water quality modeling, and management strategies for floods, droughts, and climate change impacts. Students will gain practical experience with open-source public domain software and decision support systems. The course culminates in developing computational algorithms and tools to analyze, predict, and formulate optimal, real-time solutions for diverse water-related challenges.",
    "Detailed Syllabus": [
      "Introduction: fundamentals of fluid mechanics and open channel flows; hydrology, rainfall and runoff processes and hydro-climatology, statistical analysis, optimization methods. Water Resources Systems: river basin and urban hydrology, river water quality modelling, flood and drought management, irrigation and reservoir operation and climate change. Technologies and Software: Open-source public domain software based on Microsoft Windows environment: US Environmental Protection Agency's Qual2k; MATLAB Tools: Air2stream; Windows based decision support systems. Development and Application of Software: Real-world applications at various scales for water resources management"
    ]
  },
  {
    "Course Title": "Information Retrieval and Extraction",
    "Course Code": "CS4.406",
    "Course Description": "This course delves into the fundamental principles and advanced techniques of Information Retrieval (IR) and Extraction. It covers various IR models, evaluation methodologies, and the unique challenges of Web Information Retrieval, including crawling strategies. Students will explore the integration of Natural Language Processing and Machine Learning approaches to enhance retrieval efficacy and develop robust information extraction systems. Practical application is emphasized, enabling students to design algorithms, architect comprehensive IR systems for the web, and effectively process unstructured and noisy data from diverse repositories.",
    "Detailed Syllabus": [
      "Unit 1: Introduction to Information retrieval, Information Extraction and Information Access systems.",
      "Unit 2: Information Retrieval Models and Evaluation of IR systems.",
      "Unit 3: Web Information Retrieval.",
      "Unit 4: Natural Language Processing in IR.",
      "Unit 5: Machine Learning in Information Retrieval Systems.",
      "Unit 6: Information Extraction.",
      "Unit 7: IR Applications"
    ]
  },
  {
    "Course Title": "Information Theory",
    "Course Code": "EC5.410",
    "Course Description": "This course explores Information Theory, foundational for data compression and reliable communication. It covers essential concepts like entropy, mutual information, and the Asymptotic Equipartition Property, applying them to source coding techniques such as Huffman and Lempel-Ziv. The curriculum advances to channel capacity, Shannon's coding theorems, and modern codes like Polar Codes. Students will analyze communication channels and employ information-theoretic arguments for converse proofs in areas including private information retrieval and data exchange. This equips them to analyze system capacities, design efficient compression, and construct rigorous proofs for advanced communication and data challenges.",
    "Detailed Syllabus": [
      "Unit 1: Random Variables as Signals at Source and Receivers, Source Coding Entropy and its properties, Relative entropy, Mutual information, Huffman codes and optimality, Asymptotic Equipartition Property and Typical set-based source coding.",
      "Unit 2: Channel coding - Channel capacity motivation and definition, Discrete memoryless channel, Channel coding theorem for DMC- achievability and converse, Differential Entropy, Guassian Channel Capacity.",
      "Unit 3: Polar Codes as Efficient Capacity Achieving Codes for DMCS.",
      "Unit 4: Converse Results using Information Theoretic Arguments: Private Information Retrieval, Data Exchange between Nodes, DNA Storage, Adversarial Channels"
    ]
  },
  {
    "Course Title": "Intro to Cognitive Science",
    "Course Code": "CG1.402",
    "Course Description": "This course provides a foundational introduction to Cognitive Science, an interdisciplinary field investigating the nature of mind and intelligence. Students will explore its historical evolution, empirical methodologies, and core domains including sensation, perception, attention, memory, language, learning, and knowledge representation. The curriculum also delves into complex topics like consciousness and special areas bridging neuroscience, philosophy, and artificial intelligence. Emphasizing critical analysis, the course equips students to evaluate research design, identify communication flaws in scientific findings, and articulate well-informed perspectives on ongoing scientific debates.",
    "Detailed Syllabus": [
      "Introduction; Evolution of Cognitive Science; A free-form discussion on consciousness; Empirical approaches in cognitive science; Brain: Organization; Intro to sensation and perception; Sensory systems; Perception and Perceptual Learning, Cross-modal interactions; Vision; Attention; Learning; Development; Memory; Language and Cognition; Knowledge Representation; Special topics: e.g. Music, mind, and technology; Several debate sessions with student debate teams"
    ]
  },
  {
    "Course Title": "Introduction to Psychology",
    "Course Code": "HS2.202",
    "Course Description": "This course provides a comprehensive introduction to the scientific study of psychology, exploring its historical foundations and diverse methodologies. It delves into core domains such as neuroscience, emotion, personality, social cognition, learning, and life-span development. The curriculum also addresses psychological health and intervention strategies. Students will analyze psychological phenomena through various perspectives, understand research ethics, and apply evidence-based knowledge to develop critical thinking and foster personal and professional effectiveness.",
    "Detailed Syllabus": [
      "Unit 1: Introduction - Psychology as a Science, Goals of Psychology, History of Psychology.",
      "Unit 2: Methods - Research methods for psychological observations.",
      "Unit 3: Health & Psychology - Psychological health and disorders, Neuroscience and behaviour, Emotion.",
      "Unit 4: Social & Personality - Social, Psychological interventions and treatments, Personality.",
      "Unit 5: Cognitive - Attention, Gender, Memory.",
      "Unit 6: Learning & Development - Learning, Perception, Life-span development, Intelligence"
    ]
  },
  {
    "Course Title": "Introduction to Biology",
    "Course Code": "SC3.101",
    "Course Description": "This course provides a comprehensive introduction to fundamental biological principles, starting with the cellular and chemical foundations of life, including biomolecular structures and functions. It progresses to explore bioenergetics, metabolism, and the physical principles governing cellular processes. The curriculum then delves into genetic foundations, covering DNA, gene expression, replication, and evolutionary mechanisms. Students will also investigate cell signaling, DNA manipulation techniques, and the computational challenges in modern biology, preparing them to analyze complex biological information and apply interdisciplinary approaches.",
    "Detailed Syllabus": [
      "Unit 1: Cellular foundations: Cell organelles, Membranes and cellular compartments, Tree of life.",
      "Unit 2: Chemical foundations: Biomolecules, Structure and function.",
      "Unit 3: Physical foundations: Bioenergetics, Catalysis, Enzymes, Photosynthesis, Respiration.",
      "Unit 4: How cells obtain energy from the food - metabolism.",
      "Unit 5: Genetic foundations: DNA, Genes, chromosomes, Genomes, Mutations.",
      "Unit 6: Evolutionary foundations, Systematics.",
      "Unit 7: DNA Replication, Repair, and Recombination - an overview.",
      "Unit 8: How Cells Read the Genome: From DNA to Protein.",
      "Unit 9: Control of Gene expression.",
      "Unit 10: Cell Signaling, Cell cycle.",
      "Unit 11: Analyzing and manipulating DNA.",
      "Unit 12: Introduction to sequencing and computational challenges"
    ]
  },
  {
    "Course Title": "Introduction to Economics",
    "Course Code": "HS5.202",
    "Course Description": "This course provides a foundational understanding of economics, exploring its diverse definitions and the historical evolution of major schools of thought, including Neoclassical, Marxist, and Keynesian. Students will delve into core microeconomic principles of decision-making and market structures, alongside macroeconomic theories encompassing aggregate demand, supply, inflation, and fiscal policy. The curriculum also introduces international trade dynamics and exchange rate determination. Emphasizing distinct economic conditions in developing nations, the course explores economics' interdisciplinary connections, preparing students to analyze complex social phenomena and inform relevant policy interventions.",
    "Detailed Syllabus": [
      "1. ‘Ways of doing economics: Different views on scope and definition of economics. Alternative schools of economic thought- Neoclassical, Marxist, Keynesian.",
      "2. Theoretical foundations of microeconomics: Agent based understanding of decision making individuals and firms. Market structure and game theory. Welfare economics, Information economics.",
      "3. Theoretical foundations of macroeconomics: Macroeconomic measurement. Aggregate demand, aggregate supply and determination of output. Inflation and Unemployment, Monetary and Fiscal Policy. Banking and the role of finance in the economy.",
      "4. Introduction to the open economy: Basic trade theory- absolute advantage, comparative advantage, Heckscher-Ohlin Model. Exchange rate determination. External accounts of an economy.",
      "5. Interdisciplinary engagements with economics: Economics and psychology. Economics and computational science, economics and climate science"
    ]
  },
  {
    "Course Title": "Introduction to Film Studies",
    "Course Code": "HS1.208",
    "Course Description": "This course provides a foundational exploration of film studies, introducing core analytical concepts like mise-en-scène, cinematography, editing, sound, and narrative. It delves into fundamental theoretical conversations on medium specificity, realism, and film phenomenology, including historical perspectives such as the Soviet School and digital cinema. The curriculum also examines influential global cinema movements, including German Expressionism, New Wave, and Noir. Students will develop a comprehensive understanding of cinema as a complex artistic medium, industrial practice, and cultural phenomenon, fostering critical interpretation of its role in art and politics.",
    "Detailed Syllabus": [
      "Unit 1: Basic terms of analysis and interpretation. Misѐ-en-Scѐne, Cinematography, Editing, Sound, Narrative, Genre.",
      "Unit 2: Fundamental conversations on medium specificity, Realism in Cinema, Phenomenology of film, the Soviet School, Digital Cinema.",
      "Unit 3: Introduction to cinema movements. May include – German Expressionism, New Wave/s, Noir, Indian art film movement"
    ]
  },
  {
    "Course Title": "Introduction to History",
    "Course Code": "HS3.201",
    "Course Description": "This course provides a comprehensive introduction to the discipline of History, exploring its foundational concepts and methodologies. Students will investigate how historians understand time and space, critically examining the nature of historical facts and the ongoing debate surrounding objectivity. The curriculum covers major theoretical models of historical interpretation and various analytical methods, including source criticism, inductive/deductive reasoning, and qualitative/quantitative approaches. Additionally, it offers insights into memory studies, heritage, and public history. Through this engagement, students will develop the capacity to analyze historical narratives, evaluate methodologies, assess primary evidence, and formulate a nuanced understanding of the past.",
    "Detailed Syllabus": [
      "(1) Historical Time and Space: In this module students will be introduced to how historians have understood the flow of time and periodised time into historical ages.",
      "(2) Historical Fact and Objectivity: This module will define the historical fact, the different interpretations of what a fact is, and the debate among historians relating to historical objectivity.",
      "(3) The Main Theories of History: In this module students will be exposed to the main theoretical models of historical interpretation.",
      "(4) The Main Methods of Historical Analysis: This module will focus on source criticism, the advantages and limitation of the inductive and deductive methods, oral history, qualitative and quantitative methods.",
      "(5) Memory, heritage and public history: This module will provide students brief introductions to the fields of memory studies, heritage studies and public history"
    ]
  },
  {
    "Course Title": "Introduction to Linguistics 1",
    "Course Code": "CL1.101",
    "Course Description": "This course introduces the scientific study of human language, exploring its fundamental and unique characteristics. Students investigate core linguistic levels, including phonetics, phonology, morphology, and syntax, from both synchronic and diachronic perspectives. The curriculum further examines broader areas like sociolinguistics, language acquisition, historical linguistics, writing systems, and the Paninian grammatical tradition. Through theoretical frameworks and practical data analysis, students develop a robust understanding of linguistic analysis, preparing them to explore diverse languages and contribute to text processing applications.",
    "Detailed Syllabus": [
      "1. What is language? Difference between human language and Animal languages. Natural language, Formal language and Artificial language, Characteristic features of human language, what we know about language.",
      "2. Study of Human language – the field of Linguistics.",
      "3. Looking at language from synchronic and diachronic points of view.",
      "4. Areas of Study from structural perspective: a) Syntagmatic and paradigmatic aspects of language structure; b) Levels of structural analysis: Phonetics, Phonology, Morphology, Syntax; c) From evolution perspective: Historical Linguistics; d) From usage perspective: Sociolinguistics; e) From Psychological perspective: Mechanisms of language acquisition; f) Indian Grammatical Tradition: Paninian grammatical model; g) Writing Systems"
    ]
  },
  {
    "Course Title": "Introduction to Neural and Cognitive Modeling",
    "Course Code": "CG3.401",
    "Course Description": "This course introduces the foundational principles and applications of neural and cognitive modeling, exploring how mathematical and computational methods illuminate brain function. Topics range from single-neuron biophysical models (e.g., Hodgkin-Huxley, LIF) and network-level dynamics like population coding and neuroplasticity, to abstract models of higher cognitive functions such as perception, memory, and language, alongside various learning rules. Students will analyze, evaluate, and design computational solutions for neuroscience problems, developing a critical understanding of these models' strengths and limitations in explaining brain, mind, and behavior, fostering functional and practical insights.",
    "Detailed Syllabus": [
      "Part I: Single-Neuron Level Models: Introduction to Neuroscience; Passive membrane models, Leaky Integrate and Fire (LIF) models, Hodgkin-Huxley model, Cable models of dendrites, Synapse model, Compartmental models.",
      "Part II: Network Level Models: Neural population codes; information representation; neural encoding and decoding; hierarchy and organization of sensory systems; Spiking Network models of sensory systems; Neuroplasticity and learning.",
      "Part III: Abstract Models: Introduction to Hebbian, Competitive and Error-driven learning rules; Reinforcement learning, Neural Network models of Perception, Attention, Memory, Language and Executive Function"
    ]
  },
  {
    "Course Title": "Introduction to Philosophy",
    "Course Code": "HS0.214",
    "Course Description": "This course introduces students to the nature and scope of philosophical inquiry as a rational, second-order discipline. It critically examines core epistemological questions concerning knowledge validity and its sources through thinkers like Descartes, Hume, and Kant. Subsequently, the curriculum explores distinct approaches to human existence and consciousness via Existentialism (Nietzsche, Sartre) and Phenomenology (Husserl, Heidegger). The course then delves into Hermeneutics, investigating interpretation and narrative identity. Students will develop sophisticated analytical skills to distinguish objective and subjective knowledge, analyze self-understanding, and critically evaluate diverse perspectives on belief formation.",
    "Detailed Syllabus": [
      "Unit 1: Nature and the Scope of Philosophy: Philosophy as a Rational Inquiry, Second-order discipline, Phronesis and the Good Life (Aristotle).",
      "Unit 2: Epistemology: Impression and Ideas (David Hume), Cogito Ergo Sum (Descartes), Transcendental Aesthetic and Categories (Kant).",
      "Unit 3: Existentialism: Übermensch and Eternal Recurrence of the Same (Nietzsche), Bad Faith and Authenticity (Sartre).",
      "Unit 4: Phenomenology: Intentionality and Horizon (Edmund Husserl); Ready-to-hand and Disclosure (Martin Heidegger).",
      "Unit 5: Hermeneutics: Hermeneutical Circle (Gadamer); Narrative Identity (Paul Ricouer)"
    ]
  },
  {
    "Course Title": "Introduction to Politics",
    "Course Code": "HS4.201",
    "Course Description": "This course introduces students to the fundamental concepts and foundational theories of Political Science. It defines politics, the state, and governmental forms, then delves into core political concepts such as liberty, equality, justice, rights, and democracy. A significant portion examines the structure, functions, and philosophical underpinnings of the Indian Constitution, its democratic institutions (Parliament, Executive, Judiciary), federalism, secularism, and the electoral process. Students will develop a critical understanding of political systems, particularly in India, enabling them to analyze contemporary challenges and formulate policy perspectives for reforms within the Indian political system.",
    "Detailed Syllabus": [
      "Module 1: Introduction to various perspectives on how we define politics and its domain; Nature and scope of Political Science as a field of knowledge; Meaning and origin of State: divine theory and social contract theory; Forms and functions of government.",
      "Module 2: Brief introduction to key concepts of Political Science; Liberty: Negative and Positive; Equality: Equality of Opportunity; Justice: Social Justice; Rights: Legal Rights and Human Rights; Democracy: Idea and Practice.",
      "Module 3: Philosophy and features of Indian constitution, Structure and functions of Parliament (Legislature), Prime Minister and his cabinet (Executive), Supreme Court of India (Judiciary); Balance of Power.",
      "Module 4: Structure and functioning of federalism in India; centre-state relations; Meaning and interpretation of secularism in the Indian context; Provisions for unity in diversity.",
      "Module 5: History and Features of Party system in India; National Parties and State Parties; Trends in the Party System; Electoral Process, Election Commission, Contemporary Challenges and Reforms"
    ]
  },
  {
    "Course Title": "Introduction to Quantum Field Theory",
    "Course Code": "SC1.421",
    "Course Description": "This course provides a rigorous introduction to Quantum Field Theory, exploring the motivations behind describing nature through quantum fields rather than wave functions. It covers elements of classical field theory, symmetries, and Noether's theorem, then transitions to functional quantization, path integrals, and Feynman diagrams for scalar and Dirac fields. Students will learn the S-matrix formalism, how to calculate scattering cross-sections, and delve into Quantum Electrodynamics (QED). The course aims to equip students with the ability to apply second quantization techniques and calculate transition amplitudes for fundamental physical processes.",
    "Detailed Syllabus": [
      "Unit 1: Introduction: review of backgrounds, motivations for QFT.",
      "Unit 2: Elements of Classical Field Theory: symmetries and No ether's theorem.",
      "Unit 3: Functional Formalism: path integral formalism, functional quantization, Feynman diagrams, quantization of scalar field, phi-4 theory.",
      "Unit 4: S-matrix: scattering cross-section and decay rates, from Feynman diagrams to S-matrix.",
      "Unit 5: Dirac Field: Dirac equation and its solutions, gamma matrices, quantization, Green's function.",
      "Unit 6 Quantum Electrodynamics (QED): Feynman rules for QED, cross-section of simple QED processes.",
      "Unit 7 Introduction to Renormalization"
    ]
  },
  {
    "Course Title": "Introduction to Remote Sensing",
    "Course Code": "CS9.440",
    "Course Description": "This course provides a foundational understanding of remote sensing, focusing on the acquisition and analysis of Earth observation data. Students will explore the physics of electromagnetic radiation and its interaction with Earth materials, critical for understanding optical remote sensing processes. The curriculum covers data acquisition, sensor characteristics, pre-processing, and image enhancement. Emphasis is placed on both conventional and advanced computational methods for information extraction, including multispectral and object-based classifications. The course concludes by discussing diverse applications in environmental monitoring, urban planning, and agriculture, alongside an introduction to emerging technologies like drones and radar, preparing students to extract and interpret spatial information effectively.",
    "Detailed Syllabus": [
      "Unit-1: Introduction to Remote sensing: What is remote sensing? Earth Observation Satellites and Platforms.",
      "Unit-2: Physics of Electro Magnetic Radiation (EMR) Radiation laws applicable to remote sensing: EMR interaction with Atmosphere and Earth materials.",
      "Unit-3: Data acquisition and image characteristics, Image pre-processing, Image Enhancement.",
      "Unit-4: Information extraction- Multispectral classification – Visual Interpretation- Digital classification. Object based image classification, Stereo Imagery.",
      "Unit-5: Major applications in Vegetation /wildlife; Hydrology/Agriculture, Disaster management.",
      "Unit-6: Overview of Advanced topics: Drone, Hyperspectral and thermal, Microwave/Radar"
    ]
  },
  {
    "Course Title": "IoT Workshop",
    "Course Code": "CE9.609",
    "Course Description": "This workshop introduces the fundamental principles and practical applications of Internet of Things (IoT) systems, with a focus on structural engineering contexts. It covers essential electrical circuit analysis, embedded system components like microcontrollers, sensors, and actuators. Participants will learn C programming for Arduino and ESP32 platforms, exploring hardware interfacing, communication protocols, and advanced peripherals. The curriculum extends to IoT networking, cloud computing, data analysis, interoperability standards, and security considerations. Upon completion, learners will be equipped to design, develop, and implement robust IoT-based solutions for complex real-world problems, from conceptualization to visualization.",
    "Detailed Syllabus": [
      "1. Basic properties of electricity and electrical circuits - DC, Voltage, Current, Power, Energy, Resistance, Ohm’s Law, Circuit Diagrams.",
      "2. Kirchoff’s voltage and current laws, series and parallel resistance, Voltage and Current divider.",
      "3. Online Simulations using TinkerCAD.",
      "4. Basic Circuits, Mesh analysis, Node analysis.",
      "5. What is IoT, Embedded Systems, Components of Embedded Systems, Microcontrollers, Sensors and Actuators, Analog/Digital conversion, Internet structure, Protocols, TCP/IP.",
      "6. Arduino Environment, C Programming, Arduino programming and debugging, URAT Protocol.",
      "7. Interfacing with Arduino, Pulse Width Modulation, Arduino Libraries, I2C communication, Arduino Shields.",
      "8. Peripherals: RTC, ADC channels, resolution, onboard memory, power, external/internal watchdog.",
      "9. Communications and Networking in IoT.",
      "10. Cloud Computing and Data Analysis.",
      "11. Interoperability Standards and security.",
      "12. Dashboard and Visualization.",
      "13. Documentation and Productization"
    ]
  },
  {
    "Course Title": "Language and Society",
    "Course Code": "CL2.203",
    "Course Description": "This course explores the intricate relationship between language and society, focusing on core principles of sociolinguistics. Students will investigate phenomena such as language variation, dialects, and contact situations like bilingualism and code-switching. The curriculum delves into social stratification of language, cultural influences, and critical perspectives on language and power dynamics. Practical applications include analyzing language data using learned concepts, interpreting findings for computational models, and developing real-world solutions. Through team-based projects, students will gain confidence in designing and implementing computational models in authentic social contexts.",
    "Detailed Syllabus": [
      "1. Language Variation: Sociolinguistics and sociology of language, Variation in language, Linguistic variables and social variables. Speech Communities, Language, Dialects and Varieties. Standard language and Standardization, Regional and social dialects. Register, styles. Dialectology.",
      "2. Language Contact: Bilingualism/Multilingualism, borrowing, code mixing/switching, pidginization and creolization, convergence, language maintenance/shift, language acquisition in a multilingual setting. Diglossia with or without bilingualism.",
      "3. Social stratification of language. Inherent variability. Sociolinguistic variables: indicator, marker, stereotype. Style shifting. Hypercorrection. Language variation and language change. Social motivation for sound change. Sociolinguistic devices for effective communication. Communicative competence. Politeness strategies. Pronouns of power and solidarity.",
      "4. Language and Culture: Directions of influence. The Whorfian hypothesis.",
      "5. Critical Sociolinguistics. Language and power. Language and social attitudes: gender, race, education.",
      "6. Language planning: codification and elaboration"
    ]
  },
  {
    "Course Title": "Learning and Memory",
    "Course Code": "CG1.403",
    "Course Description": "This course delves into the intricate psychological and neuroscientific underpinnings of learning and memory. It explores foundational concepts like classical and operant conditioning, habituation, and various memory systems including episodic, semantic, skill, and working memory, examining their neural network representations. The curriculum further investigates the influence of emotion, social interactions, and lifespan development on these cognitive processes. Students will develop the ability to critically analyze experimental research, apply behavioral principles to brain models, and design innovative experiments, thereby advancing their understanding and contributing to the field.",
    "Detailed Syllabus": [
      "Introductory Module: Psychology of Learning and Memory; Neuroscience of Learning and Memory.",
      "Learning Module: Habituation, Sensitization, and Familiarization: Learning About Repeated Events; Classical Conditioning: Learning to Predict Significant Events; Operant Conditioning: Learning the Outcome of Behaviours; Generalization, Discrimination Learning, and Concept Formation.",
      "Memory Module: Episodic Memory and Semantic Memory; Skill Memory; Complementary learning systems in the brain /Memory network in the brain; Working Memory and Cognitive Control.",
      "Integrative Module: Emotional/Stress Influences on Learning and Memory; Social Learning and Memory: Observing, Interacting, and Reenacting; Development and Aging: Learning and Memory Across the Lifespan"
    ]
  },
  {
    "Course Title": "The Making of Contemporary India",
    "Course Code": "HS4.102",
    "Course Description": "This course explores the multifaceted historical processes that have shaped contemporary India. Beginning with an overview of colonial rule and the independence movement, it examines the nation's founding moments, including Partition and the Constitution's creation. The curriculum then traces India's political, social, and economic evolution from the 1950s to the 2000s, analyzing significant transitions and long-term societal trends like urbanization and education. Students will develop a critical understanding of key historical narratives, scholarly frameworks, and conceptual foundations, preparing them to engage deeply with related topics and cultivate their own research perspective.",
    "Detailed Syllabus": [
      "Unit 1: Colonial Background: overview of the main features of colonial rule and of India’s independence movement; important social and economic trends beginning in the late 19th and early 20th centuries.",
      "Unit 2: Independence, Partition, Constitution of the New Nation-State: detailed study of Independence and the making of the Constitution of India.",
      "Unit 3: 1950s to 2000s: overview of how India’s polity and society passed through transition and faced new challenges; major landmarks of independent India’s political, social, economic, and development journey.",
      "Unit 4: Long-term Processes: literacy and education, infant mortality and sex-ratios, migration and urbanization, and travel and communication"
    ]
  },
  {
    "Course Title": "MCS 1 – Probability and Statistics",
    "Course Code": "MA6.301",
    "Course Description": "This course delves into the fundamental concepts of probability and statistics, establishing a robust theoretical foundation. Students will explore axiomatic probability, conditional probability, and Bayes' Rule, progressing to an in-depth study of random variables, common discrete and continuous distributions, expectation, and variance. Key topics include linearity of expectation, tail bounds (Markov, Chebyshev), the Law of Large Numbers, and the Central Limit Theorem. The curriculum culminates in practical applications such as Maximum Likelihood and Bayesian estimation techniques, enabling students to create, analyze, and apply mathematical models for real-world problem-solving and data analysis.",
    "Detailed Syllabus": [
      "Unit 1: Sample Spaces, Counting, Uniform Probability, Axioms of Probability, Continuous Probability Spaces, Conditional Probability, Bayes Rule, Independence.",
      "Unit 2: Random Variables, PMFs, Discrete Probability Distributions, Multiple Random Variables, Expectation, Variance, Covariance, Standard distributions of Bernoulli, Binomial, Geometric, Gaussian, Exponential, Poisson.",
      "Unit 3: Continuous Probability Distributions, Tail Bounds (Markov, Chebyshev, Chernoff), Law of Large Numbers, Central Limit Theorem.",
      "Unit 4: Bayesian Statistics, Maximum Aposteriori Estimation, Maximum Likelihood Estimation, Confidence Intervals"
    ]
  },
  {
    "Course Title": "MCS 2 - Linear Algebra",
    "Course Code": "MA6.302",
    "Course Description": "This course provides a rigorous foundation in Linear Algebra, a cornerstone for various scientific and engineering disciplines. It systematically covers fundamental concepts including vector spaces, linear transformations, and methods for solving systems of linear equations. Students will explore eigenvalues, eigenvectors, inner product spaces, and projections. The curriculum culminates in advanced topics such as Spectral and Singular Value Decompositions. Emphasis is placed on developing analytical proof skills and applying these principles to design dimension reduction techniques and create mathematical models for real-world problems like image compression and Principal Component Analysis.",
    "Detailed Syllabus": [
      "Unit 1: Vector spaces, subspaces, Linear dependence, Span, Basis, Dimension, Finite dimension vector spaces Linear transformation, Range and Null space of linear transformation, Rank Nullity Theorem, Sylvester's Law, Matrix representation of a linear transformation for finite dimensional linear spaces, Matrix operations, change of basis, Rank of a Matrix, Range and Null Space of a matrix representing a linear transformation. Linear spaces with inner product.",
      "Unit 2: System of Linear Equations, Row-echelon form, reduced row-echelon form. Gauss-Jordon elimination, Solution of linear systems using Gauss-Jordon elimination, matrix inversion by Gauss Jordon elimination, Understanding Range Space and Solution Space using Rank-Nullity Theorem.",
      "Unit 3: Eigenvalues and Inner product: Eigenvalues & Eigenvectors, Norms, Inner Products and Projections, Applications like Analysis of Random Walks.",
      "Unit 4: Advanced Topics: Spectral & Singular Value Decomposition Theorems, Applications of SVD and Best Fit Subspaces"
    ]
  },
  {
    "Course Title": "Mobile Robotics",
    "Course Code": "CS7.503",
    "Course Description": "This course delves into mobile robotics, focusing on the fundamental principles of robotic perception and navigation. It begins with exploring coordinate frame transformations and advanced pose representations essential for robot kinematics. Subsequently, the curriculum covers LIDAR-based mapping and localization, alongside principles of computer vision, including camera modeling and calibration. Emphasis is placed on backend optimization techniques, such as Bundle Adjustment, crucial for Simultaneous Localization and Mapping (SLAM). Students will analyze, apply, and simulate advanced algorithms to address real-world challenges in robotic perception and autonomous navigation.",
    "Detailed Syllabus": [
      "Unit 1: Representation of Coordinate Frames, Rotation Matrices, Homogenous Transforms, Quaternions and Axis Angle Representations.",
      "Unit 2: LIDAR based Mapping and Localization.",
      "Unit 3: Principles of Computer Vision: Camera Modelling, Calibration, Reconstruction and Resection.",
      "Unit 4: Backend Optimization for LIDAR Based SLAM, Bundle Adjustment"
    ]
  },
  {
    "Course Title": "Modern Coding Theory",
    "Course Code": "EC5.411",
    "Course Description": "Modern Coding Theory explores the theoretical foundations and practical applications of error-correcting codes for reliable data transmission. The course delves into core concepts such as channel capacity and introduces various capacity-achieving codes, including LDPC and Reed Muller. Students will analyze their respective decoding algorithms, such as Message Passing Decoding and majority logic. Furthermore, the curriculum covers advanced topics like recursive constructions for Berman and Polar Codes, emphasizing their capacity achievability. This course provides a comprehensive understanding of contemporary coding techniques crucial for designing robust communication systems, particularly relevant for 5G and future wireless technologies.",
    "Detailed Syllabus": [
      "1. Channels and their Capacity; Notion of Capacity achieving Codes; Examples codes achieving capacity on various channels. Application in 5G and beyond.",
      "2. Basics of Block Codes, Concept of LDPC Codes, Idea of Code Ensembles.",
      "3. Message Passing Decoding of LDPC Codes, Analysis of decoding via Density evolution.",
      "4. Reed Muller Codes: Definition, Properties, and Proof of Capacity achieving nature in Binary Erasure Channels, Idea of Capacity Achieving nature in other binary memoryless channels..",
      "5. Recursive Constructions for Berman Codes and Polar Codes: Definitions, basic properties, idea of capacity achieving nature in BMS channels"
    ]
  },
  {
    "Course Title": "Modern Complexity Theory",
    "Course Code": "CS1.405",
    "Course Description": "This course delves into Modern Complexity Theory, exploring fundamental models of computation, including Turing Machines and Boolean Circuits, alongside inherent impossibility results. Students will thoroughly examine key complexity measures (time, space, depth) and established classes (P, NP, PSPACE, NC), understanding their relationships and hierarchies. A central focus will be on designing reductions to demonstrate problem hardness and completeness for various classes. The curriculum also covers advanced topics like probabilistic and randomized complexity. Upon completion, learners will be adept at synthesizing rigorous proofs for resource bounds and applying principles of NP-Completeness to manage computational intractability in problem design.",
    "Detailed Syllabus": [
      "Unit 1: Models of Computation and Impossibility Results: Turing Machines, Circuits, Encoding of Problems, Halting Problem, Shannon’s Counting Lower bound.",
      "Unit 2: Complexity Measures and Classes: Time, Space, Depth measures of complexity, Time, Space hierarchy theorems, Nondeterminism, Savitch’s theorem, P, NP, P/poly, PSPACE, EXP, L, NL.",
      "Unit 3: Completeness and Hardness Reductions: 3SAT, Cook-Levin Theorem, NP-Complete, NL Complete, Hardness reductions for common problems like Vertex Cover, Independent Set, Knapsack etc.",
      "Unit 4: Advanced Topics: Definitions and relationships between PH, RP, BPP, NC including theorems like Karp-Lipton, Adleman’s theorem, Der and omization Techniques"
    ]
  },
  {
    "Course Title": "Music Workshop",
    "Course Code": "HS1.210",
    "Course Description": "This Music Workshop offers a comprehensive exploration of musical concepts and practices. Students will delve into diverse writings by musicians and musicologists, gaining an introduction to fundamental musical principles with a focus on Indian music. The course incorporates guided music listening sessions across various genres to appreciate 'Sadhana', alongside practical exercises covering notes, rhythm, scales, ragas, and language. This foundational work culminates in the development of individual musical projects, fostering an understanding of music's research potential, its integral role in human life, and an interdisciplinary perspective, empowering students to create original work.",
    "Detailed Syllabus": [
      "1. Text reading: The students will be introduced to a wide range of topics through the writings of different musicians, musicologists and music rasikas.",
      "2. Introduction to all the basic concepts of music with special focus on Indian music.",
      "3. Music listening: Music of different genres will be played for the students to observe and understand the importance of ‘Sadhana’ in music.",
      "4. Practical exercises: Various exercises based on notes, rhythm, scales, ragas and language.",
      "5. Discussions on topics that students want to take up as their course project (individual sessions relevant to their topic)"
    ]
  },
  {
    "Course Title": "Network, Signals & Systems",
    "Course Code": "EC5.101",
    "Course Description": "This course establishes a foundational understanding of electrical networks, signals, and systems. It comprehensively covers fundamental circuit elements, network theorems, and both transient and steady-state analysis, including sinusoidal inputs and two-port networks. The curriculum then progresses to signal representation, Fourier series, and system characterization using differential equations, block diagrams, convolution, and impulse responses. Finally, transfer function analysis with Laplace transforms is explored. Upon completion, students will be proficient in analyzing complex circuit behaviors and applying analytical techniques to solve practical problems involving signals and dynamic systems.",
    "Detailed Syllabus": [
      "Unit 1: Circuit elements",
      "Unit 2: Network theorems",
      "Unit 3: Transient and Steady state analysis",
      "Unit 4: Sinusoidal input and phasors",
      "Unit 5: Two port networks",
      "Unit 6: Signals, representation, sinusoids, and Fourier series",
      "Unit 7: Systems and representations – differential equations, block diagram, operator, and functional form",
      "Unit 8: Convolution integral and impulse response",
      "Unit 9: Transfer function – Laplace transform, poles and zeros"
    ]
  },
  {
    "Course Title": "Open Quantum systems and Quantum Thermodynamics",
    "Course Code": "SC1.310",
    "Course Description": "This course explores the fundamental kinematics and dynamics of open quantum systems. Beginning with a review of quantum mechanics, it progresses through pure and mixed states, measurement theory, and the intricacies of non-unitary evolution, including completely positive trace preserving maps and entanglement characterization. The syllabus details general quantum dynamical equations, such as the Lindblad equation, and introduces concepts of Markovianity. Finally, it delves into the basics of quantum thermodynamics, including quantum heat engines. Students will gain a robust understanding of noisy quantum systems and insights into current research directions, preparing them for advanced studies and research in quantum information science and related fields.",
    "Detailed Syllabus": [
      "1. Review on basic linear algebra; Metric space, Dual space, Hilbert space and bra-ket algebra.",
      "2. Review on unitary quantum mechanics; Unitary evolution, state vectors, uncertainty principle, Schroedinger equation etc.",
      "3. Pure and mixed states, basics on measurement theory, projective measurements, positive operator valued measures etc.",
      "4. non-unitary evolution, tensor product space, bi-paretite quantum systems, global evolutions, non-unitary dynamics, completely positive trace preserving maps, operator-sum representation.",
      "5. Monotones under completely positive operations, basics of distance measures and entropic measures.",
      "6. Selected topics on complete positivity, positivity, Choi-Jamiolkowski isomorphism, Stinspring dilation, entanglement detection.",
      "7. General quantum dynamical equations, master equation, Lindblad equation and its derivation from a few different perspectives, properties of Lindblad dynamics.",
      "8. Basic idea on Markovianity and non-Markovianity from quantum mechanical perspectives.",
      "9. Basic ideas on quantum heat engines and a few other selected topics on thermodynamics."
    ]
  },
  {
    "Course Title": "Operating Systems and Networks",
    "Course Code": "CS3.301",
    "Course Description": "This course delves into the foundational principles of operating systems and their intrinsic relationship with network architectures. Students will explore core OS concepts including process and memory virtualization, scheduling, and concurrency mechanisms like threads and locking. The curriculum further examines data persistence through file systems and protection models, alongside an integrated study of networking fundamentals, data transmission technologies, and basic network security. Practical outcomes include the capacity to develop efficient applications utilizing OS and network services, design task-specific OS modules, and architect robust network-based systems by leveraging system calls.",
    "Detailed Syllabus": [
      "Unit 1: Introduction, Process and Memory Virtualization – Scheduling, Memory addressing and Paging, and Networking Overview",
      "Unit 2: Concurrency – Threads and locking mechanisms, Common concurrency problems, Data transmission and Network Technologies",
      "Unit 3: Persistence – File Systems, Protection, Network File Systems and basics of Network Security"
    ]
  },
  {
    "Course Title": "Physics of Early Universe",
    "Course Code": "SC1.415",
    "Course Description": "This course provides a rigorous exploration of modern cosmology, focusing on the fundamental physical principles governing the universe's evolution from its earliest moments. It begins with observational evidence, including cosmic expansion and the microwave background, then delves into the geometric and dynamic properties of the universe using Friedmann equations to model various cosmic scenarios. Students will examine the thermal history, including recombination, nucleosynthesis, and the role of cold dark matter. A significant portion addresses the concept of cosmic inflation and its solutions to longstanding cosmological puzzles. Upon completion, participants will be able to explain large-scale structures, analyze cosmic dynamics, calculate properties of model universes, and critically engage with contemporary unsolved problems in cosmological research.",
    "Detailed Syllabus": [
      "Unit-1: Universe Observed: Expansion. Isotropy and homogeneity. Age. Cosmic microwave background",
      "Unit-2: Geometry and Dynamics: Universe in the eyes of Newton. Geometry. Mass and curvature. Freedman equations. Model universes: empty universe, matter or radiation dominated universe, multi-component universe",
      "Unit-3: Black-body radiation and the early history: Observation of CMB. Recombination and decoupling. Last scattering. Temperature fluctuations",
      "Unit-4: Very early history of the Universe: Thermal history. Nucleosynthesis. Cold dark matter",
      "Unit-5: Inflation: Flatness, horizon, and monopole problem. Physics of inflation"
    ]
  },
  {
    "Course Title": "Principles of Programming Languages (PoPL)",
    "Course Code": "CS1.402",
    "Course Description": "This course systematically explores the fundamental principles governing programming language design, semantics, and implementation. It delves into core paradigms, including functional programming, and foundational concepts like operational semantics, scope, state, control flow abstractions (such as continuations), and type systems. Through formal methods, students analyze how various language constructs are specified and implemented. This understanding enables them to analyze and critique diverse language designs, create domain-specific and object-oriented languages, and specify robust application interfaces.",
    "Detailed Syllabus": [
      "Functional Programming: Abstract vs. Concrete Syntax. Racket syntax, Functions, recursion, syntactic extensions, higher-order functions, map, reduce and other combinators.",
      "Operational Semantics: Abstract Reduction Systems, Transition Systems, Reduction, Simplification and Evaluation relations. Judgements and Rules. Rule Induction.",
      "Scope: Identifiers, Scope and extent, Lexical scope, Environments, Dynamic scope and parameters. Closures",
      "State: Stores and imperative constructs, explicit and implicit store references, objects, invariants and safety, interfaces and constructors, inheritance, Parameter passing. Call-by-value, call-by-name and lazy evaluation.",
      "Control: Tail calls, Contexts, continuations, continuation passing style, exceptions, threads.",
      "Types: Types syntax, type safety theorems. Type inference",
      "Special Topics (if time permits): Monads, Concurrency."
    ]
  },
  {
    "Course Title": "Principles of Semiconductor Devices",
    "Course Code": "EC2.409",
    "Course Description": "This course explores the fundamental principles governing semiconductor devices. It begins with the quantum mechanical basis of semiconductor properties and energy band theory, detailing carrier behavior in equilibrium and transport phenomena. Subsequently, the course delves into the physics and operation of key semiconductor structures, including PN junctions, Metal-Oxide-Semiconductor (MOS) devices, MOSFETs, and Bipolar Junction Transistors (BJTs). Students will develop the ability to calculate device parameters, solve related design problems, and design basic semiconductor circuits.",
    "Detailed Syllabus": [
      "Unit 1: Semiconductor Properties",
      "Unit 2: Quantum Mechanics and Energy Band Theory",
      "Unit 3: Carriers in equilibrium, G-R processes",
      "Unit 4: Carrier Transport",
      "Unit 5: PN Junction physics",
      "Unit 6: MOS & MOSFET",
      "Unit 7: BJT"
    ]
  },
  {
    "Course Title": "Probability and Random Processes",
    "Course Code": "MA6.102",
    "Course Description": "This course delves into the fundamental principles of probability theory and random processes. Students will establish a robust understanding of probability spaces, conditional probability, and various discrete and continuous random variables, including their distributions, expectations, and variances. The curriculum further explores joint and conditional distributions, functions of random variables, and crucial limit theorems like the Law of Large Numbers and Central Limit Theorem. Finally, it introduces the core concepts of random processes, including stationarity and power spectral density. Upon completion, students will be equipped to analyze and apply probabilistic models to real-world scenarios.",
    "Detailed Syllabus": [
      "Unit 1 : Sets and set operations, Probability space, Conditional probability and Bayes theorem.",
      "Unit 2: Discrete random variables, probability mass function, probability distribution function, example random variables and distributions, Continuous random variables, probability density function, probability distribution function, example distributions.",
      "Unit 3: Joint distributions, functions of one and two random variables, expectation and variance, Conditional distribution, densities, conditional expectation, moment generating functions, characteristic functions.",
      "Unit 4: Markov, Chebyshev and Chernoff bounds. Random sequences and modes of convergence, Strong and weak laws of large numbers, central limit theorem.",
      "Unit 5: Random processes, Mean and covariance functions, Stationary processes and wide-sense stationary processes, power spectral density, linear filtering of random processes."
    ]
  },
  {
    "Course Title": "Probability and Statistics",
    "Course Code": "MA6.101",
    "Course Description": "This course provides a rigorous foundation in probability theory and statistical inference. It commences with discrete and continuous random variables, exploring their distributions, key properties, and moment generating functions. The curriculum progresses to multivariate distributions, covering marginals, conditionals, independence, and the Central Limit Theorem. The course then integrates statistical inference methods (estimation, hypothesis testing, Bayesian approaches) and introduces fundamental random processes. Students will develop the analytical skills to model and interpret probabilistic phenomena, apply statistical inference techniques, and logically derive theoretical results.",
    "Detailed Syllabus": [
      "Unit 1: Discrete Random Variables: Probability mass function, expectation and variance. Bernoulli distribution, Geometric distribution, Binomial distribution. Derivation of mean and variance. Sampling with and without replacement. Hypergeometric distribution and Poisson distribution. Derivation of the Poisson distribution as limiting form of Binomial. Derivation of mean and variance. Bounding probabilities, tail sum formula, Markov’s inequality and Chebyshev’s inequality. Probability generating functions and moment generating functions.",
      "Unit 2: Continuous Random Variable: Probability density function, cumulative distribution function, expectation, mean and variance. Moment generating functions and uniqueness theorem. Chebyshev’s inequality. The uniform distribution on (a, b), the normal distribution. Mean and variance of the normal distribution. The Cauchy distribution. The exponential distribution, moments, memoryless property, hazard function. Gamma distribution, moments, Chi-square distribution.",
      "Unit 3: Multivariate Distributions: Cumulative distribution function method for finding the distribution of a function of random variable. The transformation rules. Discrete bivariate distributions, marginal and conditional distributions, the trinomial distribution and multinomial distribution. Continuous bivariate distributions, marginal and conditional distributions, independence of random variables. Covariance and correlation. Mean and variance of linear combination of two random variables. The joint Moment generating function (MGF) and MGF of the sum. The bivariate normal distribution, marginal and conditional distributions, conditional expectation and variance, joint MGF and marginal MGF. Linear combinations of independent random variables. Means and variances. Sequences of independent random variables and the weak law of large numbers. The central limit theorem, normal approximation to the binomial distribution.",
      "Unit 4: Statistical Inference and Random Processes: Point Estimation, Interval Estimation, Hypothesis Testing, Linear Regression, Bayesian Inference. Point Processes, Poisson Process, Discrete Time Markov Chains."
    ]
  },
  {
    "Course Title": "Product Management 101",
    "Course Code": "PD2.401",
    "Course Description": "This course introduces the foundational principles and practices of modern product management, emphasizing the strategic role in developing technical products for the digital world. It progresses from understanding market needs and crafting robust product strategies to ideation, feasibility assessment, and cultivating an innovative product mindset. Participants will learn to develop comprehensive product roadmaps and release plans, applying agile and lean methodologies for efficient execution. The curriculum equips learners with essential skills to successfully ideate, strategize, and oversee the development and market launch of innovative digital solutions that address complex market problems.",
    "Detailed Syllabus": [
      "Module 1: Introduction to Product Management – the Art & Science of Product Management: What is product management; Types of Product Management; Product life cycle",
      "Module 2: Product Strategy: Market Research; Product Value Proposition; Product Strategy (Market Needs, Key Differentiators, Business Goals)",
      "Module 3: Product Ideation & Market fit: Product Ideation; Product Feasibility; Product market Fit; User Journeys",
      "Module 4: Adopting a Product Mindset: Prioritization; People; Process; Progress",
      "Module 5: Product Roadmap: Top-Down Product Strategy; Featureless Roadmaps to feature roadmaps; Roadmaps to Release plans",
      "Module 6: Product release execution: Product Prototyping & Market Validation; Product Development Process (Agile development process, Lean product development); Product release to market"
    ]
  },
  {
    "Course Title": "Product Marketing",
    "Course Code": "PD2.501",
    "Course Description": "This course delves into Product Marketing, emphasizing its strategic integration with product management to build and launch successful products. It systematically covers essential marketing frameworks like the 4Ps and 4Cs, guiding students through developing robust value propositions, including segmentation, pricing, and positioning. Key topics extend to crafting compelling marketing narratives, fostering customer engagement, and constructing actionable sales playbooks. Learners will gain proficiency in applying methods and tools to define, execute, and evaluate comprehensive go-to-market strategies, designing products effectively from inception.",
    "Detailed Syllabus": [
      "Unit 1 – Product Marketing and Product Management: Recap of 1) how marketing is an integral part of Product Management, 2) Product Management fundamentals, 3) Product Market Fit – problem and solution validation",
      "Unit 2 – Marketing Mix: 1) Value Model (4Cs), 2) Marketing Mix (4Ps) and how to use them in tandem to strategize product launch",
      "Unit 3 – Value Proposition and Promotion: 1) Segmentation and User Personas, 2) Customer Journey Mapping, 3) Pricing Mix, 4) Positioning, and 5) Product Branding",
      "Unit 4 – Customer Engagement: 1) Introduction to Marketing Communication, 2) Building a comprehensive narrative for marketing, and 3) Customer Engagement at all stages of acquisition",
      "Unit 5 – Sales Playbooks: 1) What are playbooks? and 2) how to develop an actionable playbook for sales",
      "Unit 6 – Go-to-Market Strategizing: 1) Customer Acquisition Strategies, 2) Defining the GTM Strategy, and 3) Executing the GTM Strategy successfully"
    ]
  },
  {
    "Course Title": "Quantum Information Theory",
    "Course Code": "TBD",
    "Course Description": "This course provides a rigorous introduction to Quantum Information Theory, exploring its fundamental principles and applications for information processing. It covers the mathematical postulates of quantum theory, detailing quantum states, channels, and measurements for both closed and open systems. Students will examine various quantum correlations, including entanglement and non-locality, alongside essential mathematical tools such as trace-distance and quantum entropies. The curriculum culminates in an analysis of quantum communication protocols. Upon completion, students will be equipped to analyze information-theoretic aspects of quantum systems and apply these concepts to advanced information processing tasks.",
    "Detailed Syllabus": [
      "Unit 1: Overview of why the need of quantum information theory: In this part, we will overview the need for quantum information theory. Outline briefly what Shannon information theory means and why and how can we study information theoretical aspects of physical systems obeying quantum theory.",
      "Unit 2: Mathematical formulations of the postulates of the quantum theory: In this part, we will study the postulates of quantum theory pertaining to quantum information theory. We will mainly describe postulates in the form of mathematical statements and rules. We will deal with both closed (unitary evolution) and open (noisy evolution) quantum systems. We will discuss standard theorem statements (e.g., Choi-Jamiołkowski isomorphism) after introducing quantum states, quantum channels, and quantum measurements.",
      "Unit 3: Quantum correlations: In this part, we will discuss different kinds of quantum correlations. We will mainly focus on quantum correlations like entanglement and nonlocal quantum correlations. We will discuss measures and tests to quantify or test these correlations. We may touch upon local hidden variable theories to derive Bell tests for nonlocal quantum correlations.",
      "Unit 4: Tools in quantum information theory: In this part, we will introduce and discuss some of the important tools that are employed widely in the domain of quantum information theory. Some of these tools are trace-distance, relative entropy, fidelity, etc. We will discuss formula and bounds for quantum entropy, quantum conditional entropy, quantum mutual information, quantum conditional mutual information. We will discuss quantum data-processing inequality, strong subadditivity, and other entropic measures and inequalities.",
      "Unit 5: Quantum communication protocol: In this part, we will discuss quantum typicality, packing lemma, covering lemma, and some examples of quantum communication protocols. We may touch upon quantum resource theories and their frameworks if time permits."
    ]
  },
  {
    "Course Title": "Quantum Mechanics",
    "Course Code": "SC1.203",
    "Course Description": "This course delves into Quantum Mechanics, exploring the probabilistic nature of the quantum world that fundamentally differs from classical theories. Students will master the essential mathematical formalism, including linear algebra and complex analysis, necessary for solving quantum problems. The curriculum covers foundational concepts like the Schrödinger equation and uncertainty principle, progressing through solutions for one-dimensional systems such as the infinite square well and harmonic oscillator. Advanced topics include three-dimensional systems like the Hydrogen atom, angular momentum, perturbation theory, and conceptual challenges like Bell's theorem. This prepares students to analyze complex quantum systems and understand the profound implications of quantum phenomena.",
    "Detailed Syllabus": [
      "Unit 1: Introduction: The Schrödinger equation and the uncertainty principle",
      "Unit 2: Mathematical Formalism: Review of linear algebra, complex functions, Fourier transformation etc. and the generalized statistical interpretation, Heisenberg picture",
      "Unit 3: Time independent Schrödinger equation: Infinite square well, harmonic oscillator, free particle, delta function potential, finite square well",
      "Unit 4: 3D Problems: Spherical coordinates - Hydrogen atom, angular momentum, spin, two-particle systems, atoms",
      "Unit 5: Advanced topics: Time independent perturbation theory, the variational principle, Bell's theorem"
    ]
  },
  {
    "Course Title": "Readings from Hindi Literature",
    "Course Code": "HS1.303",
    "Course Description": "This course provides an immersive exploration of Hindi literature, focusing on its historical trajectory and contemporary expressions. Students will engage with seminal works of fiction, poetry, and drama by influential authors like Nirmal Varma, Bhishm Sahani, Ajnyeya, Muktibodh, and Mohan Rakesh. The curriculum also delves into non-fiction and critical theory, examining concepts such as aesthetics versus committed literature and the sociology of literature. Through these readings, students will develop a profound appreciation for literary arts, gain a comparative understanding of diverse literary traditions, and acquire elementary skills in literary criticism, encouraging future creative engagement.",
    "Detailed Syllabus": [
      "I. History of Hindi literature",
      "2. Fiction: Nirmal Varma, Bhishm Sahani, Manto, Gyanranjan, Kamaleshwar, Uday Prakash, Ismat Chugtai, etc.",
      "3. Poetry: Ajnyeya, Muktibodh, Nagarjun, Shamsher Bahadur Singh, Raghuveer Sahay, Faiz Ahmed Faiz, Nand Kishore Acharya, Sarveshwar Dayal Saksena, Manglesh Dabral, Vinod Kr Shukla, Kumar Vikal, Gagan Gill, Katyayani, Anamika, etc.",
      "4. Play: Mohan Rakesh (Aadhe-adhoore)",
      "5. Non-fiction and criticism: (i) Pleasure readings; (ii) aesthetics versus committed literature; (iii) Sociology of literature"
    ]
  },
  {
    "Course Title": "Real Analysis",
    "Course Code": "MA4.101",
    "Course Description": "This course establishes a rigorous foundation in mathematical analysis, starting with the fundamental properties of real numbers, sequences, and series, including convergence. It then advances to core principles of differentiation and integration, covering mean value theorems, Taylor series, and multiple integrals. The curriculum further extends to vector calculus, ordinary and partial differential equations, and a comprehensive introduction to complex analysis, encompassing analytic functions, Cauchy's theorems, and residue calculus. Students will cultivate skills in constructing rigorous mathematical arguments, communicating complex ideas, and applying advanced analytical methods to solve diverse problems.",
    "Detailed Syllabus": [
      "Unit 1: Sequence of real No, Bounded and Unbounded Sets, Supremum, Infimum, Limit points of a set, Closed Set, Countable and uncountable sets. Sequences, Limit points of a Sequence. Limits Inferior and Superior, Convergent sequence, Non convergent sequence, Cauchy General Principle of Convergence, bounded and monotone sequence, Infinite Series, Positive Term Series, Convergence of series of real numbers, Necessary condition, Absolute convergence and power series, Convergence tests for series.",
      "Unit 2: Mean value theorems (Rolle’s Theorem, Cauchy Mean Value Theorem, Lagrange’s Mean Value Theorem), Indeterminate forms, Taylors Series, Partial derivatives. Integration as a limit of a sum, some integrable functions, Fundamental theorem of Calculus, Mean Value Theorems of Integral calculus, Integration by parts, Change of variable in an integral, Second Mean value theorem, Multiple integrals,",
      "Unit 3: Vector, Vector operations, Products, Areas and Determinants in 2D, Gradients, Curl and Divergence, Volumes and Determinants in space. Differential equations of first order and first degree. Linear ordinary differential equations of higher order with constant coefficients. Elements of Partial Differential Equation (PDE).",
      "Unit 4: Analytic function of complex variable, CR Equation, harmonic functions, Laplace equation, applications",
      "Unit 5: Integration of a function of a complex variable, M-L inequalities. Cauchy’s Integral Theorem. Cauchy’s Integral formula. Taylor’s and Laurent Expansion, Poles and Essential Singularities, Residues, Cauchy’s residue theorem, Simple contour integrals."
    ]
  },
  {
    "Course Title": "Real-Time Embedded Systems",
    "Course Code": "CS3.502",
    "Course Description": "This course delves into Real-Time Embedded Systems, emphasizing the design and analysis of time-critical applications. It covers essential concepts from system modeling to diverse scheduling paradigms, including clock-driven, priority-driven, and multiprocessor algorithms. Students will rigorously analyze schedulability under various conditions, manage aperiodic and sporadic tasks, and address resource access control issues within uniprocessor and multiprocessor environments. Practical outcomes include the ability to critically assess system performance, analyze complex timing constraints, and develop effective scheduling solutions for real-world real-time systems using simulators.",
    "Detailed Syllabus": [
      "Unit 1: Real-Time Systems – Introduction and Concepts, Modeling Real-Time Systems",
      "Unit 2: Commonly used approaches to Real-Time Scheduling – Clock Driven approach, Weighted Round Robin approach, Priority Driven Approach, Dynamic vs Static Systems, Offline vs Online Scheduling, Preemptive vs non-preemptive",
      "Unit 3: Clock Driven Scheduling – Scheduling Aperiodic and Sporadic Jobs, Schedulability test",
      "Unit 4: Priority Driven Scheduling – Static Priority: Rate Monotonic and Deadline Monotonic Algorithms, Dynamic Priority: EDF Algorithm, Schedulability tests",
      "Unit 5: Scheduling Aperiodic and Sporadic jobs in Priority Driven Systems – Deferrable Server, Sporadic Server, Constant Utilization Server, Total Bandwidth Server and Weighted Fair Queuing Server",
      "Unit 6: Multiprocessor Scheduling",
      "Unit 7: Resources and Resource Access Control"
    ]
  },
  {
    "Course Title": "Research in Information Security",
    "Course Code": "CS8.501",
    "Course Description": "This course delves into advanced research topics within information security, exploring foundational cryptographic principles like Elliptic-Curve Cryptography, key management, and access control. It examines security challenges across diverse modern computing paradigms, including vehicular networks, smart grids, IoT, and Cloud/Fog environments. The curriculum further investigates intrusion detection and prevention strategies, alongside the security and privacy implications of blockchain technology and its convergence with AI/ML. Students will cultivate critical thinking, problem-solving, and formal verification skills, enabling them to analyze existing protocols and design, analyze, and implement novel security solutions for emerging threats.",
    "Detailed Syllabus": [
      "Unit 1: Elliptic-Curve Cryptography (ECC), Key management in hierarchical access control, Key management, user authentication and access control, Proxy signature",
      "Unit 2: Security in vehicular adhoc networks/Internet of Vehicles (IoV), Security in smart grid/smart home, Security in Cloud/Fog computing",
      "Unit 3: Wireless Sensor Networks (WSNs) and Internet of Things (IoT)security",
      "Unit 4: Intrusion detection and prevention",
      "Unit 5: Blockchain and its security and privacy issues, Blockchain-based AI/ML security"
    ]
  },
  {
    "Course Title": "Retrofit of Existing Infrastructure",
    "Course Code": "TBD",
    "Course Description": "This course provides a comprehensive understanding of structural retrofit for existing infrastructure. It delves into the theory and concepts of damage mechanisms in masonry and RC buildings, detailing assessment methodologies, including computational stress analysis. Key retrofit techniques such as RC jacketing, shotcrete, and the addition of shear walls and bracing are explored, alongside their numerical modeling. Students will develop skills to quantify damage, propose appropriate retrofit solutions, apply structural analysis principles, and computationally evaluate the seismic performance of retrofitted structures in accordance with codal provisions.",
    "Detailed Syllabus": [
      "Module 1: Basic Concepts Introduction; Retrofit and its concept; Advantages and challenges; Retrofit materials; Difference between repair, retrofit, strengthening and rehabilitation; Codal provisions, Different techniques of retrofit, Mesh techniques: poly-propylene band, industrial geo-grid, chicken mesh, welded wire mesh; Section enlargement techniques: RC jacketing, shotcrete; Addition of structural components: shear walls, frames and bracing; Retrofit of foundation system: micro-piles.",
      "Module 2: Damage Assessment of Existing Buildings Causes of structural damage; Purpose of assessment; Detailed vulnerability assessment; Rapid visual survey; Non-destructive and semi-destructive testing; Numerical assessment of structurally deficient building; Computational stress analysis of structurally deficient building.",
      "Module 3: Numerical Modelling of Retrofit Techniques for Existing Buildings Local and global methods of retrofit; Modelling of various retrofit techniques in software - RC jacketing, shotcrete, shear walls, frames and bracing.",
      "Module 4: Re-evaluation of Retrofitted Building Numerical assessment of retrofitted building; Comparison between structurally deficient and retrofitted building; Check for capacity/drift and strength parameters; Codal provisions and acceptance criterion."
    ]
  },
  {
    "Course Title": "Robotics: Dynamics and Control",
    "Course Code": "EC4.401",
    "Course Description": "This course offers a rigorous foundation in robotic manipulator dynamics and control. It covers rigid body motion, spatial transformations, and mathematical modeling of robot links and joints. The curriculum progresses through manipulator kinematics—forward/inverse, velocity, singularity analysis—and delves into Euler-Lagrangian dynamics. Students will master trajectory planning and explore joint space and operational space control strategies. The course prepares learners to model, analyze, and implement effective control solutions for complex robotic systems.",
    "Detailed Syllabus": [
      "Unit 1: Introduction to robotics and rigid body motion – robot structure and workspace, transformation matrices, mathematical representation of joints and links, mobility analysis and constraints",
      "Unit 2: Manipulator forward and inverse kinematics – position analysis and velocity analysis, singularities",
      "Unit 3: Robot Dynamics – Euler-Lagrangian formulation and simulation of equations of motion",
      "Unit 4: Trajectory planning and generation",
      "Unit 5: Robot control – joint space control and operation space control"
    ]
  },
  {
    "Course Title": "Science I",
    "Course Code": "SC1.110",
    "Course Description": "This foundational course, \"Science I,\" explores fundamental principles across physics and chemistry, emphasizing both theoretical understanding and methodological approaches. It commences with mathematical modeling and natural scales, progressing to Special Relativity, classical mechanics via Lagrangian and Hamiltonian formulations, and the principles of Quantum Mechanics with applications to molecular structure. The course integrates Thermodynamics and Statistical Mechanics to explain macroscopic phenomena and material properties. Students will develop robust analytical and problem-solving skills, enabling them to evaluate scientific methodologies, analyze complex systems, and prepare for advanced research.",
    "Detailed Syllabus": [
      "Unit 1: Mathematical modeling in sciences, (i) geometry and linear algebra, (ii) change and calculus and (iii) chance and probability. Simple models can have complicated behavior: logistic map demonstrates deterministic chaos",
      "Unit-2: Forms in nature. Scales of length, time and energy in nature.",
      "Unit 2: Special theory of relativity: postulates, Lorentz Transformation, Length Contraction, Time dilation, Doppler effect, relative velocity determination, twin paradox, relativistic momentum and energy. Space time graphs, and relativity of simultaneity.",
      "Unit 3: Review of Newtonian Mechanics and its difficulties / failures. Introduction to Lagranian and Hamiltonian formulations, and application to mechanical problems.",
      "Unit 5: Need for Quantum Mechanics. Schrodinger equation for time-dependent and time independent scenarios. Application to atoms and molecules; provide qualitative picture of orbital hybridization to explain the molecular structures",
      "Unit 6: Review of Thermodynamics and introduction Statistical Mechanics and applications to problems of relevance. Lasers. Fermi statistics, bandgap in semiconductors."
    ]
  },
  {
    "Course Title": "Science Lab -I",
    "Course Code": "SC4.110",
    "Course Description": "This course, Science Lab - I, offers a foundational introduction to hands-on experimental techniques across fundamental scientific disciplines. Students will engage in diverse experiments spanning optics, including measurements of optical rotation, wavelength, and diffraction phenomena. Chemical investigations focus on potentiometric and pH-metric titrations, kinetic studies, and concentration determinations via Beer-Lambert's Law. Additionally, physical measurements involve determining material properties like Young’s Modulus and investigating Earth's magnetic field. This comprehensive lab experience equips students with practical proficiency in experimental design, data acquisition, analysis, and interpretation, fostering essential laboratory skills for scientific inquiry.",
    "Detailed Syllabus": [
      "1. Unit-1: Determination of the Specific Rotation of Sucrose and Composition of Sucrose Solution by a Polarimeter",
      "2. Unit-2: Potentiometric Titration of a Mohr Salt Solution with Standard K2Cr2O7",
      "3. Unit-3: Kinetic Study of the Decomposition of H2O2 in the Presence of FeCl3 Solution and the Effect of the Catalyst on the Rate Constant",
      "4. Unit-4: Verification of the Beer-Lambert’s Law with a given solution and the determination of the concentration of a solution",
      "5. Unit-5: Determination of pKa of a Weak Acid by pH-Metric Titration Method",
      "6. Unit-6: Newtons Ring Method to measure Radius of Curvature of Plano-Convex Lens",
      "7. Unit-7: Determination of Young’s Modulus of Material of a Beam by Method of Flexure",
      "8. Unit-8: To determine the number of rulings per unit length of a diffraction grating",
      "9. Unit-9: Stewart and Gee’s Method for Determining the Magnetic Field of the Earth",
      "10. Unit-10: To Measure Slit-Width and the Separation between two Slits of Double Slit, by Observing Diffraction and Interference Fringes and to Compare them by Microscopic Measurement"
    ]
  },
  {
    "Course Title": "Signal Detection and Estimation Theory",
    "Course Code": "EC5.406",
    "Course Description": "This course explores the foundational principles and advanced methodologies of signal detection and estimation theory. It rigorously covers optimal estimation techniques, including Minimum Variance Unbiased (MVU) estimation, Cramer-Rao bound, and practical estimators like Maximum Likelihood (MLE), Least Squares (LSE), and Bayesian approaches. Concurrently, it investigates hypothesis testing, Neyman-Pearson criterion, and likelihood ratio tests for optimal signal detection under diverse conditions, ranging from deterministic to random signals with known or unknown parameters. Students will develop analytical and design skills to implement optimal detectors and estimators, applying these robust techniques to complex problems across engineering disciplines.",
    "Detailed Syllabus": [
      "Unit 1: Estimation Theory - Minimum Variance Unbiased (MVU) Estimation, Cramer Rao lower bound, Fisher Information, Neyman-Fisher factorization, Sufficient and complete test statistics, Rao Blackwell-Lehmann-Scheffe theorem.",
      "Unit 2: Estimation methods - Best linear unbiased estimation (BLUE), Least square estimation (LSE), Maximum likelihood estimation (MLE), Bayesian Approach, Numerical methods - Newton Raphson and Expectation maximization (EM) methods.",
      "Unit 3: Detection Theory - Hypothesis testing, Neyman-Pearson (NP) theorem, Likelihood ratio test (LRT), Receiver operating characteristic (ROC), Minimum probability of error, Bayes Risk, Minimum Bayes risk detector, MAP detector.",
      "Unit 4: Detection methods–Detection of deterministic signals - Matched filter for WGN and non WGN, Binary and M-array signal detection using matched filter. Detection of random signals - Estimator-correlator and linear model; Detection of deterministic signal with unknown parameters - Composite hypothesis testing, Generalized LRT (GLRT), Bayesian approach, Rao test, Wald test."
    ]
  },
  {
    "Course Title": "Signal Processing",
    "Course Code": "EC5.201",
    "Course Description": "This course explores the fundamental principles of signal processing, starting with continuous-time signal analysis using Fourier Transforms for LTI systems. It then covers sampling, reconstruction, and analog-to-digital conversion, addressing issues like aliasing. The curriculum progresses to discrete-time signals and systems, utilizing DTFT, Z-Transform, and efficient DFT implementations (FFT). A significant focus is on designing FIR and IIR digital filters. Students will develop practical skills in analyzing complex signals and systems, applying various transforms, and designing effective digital filters, preparing them to tackle real-world problems through simulation and research-based analysis.",
    "Detailed Syllabus": [
      "Unit 1: Fourier transform (FT) of continuous-time signals, analysis of linear and time invariant (LTI) systems using Fourier transform",
      "Unit 2: Sampling and reconstruction of bandlimited signals, analog-to-digital conversion, aliasing, quantization",
      "Unit 3: Analysis of discrete-time signals and systems using Fourier transform (DTFT) and Z- Transform",
      "Unit 4: Discrete Fourier transform (DFT) for finite length sequences, efficient implementation of DFT using radix-2 fast Fourier transform (FFT) algorithms",
      "Unit 5: Digital filter design, techniques for FIR and IIR filter design"
    ]
  },
  {
    "Course Title": "Software Quality Engineering",
    "Course Code": "Credits",
    "Course Description": "This course provides a comprehensive exploration of Software Quality Engineering, focusing on the principles and practices essential for designing and analyzing high-quality software systems. It covers fundamental concepts of process and product quality, measurement techniques, and quality tactics within the software development lifecycle, including formal methods and V&V perspectives. Specialized topics include usability, accessibility, secure software engineering, and quality considerations for intelligent systems. By engaging with current research and applying well-established principles, students will develop the ability to critique existing work, identify open problems, and synthesize novel solutions for complex quality challenges.",
    "Detailed Syllabus": [
      "The course will cover the following topics: - Process and Product Quality - Measurement Fundamentals – Why, What and How? - Qualities and Tactics - Software Development Life Cycle – V & V perspective - Formal Methods and Quality - Usability and Accessibility - Qualities in intelligent Systems – Model, Data and System - Secure Software Engineering - Other research topics"
    ]
  },
  {
    "Course Title": "Software Systems Development",
    "Course Code": "CS6.302",
    "Course Description": "This course introduces foundational principles and practical methodologies for software systems development. It systematically covers essential Unix-like environments and shell scripting for automation. Students will delve into web programming fundamentals, including client-side technologies (HTML, CSS, JavaScript) and server-side scripting with Python. The curriculum further encompasses basic database programming, software development lifecycle (SDLC) concepts, and an overview of networking and security principles crucial for modern applications. Upon completion, students will be proficient in evaluating application ideas, developing diverse scripts and small-to-medium scale applications, and extending existing software solutions.",
    "Detailed Syllabus": [
      "Linux and Shell Scripting, HTML, CSS, JavaScript and related libraries, Python, Basics of SDLC, Simple Queries, Networking and Security concepts.",
      "1. Shell Programming - Linux basic commands, script writing, Swiss-army- knife tools (vi, grep, awk, sed ..)",
      "2. Web Programming - Intro to basic concepts of the World Wide Web (WWW) and tools used to develop web apps. -Client-side & server-side scripting (HTML, XHTML, CSS, Java script, Python,)",
      "3. Database Programming, Networking and Security"
    ]
  },
  {
    "Course Title": "Spatial Informatics",
    "Course Code": "CS4.408",
    "Course Description": "This course introduces Spatial Informatics, focusing on the principles and applications of Geospatial Information Systems (GIS). It delves into fundamental concepts of space and digital representation of geospatial data, covering techniques for data collection, management, and advanced analysis, including spatial queries and network analysis. The curriculum also explores data compatibility, web-GIS, and 3D GIS. Students will learn to prepare and analyze spatial and temporal data, interpret complex outcomes, and design research projects to address real-world challenges in various domain areas, uncovering critical patterns.",
    "Detailed Syllabus": [
      "Course Structure (each of approximately 1–2-week duration):",
      "1. What is Geographical Information Systems (GIS)?",
      "2. Fundamental concepts of Space",
      "3. Geospatial data and its Digital representation – Vectors and Raster",
      "4. GIS Data collection, Editing and Data formats",
      "5. Data structures for Spatial data and Spatial data management (Geospatial database)",
      "6. Spatial Data Query and Analysis – Spatial Analysis, Network Analysis",
      "7. Data compatibility - Projections and Georeferencing",
      "8. Spatial reasoning and uncertainty",
      "9. Web-GIS, GML and Map services",
      "10. Geospatial applications in few areas like in Hydrology (Water flows and floods); Ecology and Environment; Land use and Land cover; Urban planning and Transportation; etc.",
      "11. Topics in Spatial Informatics 1. 3DGIS 2. Open-Source Initiatives inGIS/RS"
    ]
  },
  {
    "Course Title": "Spatial Thinking and Practice",
    "Course Code": "TBD",
    "Course Description": "This course explores the foundational principles and practical applications of spatial thinking and spatio-temporal analysis. It covers essential methodologies for spatial data acquisition and processing, including traditional surveying techniques, modern Global Navigation Satellite Systems (GNSS), and advanced digital photogrammetry. Students will delve into fundamental concepts of geodesy, earth's gravity field, and error management in geospatial data. The curriculum integrates the conceptualization, representation, and computation of spatial information, equipping learners to implement diverse measurement techniques and critically evaluate their relevance within various geospatial contexts.",
    "Detailed Syllabus": [
      "Unit-1: Concept of Space and Time: Geographical entities and Phenomena, Properties of Space, Size and Scale, comprehend spatial and temporal data throughout the processes of conceptualization, representation, computation, and visualization.",
      "Unit-2: Surveying: Principles of Surveying, Measuring equipment, Techniques, Levelling, Triangulation and Trilateration, Plane Table Surveys, Modern surveying equipment- Total Station, The mathematical model and errors, Random and systematic errors, adjustments techniques.",
      "Unit-3: GNSS: Intro to GNSS; GNSS survey, Keplerian laws, inertial coordinate systems etc., Overview of GNSS: GLONASS, GALILEO, BIDOU, IRNSS satellite systems etc., Differential GPS: GNSS Basic Observables: GNSS Surveying Techniques. Planning and field observations: Networking, data post processing. GNSS applications to Global, Regional and Local issues",
      "Unit-4: Digital Photogrammetry: Fundamental principles and techniques of Photogrammetry surveying, camera calibration, image orientation, stereoscopic viewing, and digital image processing, photogrammetric methods for terrain modeling, Digital elevation model (DEM) generation Integration with other geospatial technologies (LiDAR, UAVs).",
      "Unit-5: Geodesy: Introduction to geodesy & its development; Earth and its gravity field. Earth and its atmosphere – physical properties, Introduction to GPS- its components, Instruments & processing software, GPS signals. GPS data collection, Data Handling-, GPS data processing, Errors in GPS data – Satellite Geometry, Multipath errors & corrections; Accuracy of GPS data. Datum transformation. Geoid modelling."
    ]
  },
  {
    "Course Title": "Spectroscopy",
    "Course Code": "SC2.304",
    "Course Description": "This course explores the fundamental principles governing the interaction of matter with electromagnetic radiation across various energy regimes. It systematically covers atomic and molecular spectra, applying both classical and quantum mechanical models to explain electronic, vibrational, and rotational transitions. Detailed discussions include Raman, Infrared, Nuclear Magnetic Resonance (NMR), and Electron Spin Resonance (ESR) spectroscopies. Students will develop the analytical skills to interpret complex spectra, apply theoretical models to spectroscopic phenomena, and calculate molecular properties derived from experimental data.",
    "Detailed Syllabus": [
      "Unit 1: Introduction: Classical mechanical description of spectroscopy, quantum mechanics and energy quantization, energy-level diagram, energy spectrum: electronic states, vibrational states, rotational states, excitation and relaxation, absorption and emission of electromagnetic waves by materials",
      "Unit 2: Atomic Spectra: Spectral series of hydrogen and alkali atoms, selection rules, L-S coupling, many-electron atoms, isotope shift, hyperfine splitting of spectral lines",
      "Unit 3: Molecular Spectra: Electronic spectra of diatomic and polyatomic molecules, Born- Oppenheimer approximation, Franck-Condon principle, absorption and emission spectra, fluorescence and phosphorescence, Jablonsky diagram, effect of solvation of electronic spectra, rotational spectrum of a diatomic molecule using a rigid rotator model, energy levels and spectrum of a non-rigid diatomic molecule, effect of isotopic substitution on rotational spectra, vibrational spectrum of a diatomic molecule using the harmonic and anharmonic oscillator models. vibrational- rotational coupling in a diatomic molecule, molecular spectra of chain molecules",
      "Unit 4: Raman and Infrared Spectroscopy: Classical and quantum theory of Raman effect, normal vibrations of CO2 and H2O molecules, vibrational and rotational Raman spectra, basic concept of infrared spectroscopy, interpretation of Raman and IR spectra, identification of Raman-active and/or IR-active modes based on symmetry arguments",
      "Unit 5: Introduction to Nuclear Magnetic Resonance (NMR), and Electron Spin Resonance (ESR) spectroscopy"
    ]
  },
  {
    "Course Title": "Speech Analysis and Linguistics (SAL)",
    "Course Code": "CL2.405",
    "Course Description": "This course offers a comprehensive exploration of speech analysis and computational linguistics, examining the fundamental linguistic units from phonemes to sentences and their acoustic manifestations. It systematically covers core methodologies for phonemic, prosodic, and text analysis, including advanced topics like visual phonetics, intonation modelling, and neural language models. Students will learn to apply computational linguistics foundations to analyze state-of-the-art speech applications such as ASR and TTS. The curriculum develops practical skills in modeling pronunciation, intonation, and text features, enabling the design of effective algorithms for robust speech processing systems.",
    "Detailed Syllabus": [
      "(Please list the order in which they will be covered, and preferably arrange these as five to six modules.)",
      "Unit-1: Speech and linguistic basics -- Description of frames, phonemes, syllables, words, phrases, sentences and its use in speech-based feature computation.",
      "Unit-2: Linguistics in speech analysis -- Overview of speech applications (such as ASR, TTS, Speech pathology etc..), use of phonemes, graphemes, prosody and text.",
      "Unit-3: Phonemic analysis -- Phonemes and its accents, visual phonetics (Spectrogram, articulatory videos), pronunciation variations and modelling, grapheme to phoneme conversion, phoneme accent variations and identification.",
      "Unit-4: Prosodic analysis -- Prosodic structure, word and syllable prominence, prominence detection and its applications, Intonation and its modelling (such as ToBI etc..), pitch and prominence variations, intonation identification, pauses, disfluencies and its detection, speech rhythm and speaking rate.",
      "Unit-5: Text analysis -- language modelling, neural language models, metrics, text normalization, character-based speech analysis."
    ]
  },
  {
    "Course Title": "Speech Signal Processing",
    "Course Code": "EC5.408",
    "Course Description": "This course provides a comprehensive foundation in speech signal processing, focusing on the intricate mechanisms of human speech. It delves into the fundamental principles of speech production and perception, progressing to detailed analysis techniques. Topics include LTI speech modeling, extraction of key speech events like pitch and formants, and advanced analytical methods such as STFT, linear prediction, and cepstral analysis. The course also examines prosody and excitation source characteristics. Ultimately, students will be equipped to understand and design algorithms for various speech processing applications, including recognition, synthesis, and speaker identification.",
    "Detailed Syllabus": [
      "Unit 1: Overview of signal processing, speech production, speech perception, typesof speech, and LTI model of speech production.",
      "Unit 2: Pitch, formants, epochs and vowel region extraction.",
      "Unit 3: Speech analysis: STFT analysis, Linear prediction analysis and cepstralanalysis.",
      "Unit 4: Prosody analysis and excitation source analysis of speech.",
      "Unit-5: Applications of speech processing such as speech recognition, speakerrecognition and speech synthesis."
    ]
  },
  {
    "Course Title": "Statistical Methods in Artificial Intelligence",
    "Course Code": "CS7.403",
    "Course Description": "This course establishes the fundamental mathematical and computational principles for statistical machine learning in Artificial Intelligence. It begins with data representation, feature vectors, distributions, and dimensionality reduction techniques. The core explores essential algorithms like PCA, Perceptrons, and Decision Trees, advancing to unsupervised learning, Support Vector Machines, and concepts of bias-variance trade-off. The final unit introduces Neural Network learning, Multi-Layer Perceptrons, Backpropagation, and an exposure to Deep Learning. Upon completion, students will be able to formulate complex problems as classification/regression tasks, explain the mathematical ideas behind popular ML algorithms, and critically analyze the practical and computational challenges in designing and implementing these systems on real-world data.",
    "Detailed Syllabus": [
      "Unit 1: Representation, Vectors, Distributions, Dimensionality reduction, problems and challenges in machine learning",
      "Unit 2: Basic algorithms in machine learning, PCA, Perceptron’s, Decision Trees, Analysis",
      "Unit 3: Popular algorithms and settings including unsupervised learning, Support Vector Machines, Kernels, Bias and Variance, Model Selection.",
      "Unit 4: Neural Network Learning, Multi-Layer Perceptron, Backpropagation Algorithms, Exposure to Deep Learning."
    ]
  },
  {
    "Course Title": "Structural Dynamics",
    "Course Code": "CE1.501",
    "Course Description": "This course provides the knowledge and skills to mathematically model and analyze the dynamic response of structural systems. It covers the formulation of equations of motion for Single- and Multi-Degree of Freedom (SDOF, MDOF) systems, exploring free and forced vibrations, damping, and mode superposition. The curriculum details numerical and approximate methods for computing natural frequencies, including Eigenvalue problems, Ritz vectors, and direct integration techniques. A major focus is on base-excited systems, response spectrum concepts, and their application in earthquake engineering, referencing codes like IS 1893. Students will be able to employ computational tools to predict and improve structural response to dynamic loading.",
    "Detailed Syllabus": [
      "Unit 1: Response of simple Single Degree of Freedom (SDOF) systems Introduction to structural dynamics; Definition of DOF; idealization of structure as SDOF system; Formulation of equations of motion for various SDOF systems; Free vibration of systems; Damping in structures; Undamped Systems; Forced vibration of systems; Steady state response to harmonic forces; Experimental determinations of natural frequency; Duhamel's integral and other methods.",
      "Unit 2: Analysis of Multi-Degree of Freedom (MDOF) systems Static force displacement relationship; Strain energy of system; Formulation of equation of motion; Evaluation of natural frequencies and modes; Free vibration of undamped systems; Forced vibration of damped systems; Review of time history & response spectrum methods.",
      "Unit 3: Numerical Methods, and Approximate methods of computing natural frequencies Eigen value problems and applications: Mode superposition principle; modal truncation errors; Ritz Vector approach; Direct Integration methods: Explicit methods - Central difference method; Implicit methods - Newmark-ß method; Rayleigh's method; Dunkerley's method; Rayleigh-Ritz method",
      "Unit 4: Base excited systems Formulation of equations of motion for SDOF and MDOF systems; Concept of spectral quantities; Response spectrum; Fundamentals of earthquake engineering; Discussion onIS 1893 (1:2016 provisions for buildings.",
      "Unit 5: Overview of dynamics of continuous systems Vibration of flexural beams and shear beams: Equation of motion; Free vibration and Forced vibration"
    ]
  },
  {
    "Course Title": "Structural Engineering Design Studio",
    "Course Code": "CE1.502",
    "Course Description": "This design studio integrates structural analysis concepts with computational methods for the comprehensive design of structural systems. The course begins with a review of classical structural analysis techniques for trusses and frames, followed by an introduction to fundamental numerical methods. A significant focus is placed on using MATLAB for developing custom structural analysis software, covering everything from linear algebra to GUI tool creation for analyzing beams and frames under various loads. Finally, students gain practical experience with commercial software (STAAD, SAP2000, ETABS) for elastic and dynamic (Modal, Response Spectrum, Time History) analysis and design of Reinforced Concrete and Steel buildings. This equips students to analyze and design components and systems efficiently.",
    "Detailed Syllabus": [
      "Unit 1: Review of Structural Analysis – Analysis of Planar Trusses, Shear Force and Bending Moment Diagrams, Structural Analysis-Force Methods-Displacement Methods, Deflected Shape- Deflections, Approximate Methods of Analysis- Gravity and Lateral Loads-Beams, Frames.",
      "Unit 2: Numerical Methods – Bi-Section Method, Gauss Elimination, Newton-Raphson",
      "Unit 3: Introduction to MATLAB – Vectors, Arrays and Matrices, Branching Statements and Loops, Introduction to Plotting, Linear Algebra, Curve Fitting, Script and Functions, Graphics -2D and 3D, Development of GUI Tool.",
      "Unit 4: Application of MATLAB – Analysis of Beams & Frames, Gravity and Lateral Load Analysis of Frames, Analysis of Planar Trusses.",
      "Unit 5: Introduction to STAAD, SAP2000 & ETABS – Modelling, Analysis and Design Concepts, Elastic Analysis and Design-Reinforced Concrete Building -Bare Frame Analysis, Analysis of Frames with Unreinforced Masonry Infills, Steel Building, Elastic Earthquake Behaviour of Buildings- Modal Analysis-Linear Dynamic Analyses and Design-Response Spectrum Analysis, Time History Analysis, Introduction to Inelastic Earthquake Behaviour of Buildings-Nonlinear Static Analysis Essentials- Nonlinear Static Analysis."
    ]
  },
  {
    "Course Title": "Structural Safety of Built Infrastructure",
    "Course Code": "Credits",
    "Course Description": "This course focuses on evaluating the structural safety and integrity of built infrastructure to prevent collapses. It introduces assessment methods ranging from rapid visual inspection and simple techniques like thrust line analysis to advanced computational methods. The curriculum delves into failure theories, material modeling (continuous, micro, macro), and numerical techniques such as Finite Element and Discrete Element methods for accurate structural assessment. A significant component covers the application and principles of various Non-Destructive Testing (NDT) techniques. Through case studies and reliability-based methods, students develop the proficiency to evaluate existing structures, analyze structural failures, and propose effective rehabilitation schemes.",
    "Detailed Syllabus": [
      "Module 1: Introduction to structural assessment, structural collapse, choice of assessment method based on available information, type of collapse, and level of assessment. Rapid visual inspection, relevant recommendations, simple methods: thrust line analysis, stability under self-weight, gravity loads, lateral loads, equilibrium governing systems.",
      "Module 2: Computational methods in structural assessment: failure theories for ductile and brittle materials, material models: continuous, micro and macro models, modelling techniques: Finite element method, discrete element method.",
      "Module 3: Non-Destructive Testing (NDT) Techniques, Overview of non-destructive testing methods, Application of NDT in structural assessment. Introduction to structural reliability.",
      "Module 4: Case Studies: Detailed discussion of case studies on structural failures of built infrastructure, indicators and rehabilitation schemes."
    ]
  },
  {
    "Course Title": "Systems Biology",
    "Course Code": "SC3.203",
    "Course Description": "This course provides an introduction to Systems Biology, focusing on the quantitative analysis and modeling of complex biological networks. It begins by examining the organization of biological networks, including motifs, modules, and hierarchical structures. The core of the course explores the design principles that govern biological systems. A major focus is placed on the dynamic mathematical modeling of biochemical systems, which includes analyzing concepts such as Biological Switches, Clocks, and the inherent robustness of these systems. Students will gain the ability to infer the underlying design principles and analyze biological systems rigorously through mathematical modeling.",
    "Detailed Syllabus": [
      "Unit 1: Network organization: Motifs, modules, and hierarchical networks",
      "Unit 2: Design principles of biological systems",
      "Unit 3: Dynamic modelling of biochemical systems",
      "Unit 4: Biological Switches and Clocks,",
      "Unit 5: Robustness of Biological systems",
      "Unit 5: Biological noise"
    ]
  },
  {
    "Course Title": "Systems Thinking",
    "Course Code": "EC5.202",
    "Course Description": "This course introduces the principles of Systems Thinking through mathematical modeling and control theory, with applications extending to biological systems. It covers the development of system models via transfer functions and state-space formulation, followed by rigorous time-domain performance and stability analysis for first and second-order systems. The curriculum addresses the design and development of Proportional, Integral, and Derivative (PID) controllers. Finally, the course transitions to biological applications, exploring biological signals, system design principles, control mechanisms, and the modeling and design of biological circuits. Students will be able to apply first principles to develop system models and use control theory to analyze and design both engineering and biological systems.",
    "Detailed Syllabus": [
      "Unit 1: Mathematical modelling of systems via transfer functions and state-space",
      "Unit 2: Time-domain performance and stability analysis of first and second order systems",
      "Unit 3: Biological signals and systems (case study)",
      "Unit 4: Design principles of biological systems and control",
      "Unit 6: Modeling and design of biological circuits"
    ]
  },
  {
    "Course Title": "Theory of Elasticity",
    "Course Code": "CE0.501",
    "Course Description": "This course provides a foundational understanding of the Theory of Elasticity, distinguishing it from Strength of Materials and emphasizing mathematical rigor. It begins with the fundamental concepts of stress, strain, traction, and the necessary mathematical preliminaries, including tensor and matrix representation. The core of the course establishes the governing equations of elasticity: generalized Hook’s law, equilibrium equations, strain-displacement relations, and compatibility conditions. It then applies these principles to formulate and solve 2D boundary value problems using stress functions and the biharmonic equation, specifically for plane stress and plane strain states. The course concludes with an analysis of torsion, bending, and elastic stability, enabling students to idealize physical systems and derive solutions for complex problems.",
    "Detailed Syllabus": [
      "Unit 1: Elasticity and its types, Inelastic material, Difference between theory of elasticity and strength of material, Materials and its properties, Assumptions in elasticity, Mathematical preliminaries: cartesian co-ordinates, introduction to tensor, matrix representation, operators and symbols.",
      "Unit 2: Concept of stresses and strains, Infinitesimal area and volume, 2D and 3D stress tensor, Stress and strain transformation at a point in an elastic body, Difference between stress and traction, Cauchy’s stress, Components of traction, Strain tensors, Types of deformation, Measurement of surface strains",
      "Unit 3: Rigid body translation and rotation of an element in space, Generalized Hook’s law, Stress- strain relationships, Equilibrium equations, Strain-displacement relationships, Compatibility conditions, Constitutive relations.",
      "Unit 4: Principal planes, Principal stresses and invariants, Octahedral plane and stresses, Deviatoric stress, Hydrostatic stress, Plain stress, Plain strain, Formulation of boundary value problems in equilibrium and compatibility, Stress functions, Biharmonic equation, Solution of 2D problems by the use of polynomials.",
      "Unit 5: Torsion of bars, Saint venant principle, Rigid body rotation, bending of beams, Elastic stability, Factors affecting lateral stability, Analysis of beam-column with different loading conditions, Different types of buckling."
    ]
  },
  {
    "Course Title": "Thinking and Knowing in the Human Sciences – II",
    "Course Code": "HS0.202",
    "Course Description": "This course explores methods of thinking and knowing about society through the lenses of history and sociology. It introduces fundamental sociological concepts such as social structures, culture, and deviance, followed by an in-depth study of major theoretical frameworks for understanding social stratification, including Structural Functionalist, Marxist, and Weberian approaches. The course also examines social institutions and processes specific to India. On the historical side, it analyzes different ideas of history (Progress, Decline) and the main methods of knowing the past, such as structuralism and post-structuralism, alongside concepts of time and space. Students will gain experience in using sociological and historiographical theories to critically engage with and analyze complex social phenomena.",
    "Detailed Syllabus": [
      "Unit 1: Sociological Concepts: Social Structures, Individuals and Groups, Socialisation, Structure/Agency, Status and Roles, Rules, Values, Norms, Culture, Discourse, Deviance.",
      "Unit 2: Sociological Frameworks and Theories: Understanding social stratification through the structural functionalist, Marxist and the Weberian methods. Introduction to key ideas of Emile Durkheim, Karl Marx and Max Weber.",
      "Unit 3: Social Institutions and Processes in India.",
      "Unit 4: Ideas of History (Progress, Decline, Morality; Facts, Objectivity, Interpretation)",
      "Unit 5: Concepts of Time and Space",
      "Unit 6: Main methods of knowing the past (Inductive and deductive methods; structuralism and post-structuralism)."
    ]
  },
  {
    "Course Title": "Topics in Applied Optimization",
    "Course Code": "MA8.401",
    "Course Description": "This course focuses on the theory and application of optimization techniques essential for modern data science. It begins by establishing a rigorous foundation in convex analysis, covering convex sets, functions, duality, and the formulation of convex optimization problems. The core of the curriculum is dedicated to exploring and analyzing various optimization solvers, including classical methods like Steepest Descent and Newton methods, as well as modern stochastic algorithms like SGD, RMSprop, and ADAM, with a focus on convergence estimates and complexity analysis. The course concludes by demonstrating the practical application of these methods in key data science areas such as Support Vector Machines, Neural Networks, Recommender Systems, and GANs. Students will be equipped to model applications as optimization problems, code efficient solvers, and apply them in research.",
    "Detailed Syllabus": [
      "Unit 1: Convex Sets, Convex Functions, Duality, Convex Optimization Problems (9 hours)",
      "Unit 2: Steepest Descent, Newton methods, Quasi-Newton Methods, Interior Point Methods, Stochastic Optimization algorithms (SGD, RMSprop, ADAM, SVRG, etc.), Convergence Estimates (6 hours)",
      "Unit 3: Applications of optimization: Recommender Systems, Support Vector Machines, Neural networks, Image, and Video Completion, Extreme Classification, Gans (9 hours) - A project related to the above syllabus will be done by students."
    ]
  },
  {
    "Course Title": "Topics in Nanosciences",
    "Course Code": "SC2.401",
    "Course Description": "This course explores the interdisciplinary field of Nanoscience, focusing on the unique properties, synthesis, and applications of nanomaterials. The curriculum establishes foundational concepts, including length scales, surface energy, and the classification of nanomaterials (clusters, nanoparticles). A core focus is on how nanoscale confinement effects lead to distinct electrical, optical, magnetic, and thermal properties. The course covers both top-down and bottom-up synthesis methods and introduces the essential tools for nano-system characterization, such as AFM, SEM, and TEM. Emphasis is placed on real-world applications in catalysis, sensing, quantum devices, and theragnostics, concluding with a critical discussion on the environmental and health hazards of nanotechnology. Students will analyze size- and shape-dependent properties and identify suitable experimental techniques for nanoscale research.",
    "Detailed Syllabus": [
      "Unit 1. Introduction to Nanoscience. (3L) Nanomaterials: Definitions and Scopes. Length Scales: Size Scales, Surface and Interface, Surface Energy, Coordination Numbers. Classification of nanomaterials: Clusters and Magic Numbers, Nanoparticles, and Colloids. Metal, Semiconductor, and Bio Nanomaterials.",
      "Unit 2. Properties of Nanomaterials. (9L) Electrons in Nanostructures. Discrete states vs. band structure: Effects of dimensionality and symmetry in nanostructures. Metal-to-nonmetal transition. Thermodynamics and Kinetics of Small-Sized Systems. Capillarity, Liquid droplets, Lotus effect. Self- assembly principles. Adsorption, Electrostatic and Steric Stabilization. Classical nucleation theory. Size and shape control in nanoparticle formation. Magnetic (Super paramagnetism), Electrical (quantized conduction and Coulomb Staircase), Optical (size and shape effects), Thermal (melting and conduction), Mechanical and Catalytic properties.",
      "Unit 3. Making Nanostructures. (3L) Top-down and bottom-up methods.",
      "Unit 4. Tools for Nano systems. Microstructure/Chemistry/Defects and Structure. (5L) AFM, SEM, TEM, XRD, SAXS, Nanoindentation.",
      "Unit 5. Applications of Nanomaterials. (4L) Catalysis, Band Gap Engineered Quantum Devices, Sensors, Field Effect Transistor (FET), Photoelectrochemical Cells, Photonic Crystals and Waveguides, Theragnostics (Magnetothermal Therapy), food and agriculture industries, automobile, textile, water treatment and civil applications, use in energy, space, and defense.",
      "Unit 6. Concerns and Challenges of Nanotechnology. (2L) Environmental, ecological and health hazards of nanoparticles. Nanotoxicology and its effect."
    ]
  },
  {
    "Course Title": "User Research Methods",
    "Course Code": "CS9.501",
    "Course Description": "This course provides a practical framework for conducting rigorous User Research, integrating both qualitative and quantitative methodologies. It introduces a 3-dimensional approach using attitudinal, behavioral, quantitative, and qualitative methods in various contexts of use, including field studies, stakeholder interviews, and lab-based observations like eye-tracking. A significant focus is placed on the ethical conduct of user studies, covering the code of conduct, informed consent, privacy, and data safety. The final component addresses data analysis, including thematic qualitative analysis and statistical techniques for data visualization and presentation of user research results. Students will learn to design and execute studies, evaluate user needs, and synthesize findings to identify problems and generate design solutions.",
    "Detailed Syllabus": [
      "(Please list the order in which they will be covered, and preferably arrange these as five to six modules.)",
      "Unit 1: Understanding User",
      "Unit 2: Lab and Field, Quantitative and Qualitative methods",
      "Unit 3: Ethics in User Research",
      "Unit 4: Statistics – How to present User Research Results Units are not equally distributed in classes but highlight the topic that will be covered under each unit.",
      "Unit 1 None",
      "Unit 2 None",
      "Unit 3 None",
      "Unit 4 Understanding User Observation Ethics Data Visualization and Techniques Presentation Introduction and Conducting studies in Code of conduct; Qualitative Analysis – Qualitative Research usability lab, Lab Participants Rights, Thematic, values, Overview – studies – eye-tracking, Privacy-data safety, product quality etc. foundation of user behavioural Respect – individual organize and experience, key terms, observations, control rights, time and effort, summarise data highlight the hall of design observations Sensitive and shame, why user- Empathetic; Risk centric design and analysis; Informed control is important; Consent attitudinal and behavioural dimension User need Field study, site visits, Quantitative Analysis"
    ]
  },
  {
    "Course Title": "VALUE EDUCATION – I",
    "Course Code": "OC3.101",
    "Course Description": "This course introduces students to the basic framework of universal human values, encouraging deep self-exploration and the development of a holistic worldview. It examines fundamental aspirations, such as Happiness and Prosperity, and the role of education and conduct in achieving them. The core curriculum focuses on understanding and living in harmony at four interconnected levels: self, family, society, and nature. Key concepts include the right understanding of physical facilities, the foundational values of Trust and Respect in relationships, and the principles of justice and peace in society. The course culminates in an appreciation of Nature and Sustainability, drawing on ideas of self-reliance. This sensitization enables students to understand their roles within a larger context and think critically about shaping the world.",
    "Detailed Syllabus": [
      "Unit 1: Goal in life - short term and long-term goals; Basic aspirations - Happiness and Prosperity; Role of education and human conduct; Self-exploration; Developing a holistic view",
      "Unit 2: Gratitude and the need to acknowledge one’s gratefulness; Understanding Self and Other.",
      "Unit 3: Living in harmony at 4 levels: self-self, self-family, self-society, self-nature",
      "Unit 4: Understanding needs of body and self; Right understanding of physical facilities and relationships; Understanding human relationships; Trust and Respect - the foundational values in relationships.",
      "Unit5: Harmony in Society; The sense of safety, justice and peace in society; Nature and Sustainability; Self-reliance and Gandhian thought"
    ]
  },
  {
    "Course Title": "VLSI Design",
    "Course Code": "EC2.201",
    "Course Description": "This course provides a comprehensive study of Very Large Scale Integration (VLSI) Design, focusing on CMOS technology and circuit optimization. It begins with an introduction to the VLSI design flow, MOSFET/FinFET transistors, and the detailed analysis of the CMOS inverter's static and dynamic characteristics (delay, power, noise margin). The core curriculum extends these principles to the design of fundamental digital building blocks like gates, latches, and flip-flops. A major emphasis is placed on delay optimization for multistage logic circuits using the Method of Logical Effort, and exploring alternative logic styles such as Pass Transistor and Dynamic Logic. Concluding with an introduction to system design using HDL, students will gain the skills to analyze, design, and verify delay-optimized combinational and sequential CMOS circuits.",
    "Detailed Syllabus": [
      "Unit 1 (Introduction to VLSI design):1) Introduction to VLSI design (top-bottom approach) - flow, applications, technologies, 2) MOSFET, FinFET transistors – Geometry and model, 3) Introduction to basic building blocks - SPICE, HDL, layout, 4) Moore’s law, technology scaling, current trends(5- lectures/7.5-hours)",
      "Unit 2 (CMOS Inverter): 1) Static characteristics- VTC, switching threshold, Noise margin, 2) Dynamic characteristics – rise time, fall time, delay, power, 3) Why CMOS Inverter, 4) CMOS inverter design flow- problem of achieving higher speeds (solution/technique discussed in the following unit), 5) From inverters to other logic - pull-up, pull-down networks, tristate inverter, Gates, Mux, Latches, Flip-flops, set-up hold time, clocked CMOS and true single phase clocked (TSPC) latches (7- lectures/10.5-hours)",
      "Unit 3 (Multistage Logic Design and Optimization: 1) Parasitics in layout causing performance degradation – field transistor, active MOS, gate-drain overlap, latch-up, 2) Method of logical effort- fan-out, Stage effort, electrical effort, device sizing, design examples. (5-lectures/7.5-hours)",
      "Unit 4 (Other Logic Styles): Pseudo nMOS, pass transistor logic, Cascode Voltage Switch Logic (CVSL), Dynamic logic. (3-lecturs/4.5-hours)",
      "Unit 5 (Other topics Introduction to System Design using HDL): Finite state machines – Mealy, Moore, Intro to RTL,Data path, Control unit, combinational and sequential circuit design examples (6-lectures/9-hours)"
    ]
  },
  {
    "Course Title": "Work, Entrepreneurship and Technology in Contemporary Societies.",
    "Course Code": "HS2.303",
    "Course Description": "This course offers a critical sociological examination of the interconnected spheres of work, entrepreneurship, and technology in contemporary societies. It begins by exploring the foundational theories and historical discourses of work, covering diverse forms, including formal, informal, productive, and reproductive labor, and analyzing the influence of social institutions like gender and caste. The curriculum then introduces the concept of entrepreneurship, investigating different types, from Silicon Valley to self-employed enterprises, and the role of finance, capital, and social networks in these processes. A final module focuses on the historical transformation of technology and its role as an institution that shapes work relations and contingent labor. Students will develop a critical outlook to analyze how technology drives and is adopted within these deeply connected economic engagements.",
    "Detailed Syllabus": [
      "Unit-1 Sociology of work: - Theories and basic concepts of work. - Historical discourses and practices around work. - Introduction to sectoral (agriculture, manufacturing, and service) understanding of work in contemporary markets.",
      "Unit-2 Diverse forms of work: Formal and informal work, and productive and reproductive work. Debt and bondage in labour markets; precarity and dignity within contemporary work arrangements. Role of social institutions (gender, caste, and technology) in shaping work and work relations.",
      "Unit-3 Introduction to entrepreneurship: Definition of entrepreneurship, historical discourses in the sociology of entrepreneurship: charismatic individuals, entrepreneurial groups, entrepreneurship as a process. Types of entrepreneurial engagements: Silicon Valley entrepreneurs, intrapreneurship, main-street entrepreneurs, and self-employed entrepreneurs.",
      "Unit-4 Entrepreneurial processes and outcomes: Value creation and the role of finance in entrepreneurship. Role of social networks (kinship and peer networks) in the entrepreneurial process. Reciprocity and resources within entrepreneurial ventures.",
      "Unit-5 Technology and contemporary economy: Historical transformation technology from the 19th century to the present – highlighting key phases of technological transformation, Globalization and technological adoption, Contingent work and digital technology, Role of technology in contemporary entrepreneurship, and technology as an institution."
    ]
  },
  {
    "Course Title": "Wireless Communications",
    "Course Code": "EC5.407",
    "Course Description": "This course provides a comprehensive introduction to the fundamental operational and design problems of modern Wireless Communications systems. It begins with a review of digital communication basics and an overview of current wireless standards and generations. The core curriculum delves into channel modeling, focusing on multipath propagation, pathloss, and various types of fading (frequency and time selectivity). It then progresses to essential mitigation techniques, covering the design and performance analysis of spatial, time, and frequency diversity techniques. The course concludes with advanced topics, including Multiple-Input Multiple-Output (MIMO) communication systems, capacity analysis, and a detailed examination of Orthogonal Frequency-Division Multiplexing (OFDM) and Massive MIMO, preparing students to design and evaluate rate and error performance of multi-antenna transceivers.",
    "Detailed Syllabus": [
      "Unit 1: Review of digital communication, optimal detection, overview of wireless communication generations and standards",
      "Unit 2: Channel modeling; Multipath propagation; pathloss and fading; types of fading; frequency and time selectivity",
      "Unit 3: Diversity techniques; spatial, time and frequency diversity; performance analysis of various diversity techniques",
      "Unit 4: MIMO communication systems; capacity analysis; MIMO receivers",
      "Unit 5: OFDM, massive MIMO, multiuser communication"
    ]
  }
]